{"author":"ridiculous_fish","author_flair_text":null,"id":"ctrb9","edited":false,"parent_id":"t3_tq0d","gilded":0,"retrieved_on":1473807842,"distinguished":null,"controversiality":0,"body":"Wow, what bullshit!  Take a look at this bit:\r\n\r\n&gt;For example, I once received an ‘F’ in writing. Imagine that. The reason: I wouldn’t cursive write...Exercising personal preferences were frowned on in government schools even then, however – hence the low grades in writing. This also illustrates how government-sponsored education attempts to strip children of their individuality.\r\n\r\nDid you catch that?  This asshole actually believes that his refusal to do the work was an expression of his \"personal preference\" and \"individuality,\" and therefore the F was unwarranted.  Isn't that exactly the sort of wishy-washy tripe that the left gets accused of propogating?\r\n\r\nThis guy pats himself on the back for his own cleverness for avoiding having \"his mind erased,\" at the same time applauding Baptists for taking their kids out of public schools to avoid exposure to \"godless\" and \"anti-Christian\" matters.  Does he really not see the contradiction there?\r\n\r\nHe says that school should be an \"adventure in ideas,\" but not if it involves \"black, Hispanic and female writers\" or \"new math,\" which introduced students to number systems other than ten (gasp), or set theory.  It sounds like he doesn't even know what the hell he wants, except one thing - to whine endlessly.\r\n\r\nPerhaps most damning, he doesn't even try to argue that private schools or homeschooling is better.  Does Mr. Yates think he would have been better off had he gone to, say, an Edison school, or been homeschooled by a Baptist?  He doesn't say, and his silence speaks volumes.","stickied":false,"link_id":"t3_tq0d","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165358197,"author_flair_css_class":null,"score":-6,"ups":-6,"timestamp_epoch":1566236761,"message_id":"10072-333bfac7-091b-4bcf-9c83-5a98263e76ea-1566236761"}