{"controversiality":1,"body":"You'd really have to go deeper into social sciences and look for research papers.  I'm not a great expert on it, but if you're going to believe an audacious poll like this, there have to be serious analysis of their methods.  Ideally, it should be reproduced in at least a couple other polls.  It just flies in the face of common sense.  It isn't impossible, but improbable and therefore requires more proof.  \r\n\r\nMost of those polls suffer from two main problems.  The CBS ones have problems with self-selection because you don't get a regular distribution of people when you're talking about a poll put up on a website.\r\n\r\nSample size isn't as big of an issue as people think, but how they phrase questions is bigger than people realize.  It's very easy to taint studies by asking leading questions, even if it's unintentionally.\r\n\r\nThe biggest problem, though, is false inference.  In this case, we're talking about a poll that said that about 50% of people believe that god created humans in their current form.  Harris, and mangleon, then infer from this that they also believe the planet is six thousand years old.  This, obviously doesn't hold up.  To prove this, you'd need to show a very strong correlation between those two opinions, which doesn't exist, to the best of my knowledge.\r\n\r\nSo, yeah, sorry for the long response.  It's a roundabout way of saying that I don't have a great answer.  The main point is to not just blindly believe things like this because they say things you want to believe.  When something comes up that's radical and hard to swallow, you really need to inspect it.  After all, isn't that Dawkins' main problem with religion?  Everything needs proof, especially when its unexpected or outlandish.\r\n\r\nThat being said, I'm sure mangleon is just going to swear at me more...     gotta love internet arguments.  :)","link_id":"t3_tq6l","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165359347,"score":0,"ups":0,"author":"teamjimmyy","author_flair_text":null,"id":"ctrdy","parent_id":"t1_ctr7w","edited":false,"gilded":0,"retrieved_on":1473807844,"distinguished":null,"timestamp_epoch":1566236761,"message_id":"10106-f616c29d-a539-403a-b1d3-6740106e56d2-1566236761"}