{"score":2,"ups":2,"created_utc":1165365756,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tq6l","controversiality":0,"body":"thevalarauk, I'm a moderate Christian from Massachusetts (a fairly liberal blue state) where even the Baptists don't have churches with 10,000 members. From the sound of it, you're a moderate Christian too. I thought that religious fundamentalists were just the squeaky wheel, the loudest element of religion, but didn't represent a large percentage of population. When I first saw that \"half the American population\" number bandied about, I too wanted to jump on such a ridiculous assertion. The [Washington Post](http://www.washingtonpost.com/wp-dyn/content/article/2005/09/24/AR2005092401262.html) quotes someone as saying \"Creationists believe man became mortal when God cast Adam and Eve out of Eden 6,000 years ago. Death did not exist before that.\" It also says that \"Polls taken last year showed that 45 percent of Americans believe that God created humans in their present form 10,000 years ago (or less) and that man shares no common ancestor with the ape.\"\r\n\r\nThat seems to me to suggest that creationists are a lot more prevalent than I would have otherwise believed. While I will agree with you that what you and I might consider \"mainstream\" Christianity does not hold these beliefs, I'm really unsure as to an actual figure. The numbers don't line up directly with 50% of Americans believing that the universe is 6000 years old (more that man is &lt;10,000 years old, not the universe), the percentage of people who believe this still seems to be much higher than I'd expect. This makes it harder for moderate Christians like myself (and I'm guessing you as well) to earn respect.","distinguished":null,"retrieved_on":1473807851,"gilded":0,"parent_id":"t1_ctr32","id":"ctrrl","edited":false,"author_flair_text":null,"author":"carpeliam","timestamp_epoch":1566236761,"message_id":"10317-ba1c1446-653c-4a44-ac34-2196a8cf2b53-1566236761"}