{"parent_id":"t1_cts5c","edited":false,"id":"cts75","author":"Eugi","author_flair_text":null,"retrieved_on":1473807859,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_tq26","subreddit_id":"t5_6","body":"Alright, it's on you liberal weiner!\r\n\r\n&gt;I'll bet anything that the median household income for people in the V.I.P. lane (that's what it's actually called) will be something like $200,000. Which, i believe, is the 99th percentile of Americans.\r\n\r\nI'll take you up on that.  See, there are plenty of businesses that pay for your flights if your job requires you to travel a lot.  Thus, your own expense of 99$ a year is meager when you consider the hassle saved.\r\n\r\n&gt;So in other words, they would have been able to get one of these cards without any trouble.\r\n\r\nDo you have any evidence to support this assertion? No? How quaint!\r\n\r\n&gt;Okay, so if you were put in charge of things, how would you fix the background checks, so that the 9/11 hijackers would have been caught?\r\n\r\nGee, you seem to be confused as to what \"background checks\" entail and exactly how the 9/11 hijackers were able to get on the plane.\r\n\r\n&gt;think of how your congressional representatives are either whisked right through or riding around in private jets.\r\n\r\nNada. I'll be thinking of how I'll be \"whisked through\" as soon as the VIP service at SFO International.\r\n\r\n&gt;Don't talk to me about bad headlines.\r\n\r\nPersonnal attack? ood raldi, you look kind of cool!\r\n\r\n\r\nSo, what do we have overall?  You failed to provide a real answer for any of your criticisms, you blew the story out of proportion and then justified it by saying that your stories with \"mundane\" titles don't get enough votes.  Try to detach yourself from your ego for a moment and take this situation in a more objectve light. Until you do, I hope you'll stay the fuck off Reddit.","controversiality":0,"created_utc":1165372822,"author_flair_css_class":null,"score":-6,"ups":-6,"subreddit":"reddit.com","timestamp_epoch":1566236761,"message_id":"10546-8a98ce54-b3ae-4c3b-bd2f-3488b8cfed29-1566236761"}