{"author_flair_css_class":null,"created_utc":1165373279,"score":1,"ups":1,"subreddit":"reddit.com","link_id":"t3_trhc","stickied":false,"subreddit_id":"t5_6","controversiality":1,"body":"&gt;That's an awfully big claim. Care to back it up?\r\n\r\nDo you think that in over 100 years of progressive social discourse, that no states have ever even once experimented in this way? Or maybe that there were never any stories written up about how positive it turned out? To be sure, there is a gleaming gem here or there, but a closer look shows these to be flukes. Someone with some decency left who was in the wrong place at the wrong time, or had a moral lapse that shouldn't have happened.\r\n\r\n&gt;Where did you get your 99% reoffender statistic from? You really think 99 out of every 100 people who kill are actually serial killers?\r\n\r\nDoesn't have to be 99%. It could be 20%, and it's still too high. No, they aren't serial killers in the technical definition of the term. But I know what you meant (repeat murderers or something like it). And yes, they generally are. At a guess, it's at least 50 out of 100, and probably more like 75. Some might do so the day after being released, others might be on a slow burn and take 20 years.\r\n\r\nThe rarest type of person of all might be one that can take another's life, and after realize that he has made a mistake for which there can be no forgiveness, no atonement. That something precious is gone forever. Hell, quite a few people who have never murdered and never will don't really see this, they just mouth the words and pretend they agree because it's easy.\r\n\r\nWithout that epiphany, what will stop him? Another lenient prison sentence and the threat of prison which is \"just too hard, I don't wanna be here!\" ? The only thing stopping him from doing it again would be some great fortune on society's part that fates him to never be frustrated by someone when there are few witnesses around. Destiny ensuring that there isn't something he wants and can't pay for but can kill for.\r\n\r\nThat might happen, but do you want to wager the lives of your loved ones on it?","retrieved_on":1473807859,"distinguished":null,"gilded":0,"parent_id":"t1_cts5k","id":"cts7w","edited":false,"author_flair_text":null,"author":"NoMoreNicksLeft","timestamp_epoch":1566236761,"message_id":"10555-7d86ed21-d45a-4200-84de-183d92954b4b-1566236761"}