{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_trhc","controversiality":0,"body":"&gt;At one point, not all that long ago, Americans held slaves. That is considered one of the more egregious crimes against humanities, and most people take a pretty dim view of slavery today. I suspect that someone who kept slaves today would probably be considered a sociopath.\r\n\r\nOne that continued to own them, even having experienced it? Yes, most would be sociopaths. A few would free them, and never own another. Some misguided people might continue to own them, but try to treat them well, as if this made it right. But most would justly be considered sociopaths.\r\n\r\n&gt;Clearly, killing off everyone in the society was not necessary to allow people to stop acting in such a fashion.\r\n\r\nAnd yet it took several generations of descendants of slaveowners dying off, before we could finally rid (and not completely even now) of the sentiments that made it possible for men to own slaves. It really did take all the slaveowners dying, and their children, and their grandchildren...\r\n\r\n&gt;If Hans Reiser is found to be guilty of his wife's murder, do you not think that he could still make useful contributions to society?\r\n\r\nI'm sure he could make contributions. Hell, I might even enjoy such under other circumstances. Can all murderers make such contributions? Do we only give leniency to those who can? If we give it to all, are the contributions even significant in our reasoning for this leniency?\r\n\r\nMany cultures have something like blood money. This is the same thing. You can't buy your way out of it, we shouldn't allow it. Even if we dress it up in pretty \"contributions\".\r\n\r\nWhat then, of his likelyhood of repeating it? He didn't stomp a homeless guy to death, but murdered a wife that he was involved in some sort of custody dispute with, if memory serves. The circumstances are different, and suggests that he might not murder anyone else. But there'd still be damage and trauma done, if he were to remain free. He'd be the wedge between children and grandparents. Keep him away from the kids, it'd harm them, let him have them, it'd harm them.\r\n\r\nThere aren't any easy answers on how to deal with all of this. But letting the guy out on weekend furloughs after the first 18 months isn't an answer either.","score":3,"ups":3,"created_utc":1165374447,"author_flair_css_class":null,"subreddit":"reddit.com","parent_id":"t1_cts6l","id":"cts9y","edited":false,"author":"NoMoreNicksLeft","author_flair_text":null,"distinguished":null,"retrieved_on":1473807861,"gilded":0,"timestamp_epoch":1566236761,"message_id":"10595-446aa9e3-20e5-48e8-b153-75cfd1e4ac34-1566236761"}