{"subreddit":"reddit.com","created_utc":1165375457,"author_flair_css_class":null,"score":-5,"ups":-5,"controversiality":0,"body":"&gt;Why are you making wild guesses? According to the Bureau of Justice Statistics (NCJ 193427 if you want to look the report up), the recidivism rate for people convicted of murder is 1.2%\r\n\r\nBased on conviction. How many murders go unconvicted? Let's go with 1% though. So, 1 out of 100 will kill again, and we have no way of knowing. We let these guys out early, or never put them away at all.\r\n\r\nWe allow 99 rightfully convicted murderers to pretend to be people and have low-wage blue collar jobs pretending to be people, for their own sake. And we ensure that another person will die (minimum, the guy we let loose could easily kill 2 or 3 witnesses to his liquor store robbery).\r\n\r\nWhat did society get out of this? A cheaper tax rate? Or are you back on the \"contributions to society\" kick? We get nothing, they get something, and some poor innocent soul dies early because the idea of locking away animals forever offends your enlightened sensibility? That's no bargain.\r\n\r\n&gt;&gt;The rarest type of person of all might be one that can take another's life, and after realize that he has made a mistake\r\n&gt;As the statistics show, not only are these people not rare, they are the overwhelming majority.\r\n\r\nNo, not at all. They might show that somehow we get lucky and the homocidal freaks never get pissed off enough, or there just so happens to be a squad car parked outside at the time. Or that they've improved their method, left no witnesses, and no one knows. The statistics don't even come close to proving that beatification is in order, that they've reached a higher spiritual plane, or even that they cried for the victim once instead of themselves and their awful prison experience.\r\n\r\nMy argument doesn't rely on numbers, even if they really are what you say they are, it's too high. Even if they're only half that. Justice isn't accountancy, murder isn't an overdraft. You shouldn't be allowed out of it, and we shouldn't juggle numbers to arrive at our conclusions. At some point, we end up putting a dollar amount on a human life, and since we both have one of those, doing so cheapens us.","stickied":false,"link_id":"t3_trhc","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473807861,"distinguished":null,"author":"NoMoreNicksLeft","author_flair_text":null,"parent_id":"t1_ctsa5","id":"ctsbc","edited":false,"timestamp_epoch":1566236761,"message_id":"10620-b96b3782-fdfd-4eb3-92cc-332472f0aa80-1566236761"}