{"body":"&gt; &gt; But think about how much you changed between the ages of 15 and 23 - can you really say that there's no chance he might?\r\n\r\n&gt; Yes, I can. There is no chance worth taking.\r\n\r\nYou've confused two different things here.  The chance of him changing, and the risk incurred by releasing him.\r\n\r\nYou believe the risk isn't worth taking.  Okay, I get that.  But that doesn't mean that there's no chance of him changing, merely that you don't value it as much as I do.  That's a conflict of opinions about the risk, not delusion about the ability to change.\r\n\r\n&gt; Yes, I can. There is no chance worth taking. Is this the same as impossible? Hell no.\r\n\r\nSo you aren't actually disagreeing with my claim that there's a chance, which means you don't have a basis for calling me delusional.\r\n\r\n&gt; 1 out of 20 kids like him can change in that amount of time.\r\n\r\nWhat is your basis for this number?  That number sounds as wrong to me as your other numbers.\r\n\r\n&gt; Tell us just what you do think befits it, other than a 7 year sentence. That's it?\r\n\r\nNo.  I think prisons should be a combination of unpaid labour, next to no perks or socialising with other prisoners, and the opportunity of vocational training.  This reduces the drain on society, reduces the risk of re-offending, and increases the contribution he can make to society once he is released.\r\n\r\n&gt; His contribution to society? He's gonna cure cancer?\r\n\r\nWhy are you assuming that just because he's killed somebody, he's incapable of doing any good whatsoever?  At the very least he can get a job and pay taxes himself instead of draining money out of the taxpayers' pockets for free food and accommodation.\r\n\r\nIs this a religious thing?  Do you believe in evil as an actual force that has permanently inhabited him?\r\n\r\n&gt; To a smaller degree, I was pissed that someone would mod you down. That should only be used to get rid of the ijits not contributing to discussion.\r\n\r\nIf you want to contribute to discussion, blatant straw men arguments are very counter-productive.\r\n","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_trhc","stickied":false,"subreddit":"reddit.com","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165376594,"author":"Bogtha","author_flair_text":null,"parent_id":"t1_cts6c","id":"ctse8","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473807862,"timestamp_epoch":1566236761,"message_id":"10647-ef406726-bcc4-4bed-806a-c2ae00d1b1f2-1566236761"}