{"id":"ctsis","edited":false,"parent_id":"t1_ctse8","author_flair_text":null,"author":"NoMoreNicksLeft","retrieved_on":1473807865,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_trhc","subreddit_id":"t5_6","controversiality":0,"body":"&gt; You've confused two different things here. The chance of him changing, and the risk incurred by releasing him.\r\n\r\nGranted.\r\n\r\n&gt; But that doesn't mean that there's no chance of him changing, merely that you don't value it as much as I do.\r\n\r\nOn the contrary. I value it more than anything. I also value world peace, that doesn't make it real.\r\n\r\n&gt; That's a conflict of opinions about the risk, not delusion about the ability to change.\r\n\r\nAnd a physicist might say that it's not impossible that all the molecules of air will crowd into a cubic inch space in the corner of the room leaving you to explode from decompression, it's just absurdly improbable. Yet, it would be delusional if I went around expecting that to happen to people all the time, or worse, if I somehow thought I could influence if just by being less cynical.\r\n\r\n&gt; So you aren't actually disagreeing with my claim that there's a chance\r\n\r\nIn theory? No. I agree. In practice? Yes, I am. In theory, you could win the lottery jackpot, in practice I am completely safe in saying that you will never win. And I consider the chance in this example comparable to the chance of redemption in this kid's case, if not perfectly equal.\r\n\r\n&gt; What is your basis for this number? That number sounds as wrong to me as your other numbers.\r\n\r\nMade up. Hypothetical examples. Feel free to replace with your own, which was something more like 99 out of 100. Still stand by the argument.\r\n\r\n&gt;No. I think prisons should be a combination of unpaid labour, next to no perks or socialising with other prisoners, and the opportunity of vocational training. This reduces the drain on society\r\n\r\nSo their 30 cents and hour can make any sort of dent into the actual cost of incarceration, let alone victim compensation (for those crimes which aren't so heinous as to make the idea an insult)? No, prison labor is usually about corruption. Some friend of a politician gets cheap workers who can't complain about conditions without going back to the cell.\r\n\r\n&gt;reduces the risk of re-offending\r\n\r\nHow? By teaching murders how to be industrious? By god, this is stupid, almost as bad as those boot camps they sometimes try (the last thing we want is for them to be stronger and more disciplined). If the world has to suffer murderers, let them be lazy murderers.\r\n\r\nEven if such \"vocational\" labor allowed them to get a high-paying job once they got out (let's peg this at $70,000 a year unless you disagree), do you think this would do anything for those who killed for thrills? That being able to buy an HDTV without pimping the girlfriend will substitute for whatever fun he had stomping in a ribcage? Poverty may be the root cause of many crimes, but make a criminal non-poor, and you still have a criminal who's just living it up. They'll still commit crimes when it suits them.\r\n\r\n&gt; and increases the contribution he can make to society once he is released.\r\n\r\nYou keep mentioning this, but I never hear anything. Since this particular kid is capital L loser material, feel free to pick another one, or to make one up. Paint the rosiest contributions-to-society picture that you can for us. It still doesn't make a damn bit of difference.\r\n\r\n&gt; Why are you assuming that just because he's killed somebody, he's incapable of doing any good whatsoever?\r\n\r\nBecause what good can reasonably be attributed to him, is the same a pack animal might be made to do. He may be evil, deranged, or whatever, but he's still a human being. \"Making him useful\" strikes me as creepy.\r\n\r\n&gt; At the very least he can get a job and pay taxes himself instead of draining money out of the taxpayers' pockets for free food and accommodation.\r\n\r\nMy taxes are a small price to pay. If we want to reduce the tax bill there are all sorts of things to try first. Suggesting that we start here implies that its not about taxes at all.\r\n\r\n&gt; Is this a religious thing? Do you believe in evil as an actual force that has permanently inhabited him?\r\n\r\nAtheist. I believe there may be such a thing as evil, perhaps. But not demonic possession. Even that would exonnerate him, eh? We'd perform an exorcism then.\r\n\r\nOr maybe there is no such thing. Doesn't matter. He's responsible, and it's pathetic that responsibility must be forced on such people.\r\n\r\n&gt; If you want to contribute to discussion, blatant straw men arguments are very counter-productive.\r\n\r\nYou asked why I was obnoxious. I gave the small part of the answer that I was willing to give.\r\n\r\nIntuitively, I can see that your \"solution\" is anything but. It increases risk to those of us who don't murder people, and gives us nothing in return... even if I did accept that we could barter our principles so freely. It won't result in either a perceptibly better society, or an imperceptibly better one. It won't result in lower bills come April 15th, any savings will be used for some other pork project. The only ones that benefit, are those that no longer deserve all the rights that people do. People who don't deserve my sympathy, people who have acted worse than animals. It doesn't make me feel better to daydream about him getting out any sooner. It won't make me feel better if he really does get out sooner. This may or may not be due in part or whole to irrational and/or emotional responses on my part.\r\n\r\nBut who is to say that those would be bad things? Society's emotions and irrationalities are just as important to its wellbeing, maybe just more difficult to quantify for those that have to put a number to everything. And asking me to \"grow up\" and stop being less like that, especially before you've asked him to grow up and figure out why stomping homeless people to death is a bad thing besides getting caught for it... that's just. Well, asinine.","created_utc":1165379175,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","timestamp_epoch":1566236761,"message_id":"10728-4840aba3-e7ba-4dae-bb1e-5e53ac6bf541-1566236761"}