{"created_utc":1165379620,"author_flair_css_class":null,"score":-3,"ups":-3,"subreddit":"reddit.com","stickied":false,"link_id":"t3_trhc","subreddit_id":"t5_6","body":"&gt; Are you seriously saying you don't think he's got any chance of doing something - anything - worthwhile in fifty-five years?\r\n\r\nFor himself, or for society? For himself, sure. He could go on vacation, or fuck a pretty woman, or drink beers while fishing, or watch movies that he likes. But we've already established that I don't care a single shit about him.\r\n\r\nFor society? Most likely, he'll never become more educated, and even then much past highschool level will be forever beyond him. He's not a criminal genius, after all, if the best appeal he can make is that prison's \"too hard\". Lacking that, what else is there? Some contribution to the arts? The only thing I'd bet on him being capable of is voluntary medical testing, but that might be illegal.\r\n\r\n&gt; Again with the straw man. Nobody is saying he should get off scot free. \r\n\r\nNah, you already have him bartering \"contributions to society\" for a lighter sentence. Taken to its extreme, it really is giving him free homocides in return for some spectacular contribution. You just hope to sneak it by by turning down the volume on the contribution and on the sentence reduction.\r\n\r\n&gt; Pointing out a logical fallacy does not mean I'm basing my argument on game theory.\r\n\r\nLogic by itself is hardly a platform to argue from. What's logical at all about being nice to him? If he has nothing to offer us, or nothing that we can't afford to do without, and if it makes us feel good, why not torture him for years on end? Certainly logical, such a course of action. Logic by itself is completely amoral.","controversiality":0,"retrieved_on":1473807865,"distinguished":null,"gilded":0,"edited":false,"id":"ctsju","parent_id":"t1_ctsg4","author":"NoMoreNicksLeft","author_flair_text":null,"timestamp_epoch":1566236761,"message_id":"10745-70342a1e-6bb7-42f0-abf5-83b540541a11-1566236761"}