{"author_flair_text":null,"author":"pdq","edited":false,"parent_id":"t1_ctshj","id":"ctskb","gilded":0,"distinguished":null,"retrieved_on":1473807867,"body":"This was so funny to read, I had to refute most of the baseless claims made:\r\n\r\n\"Ten reasons why Django kicks Ruby on Rail’s ass.\"\r\n\r\nI count 8.\r\n\r\n\"Furthermore, since Python has a more active userbase and more frameworks...\"\r\n\r\nAnd this proves what? That the language is older?\r\n\r\n\"...if Adrian Zolovaty, Jacob Kaplan-Moss and all of the Django developers suddenly dropped dead after I finish writing this, the porting of the code would be much easier than if Rails’ development stopped, where you would be stuck in the middle of nowhere if you ran into an issue.\"\r\n\r\nIs this assertion is based on evidence, or just completely pulled out of your ass? Rails is open-source as well, and regardless, I’m guessing you’re not the person that would be picking up the slack if this scenario did occur.\r\n\r\n\"Since Django’s inception, the templates have been designed so that there is no need to be a programmer to know how to create the templates.\"\r\n\r\nUnless you can show a side-by-side example of how it is superior, this argument is baseless.\r\n\r\n\"With Django, there is no need to program when the operations being done are listing or editing objects, listing entries by date, or any of the basic CRUD operations...\"\r\n\r\nAre you just reading this from Django marketing slides? Rails invented the scaffolding technique, if you’ve been paying attention at all.\r\n\r\n\"[The] actual processing speed for a Python program is much faster than a Ruby program\"\r\n\r\nYou allude to this earlier, but this is a baseless argument. Python best case is 50% faster than Ruby (without YARV), and *neither* of the frameworks will scale to even 5% of Amazon.com, so what does this argument prove? The point of the framework is to get things done quickly (aka. productivity), not to support 15,000 concurrent users.\r\n\r\n\"RoR has become a massive buzzword everywhere\"\r\n\r\nSo is TG (TurboGears) is a buzzword as well?\r\n\r\n\"Free, JustWorks™ Admin interface\"\r\n\r\nOh, so buzzwords are okay now?\r\n\r\n--\r\n\r\nMaybe you should lay of the Koolaid a little. There's a reason that Ruby on Rails has been so popular, and no, it's not due to a \"Non kick ass\" conspiracy.  \r\n\r\nThere’s plenty of room for many languages and many frameworks in this world. Proving superiority based on meaningless zealous arguments is a waste of everyone’s time. \r\n","controversiality":0,"subreddit_id":"t5_2fwo","link_id":"t3_tsel","stickied":false,"subreddit":"programming","score":-9,"ups":-9,"author_flair_css_class":null,"created_utc":1165379936,"timestamp_epoch":1566236761,"message_id":"10757-07a50f0c-a37b-4737-9512-980595d5f49c-1566236761"}