{"body":"I beg to differ with your last statement.  What power has the federal government to enforce anything onto the state?  It can withold funds, for one; and, in large part, the purse-strings of the federal government, by this manner, have controlled the States like a puppeteer.  But outside this, the only manner in which any leverage could be obtained is by war.  Say the federal government orders Virginia to change some rule of collecting evidence for her (State) judiciary -- fat chance in hell that Virginia would comply, and the federal government could do little to enforce their policy (the fact that it would be a gross breach of the constitution little matters; afterall, where is the provision which says the federal government has any power over education etc., and yet it passes numerous laws on the subject).\r\n\r\nI also contend with your statement that power tending to collect in the hands of a few is the problem; indeed, it is the principle of Republican government.  It being recognized that the people, from whom all power stems, as a whole cannot with propriety control the State en masse, they vest a Legislature with the powers necessary for an efficient and vigorous government.  Power here is in the hands of a few, but it is certainly not \"the problem\" but rather the best known principle on which liberty might be preserved.  The problem, I would contend, is that no parchment of paper ever protected the rights of the people; it is rather up to a well educated and knowledgeable populace, who jealously guard their liberties.  As to education, I think this is a serious cause of problems in America.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tocn","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1165382362,"author_flair_css_class":null,"author":"ghhardy","author_flair_text":null,"parent_id":"t1_ctqoc","edited":false,"id":"ctsnt","gilded":0,"distinguished":null,"retrieved_on":1473807868,"timestamp_epoch":1566236761,"message_id":"10818-f5182a47-88ae-44fb-9e07-25e8bc932a49-1566236761"}