{"created_utc":1164983188,"author_flair_css_class":null,"score":0,"ups":0,"subreddit":"reddit.com","stickied":false,"link_id":"t3_t48y","subreddit_id":"t5_6","body":"&gt; just count the number of times when two people are talking a lot (3 times more likely women) and they're actually SAYING something, i.e. have an intelligent conversation on topics like politics, environment, live, the universe and everything. Something that challenges the brain.\r\n\r\nThis is what I was commenting on.  There's an implicit assumption in many of these comments that \"intelligent conversation\" means politics, environment, life, the universe, or everything.  And if you define it that way, *of course* men are more intelligent - you've set the definition of intelligence to precisely those things that men, on average, care about more (read Deborah Tannen's *You Just Don't Understand* for more on this).  But that's victory by tautology.\r\n\r\nMy point is that there's a whole different realm out there that is equally difficult - or moreso, for men - to master.  And that's the \"micro world\" of individual interactions.  You can't honestly say that this is less important than politics or the environment or the universe.  After all, you're far more likely to be thrown out in the cold by your wife than to have global warming bring on another ice age, and you're far more likely to be fired because your boss hates you than because your President hates you.\r\n\r\nAs for challenging the brain - talk to a few girls and get to know them well enough that they treat you like just another one of the girls.  The gossip will make your head spin.  It's human nature to dismiss things that make our head spin as unimportant; women often feel the same way about politics, environment, life, the universe and everything.  That doesn't mean it's unchallenging or mundane - it means that *you've* chosen not to be challenged by it.\r\n\r\n(I should add that I'm speaking in generalities here - I know girls who absolutely hate smalltalk and gossip and would much rather talk about life, the universe, and everything.  But the article talks in terms of statistics, so I do too.)","controversiality":0,"retrieved_on":1473807483,"distinguished":null,"gilded":0,"id":"ct87p","edited":false,"parent_id":"t1_ct7ro","author_flair_text":null,"author":"nostrademons","timestamp_epoch":1566236758,"message_id":"1165-bb5712aa-2539-4df7-a2e2-4f43e321b805-1566236758"}