{"gilded":0,"distinguished":null,"retrieved_on":1473807919,"author":"[deleted]","author_flair_text":null,"edited":false,"parent_id":"t1_cttd6","id":"ctvfr","subreddit":"reddit.com","ups":2,"score":2,"created_utc":1165432418,"author_flair_css_class":null,"controversiality":0,"body":"I agree Eagleton was over the top with his rhetoric, but I think he did make a number of valid points as well, and really he just turned the tables on Dawkins.   Dawkins is all too prone to snide jeering, and seeing that turned back on him seemed like poetic justice in a way.  The general issue that reviewers and I have with Dawkins is that while he criticizes the most primitive notions and arguments regarding God, he never touches the more intellectually sophisticated ideas.  By an large much of what he criticizes are the same ideas of God that a first year divinity school student would have dismissed with.  And he really appears to show a poor understanding of any more sophisticated theology.  A recent example that comes to mind is an article featured in the Independent in which Dawkins answered various reader questions.  In one response Dawkins claimed that Einstein was an atheist.  Einstein's quote he used to justify this was, \"It was, of course, a lie what you read about my religious convictions, a lie which is being systematically repeated. I do not believe in a personal God and I have never denied this but have expressed it clearly.\"  Einstein's quote was that he did not believe in a \"personal God,\" not that he didn't believe in God. That is a common distinction to make in theology, many people who believe in God don't believe in a personal God.  It's an elementary distinction as well, and anyone who would like to claim that they understand theology should know it.  So either Dawkins isn't aware of the distinction, in which case he's unaware of the basics of theology and is certainly not fit to criticize, or he was being dishonest which is just as bad.  That sort of thing is unfortunately common.  I've gotten rid of the God Delusion since I didn't regard it as worth keeping or I would have been happy to offer more cites.\r\n\r\nAs far as theologians go, I'd be more interested in seeing discussions with academic theologians/philosophers of religion than members of various church's political structures.  I recognize that Dawkins may not just be grabbing low hanging fruit because it is easy, but because simplistic theological ideas are common, fuel the worst of the fundamentalists zeal, and are certainly deluded, but all the same it's tedious.  Most more thoughtful people that believe in some form of God that I know really do have a more sophisticated idea of God than an invisible superhero in the sky.  If Dawkins really wants to dismiss theology properly, he really should deal with things like kenotic panentheism, process theology, and so on.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tivn","timestamp_epoch":1566236761,"message_id":"12081-2995086e-9fa6-49c5-935b-312c3932a0a5-1566236761"}