{"controversiality":0,"body":"*Their work also suggests that the disadvantages that poverty imposes on children aren’t primarily about material goods. True, every poor child would benefit from having more books in his home and more nutritious food to eat (and money certainly makes it easier to carry out a program of concerted cultivation). But the real advantages that middle-class children gain come from more elusive processes: the language that their parents use, the attitudes toward life that they convey.*\r\n\r\nThis is a good example of science finally catching up to something a lot people have known for a long time. I wonder what the difference is between the number of books on parenting that high socioeconomic status parents and low socioeconomic status read. It seems like this is a problem that fundamentally is never going to be solvable, but can probably be ameliorated to a high degree.\r\n\r\n**On No Child Left Behind**:\r\n\r\n*Despite the glowing reports from the White House and the Education Department, the most recent iteration of the National Assessment of Educational Progress, the test of fourth- and eighth-grade students commonly referred to as the nation’s report card, is not reassuring. In 2002, when No Child Left Behind went into effect, 13 percent of the nation’s black eighth-grade students were “proficient” in reading, the assessment’s standard measure of grade-level competence. By 2005 (the latest data), that number had dropped to 12 percent. (Reading proficiency among white eighth-grade students dropped to 39 percent, from 41 percent.) The gap between economic classes isn’t disappearing, either: in 2002, 17 percent of poor eighth-grade students (measured by eligibility for free or reduced-price school lunches) were proficient in reading; in 2005, that number fell to 15 percent.*\r\n\r\nTeaching basic literacy takes about sixty hours by a trained professional. The materials required cost less than one hundred bucks a student. Not entirely sure why a school system can't do it in thirteen years. The funny thing is even if you go to these schools in DC where the literacy level in low-income minority students is basically zero, they still get graded on a bell curve just like everyone else. Sort of reminiscent of Plato's cave analogy. \r\n\r\n**On GPA**:\r\n\r\n*Surprisingly, she found that the self-discipline scores were a more accurate predictor of G.P.A. than the I.Q. scores by a factor of two.*\r\n\r\nI don't see how this is surprising, it's been known for forty years ever since the Marshmallow Test.\r\n\r\n**On Progress**:\r\n\r\n*Principals don’t pay much attention to the research papers being published in scholarly journals, and the academics have yet to study closely what is going on in these schools.*\r\n\r\nNo Comment.\r\n\r\n\r\nP.S. is there a way to make the bold font less bold? It looks terrible.\r\n","subreddit_id":"t5_6","link_id":"t3_tvg9","stickied":false,"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1165434546,"author":"Alex3917","author_flair_text":null,"parent_id":"t3_tvg9","id":"ctvn4","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473807922,"timestamp_epoch":1566236761,"message_id":"12186-29ea7dc4-484d-4d65-bfbe-b2bfc5d9b5dd-1566236761"}