{"created_utc":1165437144,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_tivn","subreddit_id":"t5_6","body":"&gt;seeing that turned back on him seemed like poetic justice in a way.\r\n\r\nFrom 'seemed like...' and '...in a way' I impudently suggest your response to Eagleton is a sneaking liking for seeing a man that you dislike attacked, but that you recognise that it's really a pretty bout of 'mispunching' itself.\r\n\r\n&gt;Einstein's quote was that he did not believe in a \"personal God,\"...So either Dawkins isn't aware of the distinction,\r\n\r\nDawkins is. I have my copy of the Delusion handy still, and in Chapter 1 - which quotes Einstein in considerably more detail - I find:\r\n\r\n'Deists differ from theists in that their God does not answer prayers...and does not intervene with capricious miracles. Deists differ fro pantheists in that the deist God is some kind of cosmic intelligence, rather than the pantheist's metaphoric or poetic *synonym* for the laws of the universe. Pantheism is sexed-up atheism. Deism is watered-down theism.'\r\n\r\nNow I'm vaguely aware this has simplified a number of distinctions from a theological point of view, and I suspect that last deliberately ribald line has made your teeth itch: but the point he makes here and in many other places is that he rejects the existence only of a God who engages in supernatural acts and interacts with humanity. God as love, God as possibility, God as the totality  of all thinking minds, and Einstein's God - 'To sense that behind anything thqat can be experienced there is a something that our mind cannot grasp and whose beauty and sublimity reaches us only indirectly and as a feeble reflection, this is religiousness. In this sense I too am religious' - is not God the answerer of prayers. Dawkins explicitly states that in this sense too, *he* is religious.\r\n\r\nThe vast majority of believers do not go this far, although some of them may retreat into this territory when more the self-contradictions in supernatural belief become evident. There is, for example, an explicit statement of what Christians believe at the heart of the doctrine of the major denominations, and it includes the affirmation that Jesus *literally* was God and rose from the dead, not that a faith-healer was in some sense God and that he lives on in the words spoken by his followers.\r\n\r\n&gt; If Dawkins really wants to dismiss theology properly, he really should deal with things like kenotic panentheism, process theology, and so on.\r\n\r\nFrom my knowledge of panentheism - which I know is limited and superficial so I'll have to trust you to poke specific holes, rather than just say 'you don't understand, shut up' - it still involves the explicit acknowledgement of the supernatural, albeit in a less gross and more sophisticated way than most mainstream belief. But either Jesus got up and walked around, or he didn't. Either he actually rose again, or there was some sort of mental or social phenomenon which was *in some sense* him walking again. I reject the first possibility in favour of the second, because it's a much more simple explanation that's satisfactorily explains both the contradictions in the Jesus mythology and the conflicts with other fields of study. That's what Dawkins objects to.\r\n\r\nAnd to return to my point above, if you walked into any church in Europe and asked the congregation how many of them could explain panentheism to a degree that satisfied you as a sophisticated understanding - or even how many knew what the word meant - what kind of percentage would you expect to answer positively?","controversiality":0,"retrieved_on":1473807926,"distinguished":null,"gilded":0,"parent_id":"t1_ctvfr","id":"ctvuc","edited":false,"author_flair_text":null,"author":"lessofthat","timestamp_epoch":1566236761,"message_id":"12276-3e070993-a8f5-437e-b897-d127fdc0432e-1566236761"}