{"subreddit":"science","created_utc":1164985739,"author_flair_css_class":null,"ups":1,"score":1,"body":"Assuming William Connolly doesn't write Steve McIntyre's wiki entry, his background seems pretty clear:\r\n\r\n&gt; McIntyre has worked in hard-rock mineral exploration for 30 years\r\n\r\n&gt; He holds a Bachelor of Science degree in pure mathematics from the University of Toronto, though no graduate degree\r\n\r\n[Tallies with his biography](http://www.uoguelph.ca/~rmckitri/research/stevebio.doc). It mentions a pure maths courses, PPE studies at Oxford, policy analysis and lots of mining *business* work; no particular mention of statistics, though evidently he has some skill.\r\n\r\nDon't get me wrong, I'm not trying to diss the guy. He is free and right to study and challenge important findings and some interesting issues and technicalities were raised, as glenra indicated above - such is the scientific process. But as I understand it, other independent researchers have confirmed the general thrust of the Hockey Stick curve and [as the NRC report concludes](http://news.bbc.co.uk/1/hi/sci/tech/5109188.stm)\r\n\r\n&gt; *Based on the analyses presented in the original papers by Mann et al and this newer supporting evidence, the committee finds it plausible that the Northern Hemisphere was warmer during the last few decades of the 20th Century than during any comparable period over the preceding millennium.*\r\n\r\nGalileo and The Church? At least Steve McIntyre's personal blog and the climate scientists' RealClimate are both taking a scientific approach! If it's pre-enlightenment witch-hunting you're after, this [New Scientist article](http://www.newscientist.com/channel/earth/mg19225765.000-climate-change-special-state-of-denial.html) outlines the apparently systematic strategy of tarnishing the reputations of climate scientists.","controversiality":0,"stickied":false,"link_id":"t3_t14v","subreddit_id":"t5_mouw","gilded":0,"retrieved_on":1473807487,"distinguished":null,"author_flair_text":null,"author":"gIowingsheep","edited":false,"id":"ct8ej","parent_id":"t1_ct43f","timestamp_epoch":1566236758,"message_id":"1248-6ad1e28c-9109-472a-8b4d-5941def4e5a2-1566236758"}