{"score":-1,"ups":-1,"created_utc":1165443428,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tvr2","body":"The site has been blocked and I will read it later, but I did want to make some comments on the most superficial of information (title of post, title of blog, comments).\r\n\r\n*(Edit: I've read the post now, and I feel this is all I really need to change in the comment, the rest still holds)*\r\n\r\n1)  It amazes me the ends some people will go to avoid using Occam's Razor.  Let's think for a second--in the face of:\r\n\r\n1. (relatively more) parental disinterest from the fathers\r\n2. the social norms of mothers being caretakers and fathers being breadwinners\r\n3. and the much more obvious physical involvement of the mother in bearing children\r\n4. the decision of custody is made by individual judges and courts all across the country\r\n\r\nwe have a blogger who would speculate that the government is involved in a vast conspiracy to press all of these judges and courts to award custody to the mother.  All so the Feds can get an (not insubstantial, but not earth-shattering) 2% cut of child support?  Hey, maybe the judges are traditionalists?  Maybe the fathers don't fight as hard (and don't hire the better lawyers)?  I don't know about you, but I'm inclined to believe the simplest and most obvious answer's probably the truth and keep my loose change for tolls.\r\n\r\n2) This blog has been submitted several times to reddit, and she's apparently been enmeshed in some heated blog-war over inflammatory use of the photo of somebody else's child.  Point is, she seems to enjoy lobbing grenades into crowded rooms to see if she'll get a reaction (refer to the uncouth--though perhaps not untrue--entry about feminism killing her rape-fantasy sex life, posted to reddit).  As Ann Coulter knows, exaggeration and incendiary words get you attention (and traffic) but they're almost never going to adequately prove a point (which is why the scientific method and research paper conclusions are always so muted in tone).\r\n\r\n3) I can't wait to see what's behind the title \"The Deadbeat Dad Myth\" but I can assure you (and I'm sure we all know) that deadbeat dads are far from a myth.","controversiality":1,"distinguished":null,"retrieved_on":1473807937,"gilded":0,"edited":false,"id":"ctwgu","parent_id":"t3_tvr2","author":"duketime","author_flair_text":null,"timestamp_epoch":1566236762,"message_id":"12576-d8f18c54-5421-4403-a141-ba9600854f23-1566236762"}