{"author":"lifeofliberty","author_flair_text":null,"edited":false,"id":"ct8gm","parent_id":"t1_ct6ly","gilded":0,"distinguished":null,"retrieved_on":1473807489,"controversiality":0,"body":"The \"helpful hands on the farm\" mentality to raise or assist the family economic status is no longer true in America. There are several other factors that teach larger families (including ignorance of course), religion, lack of self regulation (birth control, abstinence), etc.\r\n\r\nThis is why my original point of **education** is money well spent. It's not just the economic *decline* that families should be worried about by having too many children, it's the entire issue of overpopulation on a finite world.\r\n\r\nAnd no, the US is **not** about to sustain our current and future population, not even close.  Go look it up.  Right now, our oil imports, for example are over 70% and climbing.  This oil produces food, fertilizers, pesticides, transportation, energy, cars, roads, consumable products and goods of a thousand types.  Calling this \"sustainable\" isn't even remotely true.  Even the switch to alternate energy is plagued with problems (ever see an electric powered transport ship?, or electric semi-truck?).  The lack of a distributed infrastructure to support alternative energy is yet another massive, unsolved issue.\r\n\r\nBut it does all boil down that the world's existing populations, and the populations of America, are indeed, not the least bit sustainable in a world of dwindling resources.\r\n\r\nAnd I will also add a correction, it's not (only) that we have *\"too many people consuming more then they produce\"*, the issue is more fundamental.  The issue is we are **over producing** from non-sustainable sources.  Oil, coal, minerals, natural gas, all these *examples* are finite.  We are massively overproducing products, depleting these non-renewable natural resources very quickly, while at the same time, making a massive contribution to green house gasses and global warming.\r\n\r\nIt boils down to ethics, populations and (of course), profits. But it is indeed all interelated, interconnected and at present trends, totally unsustainable.\r\n\r\nYou want to talk economics?  What is the economic sense in rapid overproduction with non-renewable resource depletion, industrial pollution and global warming? Such a business model is doomed to failure.  Our entire *civilization* is built upon this methodology.  Diamond's \"Collapse\" reveals just how shaky our future is, as do many others.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_t3v1","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1164986792,"author_flair_css_class":null,"timestamp_epoch":1566236758,"message_id":"1272-2b608fda-16fb-448d-bd7c-49c00f2e08e6-1566236758"}