{"distinguished":null,"retrieved_on":1473807951,"gilded":0,"parent_id":"t3_tu1t","id":"ctx5t","edited":false,"author":"carpeliam","author_flair_text":null,"score":6,"ups":6,"author_flair_css_class":null,"created_utc":1165454022,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_tu1t","stickied":false,"body":"What exactly does this say about the Bible (any combination of those below would work, or I could be missing a few):\r\n\r\n1. the messages and themes in the Bible are completely ridiculous\r\n2. some translations got it all wrong\r\n3. people who take the Bible literally are completely ridiculous\r\n4. people who believe that the entire Bible is still 100% relevant are completely ridiculous\r\n5. people who read into the Bible without proper context are completely ridiculous\r\n\r\nI'd tend to believe that 2 through 5 are right, that might be because I'm a Christian. It just occurred to me that some of you might actually want to know the reasoning behind some of this stuff? I'll try and present it as objectively as possible. As far as multiple translations go, yes there are multiple translations, and yes many tend to disagree with each other. The more modern translations are usually more accurate because they use (what we have for) the original sources, but even the oldest sources we have don't always agree, so a lot of inferences and intelligent guesses are made. Personally, I think stories like the story of Job are supposed to teach lessons, not to be taken literally, but others believe that once you start taking some parts figuratively, you reach a [slippery slope argument](http://www.answersingenesis.org/creation/v22/i3/unbelief.asp). Many Christians (I'm going to go out on a limb and say most Christians) believe that the Jews had the \"old covenant\", with Abraham, and the Christians have the \"new covenant\", with Jesus. Jesus actually spoke out against certain things in the OT (citation?). Also, I think you can't take 10 verses out of the bible and poke fun at them without going into the historical context. The Bible can (and should) be analyzed as a historical work, not just a religious work, and if you look at just the face of things, of course they'll appear silly. But laughing at some random verse out of the Bible is like laughing at some indigenous man with a stick through his nose wearing a loincloth. You analyze the history of it a bit more, then you understand. And if you analyze the history and you're still laughing, then ok :) at least you have an informed opinion.\r\n\r\nSo I'm pretty sure I'll get downmodded for such an extremely long comment, not to mention the rather unpopular Christian viewpoint, but I've tried to keep it objective and maybe even slightly informative. So there you go.","controversiality":0,"timestamp_epoch":1566236762,"message_id":"12880-5eb227fd-b00e-45dd-802d-0df2996d0729-1566236762"}