{"subreddit_id":"t5_6","link_id":"t3_tvxs","stickied":false,"body":"I was in the immediate area 2 years ago.  The road the Kims were attempting to take to Gold Beach had at that time been closed by a significant landslide.  Given the nature of the landslide, the area, how long the road had already been closed (a couple of years), and the sign I eventually saw regarding the closure -- after first encountering it and then doubling back -- I suspect that the road is still closed.  This was not evident on the current state map at that time, and I don't recall signage warning of the closure ahead of the one of the last, already fairly remote, turnoffs before the main road essentially dead ended some miles further on.\r\n\r\nThat turnoff was to unpaved, county and/or forest service roads entailing quite steep grades.  There was some sort of advisory against taking those roads -- even in summer -- without a four wheel drive vehicle having good clearance.  The turnoff was, per the posted map, not to a clear, single route but instead to a potentially confusing network of such roads covering several of the adjacent mountainsides on the south side of the Rogue River Valley.\r\n\r\nThe one closure sign I did see, as I indicated above I only saw upon doubling back.  It was apparently not too hard to miss, although I remember feeling foolish once I did find it, so that might have been squarely my oversight.\r\n\r\nBased on all this, I suspect one of two things happened.  1)  They missed the closure sign and got caught either en route to or upon return from the landslide across the main road.  2) They attempted the turnoff and stranded their car on the rough, unpaved roads.\r\n\r\nI looked at the location the AP news stories are describing as being where Mr. Kim was found, on topozone.com, cross referencing with google maps.\r\n\r\nAs best I can tell from the google maps photography, I believe the landslide was (is?) located at one of these two points.  It was not terribly far from the BLM-34-8-36 / NF-23 intersection with Galice Road.\r\n\r\nhttp://www.google.com/maps?f=q&amp;hl=en&amp;q=grants+pass,+oregon&amp;ie=UTF8&amp;z=18&amp;ll=42.555866,-123.651713&amp;spn=0.001683,0.005203&amp;t=k&amp;om=1\r\n\r\nhttp://www.google.com/maps?f=q&amp;hl=en&amp;q=grants+pass,+oregon&amp;ie=UTF8&amp;z=18&amp;ll=42.557229,-123.666728&amp;spn=0.001683,0.005203&amp;t=k&amp;om=1\r\n\r\nTopozone shows Big Windy Creek to be a fair distance farther on.  Further, there is a ridge between NF-23 and its watershed.\r\n\r\nhttp://www.topozone.com/map.asp?lat=42.6522&amp;lon=-123.724&amp;datum=nad27&amp;u=4&amp;layer=DRG&amp;size=l&amp;s=50\r\n\r\nFrom the landslide location, there is a very clear, walkable, and not terribly long route along paved road back to the intersection with Galice Road.  If Mr. Kim had a map, he would be aware that the town of Galice is only a short distance further.\r\n\r\nGiven his decisions, the difficulty in locating his car, and where his attempted walk-out ended up, I'm inclined to think he ended up on the unpaved roads that provide the only bypass for the landslide.  This is only speculation, though.\r\n\r\nIn closing, the lower Rogue River Valley, through the coastal range, is one of the roughest terrains in the area.    From what I've read, access to it was as a result developed relatively rather late and it remains a remote area in terms of accessibility.\r\n\r\nhttp://en.wikipedia.org/wiki/Rogue_River_(Oregon)\r\n\r\nZane Grey described the area in his novel \"Rogue River Feud\".","controversiality":0,"score":9,"ups":9,"author_flair_css_class":null,"created_utc":1165458363,"subreddit":"reddit.com","id":"ctxdx","parent_id":"t1_ctwe7","edited":false,"author":"pasbesoin","author_flair_text":null,"distinguished":null,"retrieved_on":1473807956,"gilded":0,"timestamp_epoch":1566236762,"message_id":"12980-359d638f-8c2a-41e8-b110-febc45bbbe2c-1566236762"}