{"score":6,"ups":6,"created_utc":1165460457,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tvr2","body":"Hey, although uncited, she comes *dangerously* close to a statistic:\r\n\r\n&gt; Over two thirds of the divorces are initiated by women who were promised that they can have it all\r\n\r\nWell, I'll do her work for here:\r\n\r\nhttp://marriage.rutgers.edu/Publications/pubtoptenmyths.htm\r\n\r\nData!\r\n\r\nFirst, she's being mildly deceptive in saying \"over\" two-thirds, when the studies say \"two-thirds\" which is a little less harsh.  Second, she's being **grossly** deceptive with everything after \"by women\".  She treats women as fundamentally gold-diggers who take a paycheck for ditching when their gold-digging doesn't come through.  The article I linked indicates women are motivated by gentle custody laws.  This subtly implies that the marriage is broken anyway (or not healthy i.e. if divorce laws favored men, the divorce would still happen, but the man would initiate) and that the *children* are the priority.  The data doesn't indicate explicitly if the children are the priority for themselves or for the child support, but it does suggest they want the kids because, oh I dunno, they're their mothers!  Additionally, a lot of divorces occur because men much more tend to do things that make them bad parents than women (drink, gamble, abuse, carouse).  But in her statement, she implies that women initiate divorce over 2/3 of the time and, by tagging the last bit on the end, implying that the reason is **always because the man could not provide for her lavish desires**.\r\n\r\nThe most damning part is that she looked up the stat (10 secs, Google), perhaps finding my same site, but willfully ignored the research (damned lies!).\r\n\r\nFinally, she sympathizes with the man who dutifully makes his payments and indicts him for being a paycheck dad (another hypocrisy), a point I can understand, but perhaps ignoring his intentions.  He actually does care.  Anyway, I assume this inspired the name \"The Deadbeat Dad Myth\" but, as illustrated by the fact about the man's drinking, abuse, ..., there are men that women initiate divorce with, for non-monetary reasons, simply because the man is not a good father.  Yeah, he's also probably not going to keep up his child support and I think it's pretty fair to call guys like these deadbeats.  Funny she doesn't mention these cases.\r\n\r\nAnd, oh I've read the article now, and those points in my other comment still hold, so you all can upvote that now.","controversiality":0,"distinguished":null,"retrieved_on":1473807957,"gilded":0,"edited":false,"id":"ctxi8","parent_id":"t1_ctx7z","author":"duketime","author_flair_text":null,"timestamp_epoch":1566236762,"message_id":"13036-99a7a29b-2372-4f55-893b-00f140c31253-1566236762"}