{"controversiality":0,"body":"There are also a lot of concrete scams in the USA for some reason. Examples:\r\n\r\n* Man comes to your house because he sees you have no concrete driveway. He offers to do it at an amazingly cheap price. Sure enough after you pay him, the concrete guys start to work the next day and finish it in record time for a very low price. Since you're new to concrete driveways, you might not notice that the water doesn't wash off properly because it's not shaped right, and that it might not be grooved or pre-cracked so in about 6 months you may end up with cracks. But before you notice this, and after about 1 month, the concrete man comes back and gives you a sob story about how he couldn't really do the job for such a cheap price and now needs to pay his other workers a little more money to complete the deal. A sucker (like me) ends up feeling sorry for him and pays him a small chunk of extra cash, such as $100. About 6 months later, you wise up and start to see the cracks, the discoloring, the uneven-ness, the fact that water doesn't wash off properly and stays in bowls, etc.\r\n\r\n\r\n* Another scam is a guy who proclaims to be a bonded foundation installer. A general contractor (or yourself) will hire him to be used on building a (or your) house. He comes in and builds the concrete foundations in record time simply by digging a small hole about 2 feet deep and often only 1 feet deep in some places, then stacking concrete blocks on top without rebar metal inside, and then pouring concrete down the middle of the blocks. If no one is there to catch him, the concrete used is QuickCrete, which isn't really recommended for strong foundations, and especially without rebar or without putting the hole at least 4 feet deep or more. Also, the square used for the hole may only be slightly bigger than the blocks, when it's better to have a 3x3 foot hole, or 4x4 foot hole. In the end, it takes very little time, very little concrete, and the so-called \"foundation expert\" can get in and out quickly. Sure enough, the foundation will work for awhile fairly adequately for about 4 months until the house starts to settle dramatically. Meanwhile, these guys are often paid in tax free cash and they skip to the next county under a different alias. If you try to inquire some paperwork for a bond or some kind of ID card, they make up some excuse and if you don't buy it, they simply get in their truck and go to the next town. They rove several states like this, never getting caught.\r\n\r\n\r\nI should know about these things. I fell for them. The second scam above cost me $20K for RamJack to relevel the middle of my house, and then RamJack said the job was too big and couldn't relevel the back of my house without an additional $20K. Right now, we're saving up for the last $20K.\r\n","subreddit_id":"t5_6","stickied":false,"link_id":"t3_ttog","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1165474600,"author_flair_css_class":null,"author":"supermike","author_flair_text":null,"id":"cty6s","edited":false,"parent_id":"t3_ttog","gilded":0,"distinguished":null,"retrieved_on":1473807969,"timestamp_epoch":1566236762,"message_id":"13330-6b7bcf34-97b3-4619-b8d0-239bc9073593-1566236762"}