{"author_flair_text":null,"author":"grauenwolf","parent_id":"t3_twtt","id":"ctycg","edited":false,"gilded":0,"retrieved_on":1473807972,"distinguished":null,"controversiality":0,"body":"From the study referenced:\r\n\r\n&gt; 1. The NSWC experiment was conducted in a very short time-frame with very little direct funding. Thus many corners had to be cut, including significant simplification of the problem itself; the largest of the prototypes was only 1200 lines of code.\r\n\r\n&gt; 2. The geo-server specification was by nature ambiguous and imprecise, thus leading to some variation in the functionalities of the developed prototypes. (On the other hand, the specification is probably typical of that found in practice, especially during requirements acquisition.)\r\n\r\n&gt; 3. The participants were trusted entirely to report their own development metrics. In addition, not all of the participants attended the first meeting at NSWC; those who did attend were advantaged.\r\n\r\n&gt; 4. No guidelines were given as to what exactly should be reported. For example, development times usually included documentation time, but there were major variations in the code-size/documentation-size ratios. In addition, different methods were used to count lines of code for each language, and it is not clear how one line of code for one language relates to that of another.\r\n\r\n&gt; 5. The review panel had very little time to conduct a really thorough review. For example, none of the code was actually run by the panel; they relied on the written reports and oral presentations.\r\n\r\nThe problem was grossly simplified, the code was rushed, the line count and time spent numbers questionable, and the final application never run. \r\n\r\nThis is your proof? \r\n\r\nWe don't even know what those 85 lines of Haskel actually work with good inputs, let alone if they correctly responded to bad data.\r\n","stickied":false,"link_id":"t3_twtt","subreddit_id":"t5_2fwo","subreddit":"programming","created_utc":1165479498,"author_flair_css_class":null,"score":9,"ups":9,"timestamp_epoch":1566236762,"message_id":"13402-cf26d842-9270-401f-a924-c9173d968899-1566236762"}