{"edited":false,"id":"ctyj3","parent_id":"t3_ty8s","author_flair_text":null,"author":"cgibbard","retrieved_on":1473807977,"distinguished":null,"gilded":0,"link_id":"t3_ty8s","stickied":false,"subreddit_id":"t5_6","body":"What does it mean that 0/0 = N? Well, by the usual definition, x/y means xz, where z is a number such that yz = 1. This is exactly what it means to divide one number by another.\r\n\r\nSo, let's assume that 0/0 = N, which means that there must be some number z so that 0 z = 1, and then by our assumption, 0 z = N. Oh look, we have N = 1 already, but there's more nonsense here.\r\n\r\nThere are not so many rings where this happens. (See [Wikipedia:Ring](http://en.wikipedia.org/wiki/Ring_%28mathematics%29) for the mathematical definition of a ring, which are the usual rules which we'd like to have in order to refer to something as remotely number-like).\r\n\r\nIn particular, suppose that 0 z = 1. By the distributive property, we have that 0 z + 0 z = (0 + 0) z = 0 z. By adding -(0 z) to both sides, we get 0 z = 0. So 1 = 0 z = 0, and we have that 0 and 1 are equal. There's exactly one ring where that happens, the trivial ring, it has only one element, 0, which is the same thing as 1 in that ring, 0 + 0 = 0, and 0 * 0 = 0, and that's all there is to it.\r\n\r\nNow, you *can* evade such a catastrophe if you throw away some of the rules about the way that numbers operate -- you have to throw away at least one of the assumptions in what I used above. It's unlikely that you're willing to throw away the definition of 0 or 1, or negation. You could throw away distributivity, but that would disconnect addition from multiplication and they would no longer be related to one another at all. You could change the definition of division, but then you're not doing what you claim to be doing, because you've changed the problem.\r\n\r\nFundamentally, allowing division by 0 in a system breaks lots of the nice rules which we've come to be familiar with -- enough so that if you want to do that, you're probably better coming up with another notation altogether which doesn't look like division.\r\n\r\nAnother important thing I'd like to point out is that 0^0 tends to be defined in mathematics, and it is equal to 1. There are many many reasons for this, they're discussed at [Wikipedia: Zero raised to the 0th power](http://en.wikipedia.org/wiki/Empty_product#0_raised_to_the_0th_power) if you'd like to read all about it. One of my favourites is that for natural numbers n and m, we have that n^m is the number of functions from a set of m elements to a set  of n elements. There's exactly one function from an empty set to an empty set, namely, the empty function.\r\n\r\nAnyway, I'm a bit frightened that this man is permitted to teach children mathematics.","controversiality":0,"author_flair_css_class":null,"created_utc":1165485084,"score":27,"ups":27,"subreddit":"reddit.com","timestamp_epoch":1566236762,"message_id":"13481-b0c54293-fb5f-4237-8000-0e3bce44718b-1566236762"}