{"body":"We just sold our house to the first person to look at it, at the full asking price.  Of course, our home is not a McMansion (1442 square feet).  I can't help but think that the giganto-huge houses that builders insist on throwing together is the single biggest problem in the housing market today.  While families are, on average, getting smaller, houses are getting much bigger.  Growing up, my family of four lived in a house smaller than the one we just sold.  Now, I'm moving with my girlfriend and my dog into a much smaller place.  I didn't feel crowded growing up in a 1200 sq ft house with three other people, and I don't expect to feel crowded living in a probably ~700 sq ft apartment with my girl and my dog (but since we're moving to Silicon Valley, I might end up a wee bit crowded in a 500 sq ft place).  What are people putting into those 3000 sq ft behemoths that makes it worth heating/cooling, cleaning, driving an extra 20-30 minutes or more to work, and paying the huge mortgage?  I thought I had a lot of junk...but I'd be hard pressed to fill that much space.\r\n\r\nSo, in a market where those huge places are barely selling for $55/sq ft after weeks or months of being listed, we sold our modest sized house in the suburbs for $89/sq ft on the first day after I posted an ad on Craigslist.\r\n\r\nThat seems to tell me something about the housing market, at least in central Texas (Austin area).  I think there's a dearth of good normal sized housing in sane locations, while nobody really wants those big giant houses out in the sticks that builders have increasingly focused on.  I suspect a smart builder could make a killing by figuring this out--develop small homes as close to city centers as possible, and just charge more per square foot.  People are buying closer to cities...not so much in the boonies.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tvcu","subreddit":"reddit.com","score":2,"ups":2,"created_utc":1165498573,"author_flair_css_class":null,"author_flair_text":null,"author":"SwellJoe","id":"ctz3x","edited":false,"parent_id":"t3_tvcu","gilded":0,"distinguished":null,"retrieved_on":1473807987,"timestamp_epoch":1566236762,"message_id":"13670-74983dec-bca5-4bb5-b3db-6cbaf4c75c55-1566236762"}