{"score":6,"ups":6,"author_flair_css_class":null,"created_utc":1165498697,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_twhc","stickied":false,"controversiality":0,"body":"[Here](http://www.thailandlife.com/ordination/interview.htm)'s an interesting interview with a new Buddhist monk in a temple in Thailand - probably not what you were expecting:\r\n\r\n&gt; \"I usually get up at about 5 a.m. and then take a shower. I then prepare myself to go out on the alms round. It takes a while for me to put on all of the robes. I then leave at about 6 a.m. When I come back, I put all the food on a tray and sort it out. For example: curries, desserts and drinks. We then give some food to the Buddha image and do some chanting. After that we just eat until we are full. I then usually go back to sleep for a few hours. Sometimes I walk around the temple grounds and chat with other monks. Sometimes we watch t.v. We do this until lunchtime which is about 11 a.m. We cannot sit down for lunch later than 11.30 a.m. Most people think we cannot eat after mid-day. But that isn’t true. If we don’t get up from the table, we can actually eat all afternoon! But no-one is going to do that because that is crazy. In the afternoon I might sleep again or chat with the other monks. Sometimes I watch t.v. In the late afternoon, when it has become cooler, we then do our chores. We sweep around the temple and water the plants. At 7 p.m. I go with a group of other monks to the big meeting hall to chant. Not everyone goes. It is your choice. We chant for about one hour. After that, my group of monks usually goes to sit by the river and drink and chat. When I say drink, I mean soft drinks! We are not allowed alcohol. We chat there until about 9 p.m. Then we go to bed.\"\r\n\r\nand:\r\n\r\n&gt; But some monks do have a comfortable beds and pillows. They even have air-conditioning, cable tv and computer in their room. There are different kinds of monks here. Some are serious about being a monk. Others are here because they cannot do anything else. If you stay in the right temple, it can be quite a comfortable life. Good food and good money. I think most monks make about 10,000 baht a month. There are of course some bad monks. I know that the ones in the kuti next door to mine take drugs. They order the drugs by mobile phone and it is delivered to their door by motorcycle taxi in the evening. Talking about delivery. Guess what I had for lunch today? My aunt ordered pizza for me!\"\r\n","distinguished":null,"retrieved_on":1473807987,"gilded":0,"edited":false,"id":"ctz45","parent_id":"t3_twhc","author_flair_text":null,"author":"Luc","timestamp_epoch":1566236762,"message_id":"13675-1af8c9d6-ad21-432f-b8e7-5aeb07507cda-1566236762"}