{"subreddit":"reddit.com","score":-1,"ups":-1,"author_flair_css_class":null,"created_utc":1165507778,"body":"I am very interested in reading Dr. Anderson's paper when published. But what strikes me most interesting is that there are so many extremely strong reactions against his idea.  Obviously it has struck a chord with a lot of people and that often happens when a long standing idea is challenged. (At one point in time not too long ago it was just taken as fact that the sun revolved around the earth.  Challenging that idea could have resulted in your execution.)\r\n\r\nUnless you have already read his mathematically rigorous theory and proof as would be published in a paper and found a rigorous flaw with it, i think it would be premature and immature to dismiss his idea or resort to name calling.  \r\n\r\nMathematicians should have no reason to feel threatened by his proposition if indeed it is \"so obvious that he is wrong.\"  But it appears that most of the comments are intended to do just so after only having read an article written in layman's terms.\r\n\r\nNumber fields are defined by axioms - if he has been able to define a set of elements that adhere to the axioms, then would be nothing mathematically incorrect with his arguments. I have not seen anywhere where he has stated that nullity lies in the Real Number field; thus it does not \"break\" the arithmetic of numbers most people are familiar with.\r\nHe is in fact saying that nullity \"sits outside the conventional number line.\"\r\n\r\n The problem is that it may be very difficult (albeit not impossible) for the average person to come up with a metaphor to help them understand nullity.  For example, you don't have to understand the Rational Number field to know that 1 apple plus 1 and a half apples is 2 and a half apples.\r\n\r\nPeople often use this lack of understanding to give themselves permission to use the perverse justification: \"If I don't understand it, it must be wrong/he must be an idiot.\" \r\n\r\nDr. Anderson has an interesting idea and once formally defined then it should be reviewed critically.  \r\n","controversiality":1,"subreddit_id":"t5_6","link_id":"t3_ty8s","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473807999,"author_flair_text":null,"author":"crumpeta","parent_id":"t3_ty8s","edited":false,"id":"ctzog","timestamp_epoch":1566236762,"message_id":"13918-75335ea3-71aa-46a1-99ab-12449385429a-1566236762"}