{"distinguished":null,"retrieved_on":1473808007,"gilded":0,"id":"cu040","edited":false,"parent_id":"t1_ctzrj","author":"crumpeta","author_flair_text":null,"score":0,"ups":0,"author_flair_css_class":null,"created_utc":1165513039,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_ty8s","stickied":false,"body":"I respect that your opinion is that it is not useful and is wrong - and it is just that, an opinion - a subjective viewpoint.  Your specific personal opinion above could not exist without you existing. Another way to put it is that I cannot engage in a conversation with you about our disagreement of your viewpoint if you don't exist. Your opinion \"lives\" in you as a person.\r\n\r\nA mathematical theorem and proof is objective - that is, it exists independently of its discoverer.  It can be verified without anything else except the mathematical language used to define the problem. The theorem and proof \"live\" in an objective system - ANYONE can verify its validity within this system (mathematics) without the prescence of the theory's one or mulitple discoverers. \r\n\r\nSo I agree that you have a subjective opinion that Dr. Anderson's discovery is wrong and not useful. \r\n\r\nBut to find a rigorous mathematical error in Dr. Anderson's mathematically rigorous theorem and proof means you are providing an answer in the same dialect used to define the problem. So in essence you need to prove WITH mathematics that nullity is incorrect, inconsistent or contradictory using his formal definition as submitted to a mathematics journal and not in a BBC article.\r\n\r\nWhat i'm trying to say is that I think people are judging too quickly without really knowing whole details and without providing a counterargument in the same rigorous format he defined his theory in.\r\n\r\nAs far as it being useful - who knows.  The Complex Number Field may not seem useful to the average person.  But it ended up being useful as a tool for mathematicians to further understand how other fields work (off the top of my head I think it was the Real Number field).\r\n\r\nLikewise, I am guessing, he is suggesting that with nullity we may be able to understand better how the undefined properties of 0 can be thought of/used in other Fields, be it mathematical or CS oriented. It would be a mathematician's burden to find a proof for validity of nullity as a legitimate mathematically rigorous tool.  \r\n\r\nI think too many people jumped to give out simple examples of how with simple arithmetic, or specification XYZ.999FOO, or small code snippets in Haskell(sp?) or C++ they can \"prove\" that nullity is \"absurd and therefore he is a quack - see how so much smarter I am? And I iz 3l1t3! See-ma? I'm a know it all!!!\" \r\n\r\nGrow up. \r\n\r\nGIve this guy a break - can't someone propose a new idea without people who are not mathematicians call this guy names? - let his peers prove him wrong - they know and have the tools to do so OR (in the OS software spirit) learn that branch of math yourself to prove him wrong.  Pick on someone your own size - let's see the slew of papers submitted to math journals from couch potato joe who today \"proved\" Dr. Anderson wrong.\r\n\r\nYou never know - nullity may end up solving a problem that you may not benefit from but maybe your grandchildren will.  Instead of squashing it out of ignorance, let it prove that it can survive on its own.","controversiality":0,"timestamp_epoch":1566236762,"message_id":"14111-2aa227fa-6862-40a7-8ed6-985e70ac9c58-1566236762"}