{"subreddit":"reddit.com","created_utc":1165520185,"author_flair_css_class":null,"score":17,"ups":17,"controversiality":0,"body":"You can always define new numbers. That's the beauty of definitions. The ugly side is trying to keep your definitions from being boring, or worse, inconsistent. This isn't inconsistent, but I don't think it's particularly interesting either. Like I mention in another comment, *undefined* and *indeterminate* aren't new concepts to calculus.\r\n\r\nWorse, he doesn't seem to try to do anything with them that's actually tricky. If you've ever tried to extend the complex numbers (and I know we all have!), you discover that handling exponentiation is a *first-class bitch*. x^y is supremely weird even when restricted to the positive real numbers, and it only gets worse when you add 1/0 and 0/0 to the mix.\r\n\r\nDon't believe me about x^y being weird for positive reals? Try a couple simple calculations:\r\n\r\n`1^1 = 1`\r\nTrivial, right?\r\n\r\n`1^2 = 1`\r\nYou're wasting my time\r\n\r\n`1^0.5 = ?`\r\nhmm, `1` and `-1` both work. I can arbitrarily restrict the value, but that means I have to be very careful solving equations involving square roots. The quadratic equation doesn't work if you forget the `+/-`\r\n\r\n`1^0.25 = ?`\r\nGreat, now there are four of them: `1`, `-1`, `i`, `-i`\r\n\r\n`1^3.1 = 1^(31/10) = (1^31)^0.1 = ?`\r\nAnything of the form `e^(pi/5*k*i)` will work, where `k` is any integer. That gives ten distinct values before we hit `e^(2*pi*i) = 1` and start looping around\r\n\r\n`1^3.14 = (1^157)^0.02 = ?`\r\n`1^3.141 = ?`\r\n`1^3.1415 = ?`\r\n`1^pi = ?`\r\nA (countably? uncountably?) infinite number of points around the unit circle on the complex plane? screw you, I'm outta here\r\n\r\nEdit: silly reddit, eating my multiplication symbols. I'm new to this commenting thing","stickied":false,"link_id":"t3_tzna","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808018,"distinguished":null,"author_flair_text":null,"author":"lukestebbing","id":"cu0ri","edited":false,"parent_id":"t3_tzna","timestamp_epoch":1566236762,"message_id":"14381-8ccce595-b42f-49b4-abc7-54bff4a31d85-1566236762"}