{"gilded":0,"retrieved_on":1473808029,"distinguished":null,"author_flair_text":null,"author":"NitsujTPU","id":"cu1c5","parent_id":"t3_u0r5","edited":false,"subreddit":"programming","author_flair_css_class":null,"created_utc":1165526711,"score":28,"ups":28,"controversiality":0,"body":"I like articles of this nature, but don't find this one to be particularly good.\r\n\r\n\r\nFirst, why be a programmer who prefers only one language?  Identifying yourself as a &lt;language&gt; programmer is annoying.\r\n\r\nSecond, why smalltalk?  Why not LISP or ML, you know, the other polarizing languages of choice.  We're leaving perl out since we know that that opinion doesn't count, but you know that those people are the ones most likely to make the \"my language is perfect\" argument.  Do you really want to equate yourself to the sort of people with the mindset that perl is the perfect language?\r\n\r\nThird, some of those points are non-points.  The assignment, the boolean bit.  Do you really read code that does this?\r\n\r\nFourth, I agree with you on the prefixes.  No point against the article here.  It's annoying.\r\n\r\nFifth, see mjd's comment regarding return statements.  In my opinion, doing this makes it easier to read.\r\n\r\nSixth, switch statements... The valid reason to use a switch rather than polymorphism is when everything is integral.  In fact, this is the only time that a switch even works in C++.  So, yes, if you have your classes returning integers in order to determine their type, and run different code accordingly, then this is silly.  Of course, spawning class \"One,\" \"Two,\" and \"Three\" when you really want a switch to deal with an integer is beyond asinine.\r\n\r\nSeventh, I sort of agree with gxti's comment regarding procedure lengths.  My argument is different though.  This 10 lines a procedure business is typical of the kind of hippie garbage that you see slung around in corporate circles... mostly backed up by poor arguments.  It's not that it isn't at all true, but it's not so true that one should be dogmatic about it.\r\n\r\nEighth, agreed on the XML.","link_id":"t3_u0r5","stickied":false,"subreddit_id":"t5_2fwo","timestamp_epoch":1566236762,"message_id":"14604-eb9d1ef2-87d4-403f-aaea-dea83f154d66-1566236762"}