{"gilded":0,"distinguished":null,"retrieved_on":1473808052,"author_flair_text":null,"author":"UncleOxidant","edited":false,"id":"cu2ju","parent_id":"t1_cu1f9","subreddit":"science","score":13,"ups":13,"author_flair_css_class":null,"created_utc":1165549203,"body":"Problem is that most jurists are just so ignorant and more than willing to follow the judges 'orders' to the jury.\r\n\r\nI was on a jury a few years ago for a drug \"posession\" case.  I put \"possession\" in quotes because the defendent didn't have the drugs on him.... they were found on his buddy.  The defendent was being charged with some bizarre, made up category called \"constructive possesion\" (http://en.wikipedia.org/wiki/Constructive_possession ) meaning that if he could possibly have taken posession of the drugs he is guilty.  So basically he and his buddy were found walking through a field and the cops got suspicious for whatever reason (they were hispanics which was probably enough reason for our whitebread cops) and decided to go ask'em what they were doing and then when the other guy (not the defendent) was seen to throw something out of his pocket the cops searched and found a little plastic baggy with a teeny, tiny amount (a gram or two?) of cocaine in it.  No evidence that the defendent in this case even knew about the cocaine.  However according to the prosecutor the defendent was in \"constructive possession\" of the drugs and therefore he must be guilty.  And the judge explained the law and basically told us that you can't judge the law (I guess knowing that some of us were going to call BS on that particular law).  Af first it was pretty evenly split but after a couple of hours the foreman was able to convince everyone but myself and a hispanic woman to convict - and basically he did it by constantly repeating \"you heard the judge, we're not supposed to judge the law...\".  Oh, and in Oregon you only need 10 out of 12 to convict (that crazy law was passed just a couple of years before this).\r\n\r\nSo in the end a guy with a wife, a couple of kids and a concrete contracting biz was going to have to spend a year or two in prison for no good reason thus impoverishing his family and ruining his business.  \r\n\r\nIf I'm ever on the jury of a drug trial again I will always vote to acquit unless the defendent was selling drugs to 8 year olds or something.  We're putting people in prison for no good reason at all... And we're ruining families (hey, how's that should work to convince some conservatives, eh?)","controversiality":0,"subreddit_id":"t5_mouw","link_id":"t3_u07r","stickied":false,"timestamp_epoch":1566236762,"message_id":"15271-ce791049-b96e-4be3-94fb-f43019e4022e-1566236762"}