{"created_utc":1165550113,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_u0qi","subreddit_id":"t5_6","controversiality":0,"body":"I used to work for RIM (the Blackberry maker) until a few months and having seen the development of the Pearl and a few other devices up close, perhaps I can make a few points:\r\n\r\n- Voice and Data are probably an order of magnitude harder than a simple function like playing mp3s. Cell phones have to pass a number of tests, have to be certified, and and its not easy at all to write robust radio software that doesn't drop calls, that provides good connection to the network, doesn't drain the battery etc. If they release a device, they better have spent a long time developing it, otherwise its likely to turn out pretty mediocre in this area.\r\n\r\n- you won't see it soon. If Apple wants to sell its device through carriers, it has to go through a several months of testing at the carrier's labs, which aren't all that concerned with confedentiality. The minute carriers start testing the iPhone, you'll see it all over the net.\r\n\r\n- it won't be a smartphone, at least one you'll want. It took quite a bit of time for Symbian, Windows Mobile, Palm OS and BB OS to get to the stage where they are now. Microsoft showed that translpanting a computer OS to a small device (earlier windows PPCs) isn't such a great idea. While its possible that Apple has been working for a long time to refine it, its much more likely they'd release a simplier version first, get revenue then expand.\r\n\r\nI think the iPhone could be nice and provide another source of income for Apple, but people that gush over it and think it'll capture 3/4 of the market like the iPod are a bit delusional.","retrieved_on":1473808052,"distinguished":null,"gilded":0,"parent_id":"t3_u0qi","id":"cu2lc","edited":false,"author":"martythemaniak","author_flair_text":null,"timestamp_epoch":1566236762,"message_id":"15297-bc9e4d95-6ef0-42e2-be3f-e2995f728fb9-1566236762"}