{"stickied":false,"link_id":"t3_u0r5","subreddit_id":"t5_2fwo","body":"Sigh...some people on this planet aren't uber programmers. Not everyone cares about making the world a better place, because if they did, everyone would be writing code in Lisp, Scheme, Haskell, taking action of ousting Bush from office,  blah, blah, blah...Who gives a rats ass if the syntax isn't to your liking. Nothing is ever absolute in life, except death. If you're looking at someone else's code, then do a little dance of frustration in your cube, bang your head on the desk, giggle a bit and get back to the task at hand. The time spent complaining and writing blog posts with extensive examples that everyone and their mom can reply to with thier \"IMHO's\" is time that could be well spent correcting the code to your liking and moving on.   I grunt and mumble numorous expletives under my breath about other peoples code, but do I sit and waste valuble time on my part or my employers part writing a post ranting and raving about other peoples code and hoping it finds it's way to a prestigious social bookmarking site in the hopes that some other newbs lather themselves in my pain!?!? **Takes deep breath, exhales and then pauses for a moment** No. For the most part, and to the credit of redditers and a few diggers, only a handful of the non-elite will read a post like this, and even then, only half will get the point, because if they write shitty code in the first place, what makes you think they will understand your blog and go forth and prosper?? I loathe the people that finally \"get it\" and have this awakening that makes them think they have the credibility to make blog-shit...\r\n\r\nThe time I wasted writing this comment is time well spent doing something constructive... but I just couldn't resist.\r\n\r\nI think I'm going to down-vote myself...","controversiality":0,"created_utc":1165552346,"author_flair_css_class":null,"ups":-5,"score":-5,"subreddit":"programming","parent_id":"t3_u0r5","edited":false,"id":"cu2p6","author":"2speed","author_flair_text":null,"retrieved_on":1473808055,"distinguished":null,"gilded":0,"timestamp_epoch":1566236762,"message_id":"15349-e9a292e4-681a-4845-bdef-2993d400f7c2-1566236762"}