{"author_flair_text":null,"author":"Misio","id":"cu4v4","edited":false,"parent_id":"t1_cu4gi","gilded":0,"distinguished":null,"retrieved_on":1473808094,"body":"OK, fair point, I will back track here a little bit. It was childish to bandy around the word moron. However, I do think you are being slightly patronising to the new computer users. Mine is the first generation that can't remember not having a computer in our rooms, and we have a passion for it. Its the kids building these mashups, videos on youtube etc, and they want power. They learn by tinkering and that is good for everyone. I cant think of one person under the age of 25 who would use and or enjoy using one of the crippled machines you talk about in your article.\r\n I must again apologise at the venom in my comment above, it was poor of me. The reason for it is this. I, as you, have seen this coming for a number of years. Microsoft must have been thinking it for a long time. If they could publish their OS, media playing software and MS office,  with a subscription based system to each machine on the planet, they would certainly be on to a winner. It would be like the palladium chip but a thousand times worse. Don’t pay your subscription? Your data is held to ransom, \"what? you have no offline data? you need to work? Pay. Now.\". Perhaps that could form part of a “trusted” computing network, if your entire system is outsourced to a “reputable” company then it suddenly becomes a snap to positively identify each and every user based on their point of origin. Anonymity on the internet vanishes (admittedly it is getting like that already but there are ways). Now the reason for this being so bad may not be clear straight away, but as more and more online services require you to log in through the trusted outsourced network provider it becomes less possible to log in to eBay, Amazon, msn live or whatever using conventional machines. More people switch to the thin clients, nothing else is compatible. Linux, having just gained a toehold in the desktop market dies overnight. Open source software ceases to be. The price of high end home machines skyrockets as the economies of scale are lost, manufactures only build custom machines at a high price for specialist purpose, certainly never for home users. The governments around the world suffering from terrorist attacks are getting desperate, they start grepping the national grid for anything and everything they can get hold of. The virus writers being ahead of the curve realise that the huge clusters all run the same software, at the same version, a vulnerability is found. Western Europe’s with its cluster collapses, stops functioning and becomes worthless. With no localised hardware in peoples homes worth a damn they sit, and wait. Hopefully they come back up, the US goes down… and so on and so on.\r\n Ok I am being extreme but its just to prove a point, I like my data to at least exist locally as well as being available on the web. I like a choice of OS and I like to have local power, when my internet goes down, my computer still works.\r\n","controversiality":0,"subreddit_id":"t5_2fwo","link_id":"t3_u3cv","stickied":false,"subreddit":"programming","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165596340,"timestamp_epoch":1566236763,"message_id":"16308-438186c9-d7cc-4866-9f33-b45993d361cb-1566236763"}