{"body":"&gt; that so many people choose to go to college anyway indicates that there must be something else that college gives you that is worth more than the difference in what you're going to make.\r\n\r\nPeople are choosing to go because there's a drumbeat of propaganda claiming one needs a degree to \"make it.\"  A lot of people make a lot of money off the higher education racket.  Back in reality, bidding wars are escalating pay for skilled trades like welder and machinist over typical white collar salaries.  Go read on the American Welding Society site about the skill shortage crisis.\r\n\r\nI think his argument that college is a mistake for half of people is wrong.  It's likely way more than half.  He's saying half of people aren't smart enough to get high paying jobs even with a diploma so they shouldn't have bothered.  But you also have to consider that the smarter students would find ways to earn almost as much without a college degree as with one.  There is very strong demand for skilled, intelligent people who can work with their hands.  There are also extremely profitable business opportunities that for some reason college educated people never pursue.  Do you know how many very well off car wash and pizzeria owners there are?\r\n\r\nI think popular culture has deluded people about the relative worth of skilled trades vs white collar labor.  Name one fictional guy on TV who comes home with his hands dirty and isn't portrayed as a loser.\r\n\r\nAlso keep in mind a huge fraction of so-called college graduates really only achieve a high school education for all their expense.  I remember seeing some survey showing ~15% functional illiteracy among \"graduates.\"","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_u476","stickied":false,"subreddit":"reddit.com","score":4,"ups":4,"author_flair_css_class":null,"created_utc":1165603989,"author_flair_text":null,"author":"kkrev","id":"cu5fx","edited":false,"parent_id":"t1_cu4m2","gilded":0,"distinguished":null,"retrieved_on":1473808107,"timestamp_epoch":1566236763,"message_id":"16651-ef1c85de-69d6-4ab7-b47a-d03211938304-1566236763"}