{"created_utc":1165605673,"author_flair_css_class":null,"score":5,"ups":5,"subreddit":"reddit.com","stickied":false,"link_id":"t3_u476","subreddit_id":"t5_6","body":"By your logic, pleasant memories don't have great utility, as every moment should be the \"best of your life\".  This means that taking a year off for fun is just flushing your cash down the toilet (isn't that hiding from reality also)?  Is \"hiding from reality\" anything that doesn't include our life's work?  Since when did the \"reality\" become work and the grind and not enjoying the fun, frivolous, things you do and you've done?\r\n\r\nA job becomes an obligation (because you get paid) and many would argue that this aspect degrades the desirability of any job (yes, some are probably better than others).  Everybody complains about their job.\r\n\r\nYou also ignore the very real, perhaps sometimes unfair, that in many cases college by itself increases your employment value.  Yeah, going to college for fun is pretty inefficient but, um..., a lot of people go to college for education and to increase their future salaries and to be more able to do the work they want to (it's not impossible, but harder, to get, say, programming work without a degree) and it's pretty ignorant of you to think that people aren't allowed to have fun (perhaps even the \"best fun of their lives\") in the process.\r\n\r\nI think you mean to come across optimistically in your comment because you're having more fun now than you ever did and it just keeps getting better and better.  !!!  Instead, your comment strikes me rather pessimistically.  Good times aren't strictly linear.  There's no de facto reason why today should be unequivocally \"happier\" than yesterday or, say, a wedding day, or whatever.  It only serves to make me think that you've not managed to enjoy moments in one's life that are very generally quite happy and you keep delaying (or downplaying) certain moments in your life to build up whatever moments may come in the future.\r\n\r\nSo good luck with that.","controversiality":0,"retrieved_on":1473808110,"distinguished":null,"gilded":0,"id":"cu5lk","edited":false,"parent_id":"t1_cu5hm","author":"duketime","author_flair_text":null,"timestamp_epoch":1566236763,"message_id":"16743-05e42418-45fd-49ab-a3c5-007bb52abc8c-1566236763"}