{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_u476","controversiality":0,"body":"Hmmm.  A couple of the comments mention fishy math, so I worked some numbers.  It's even fishier than I thought.  First of all, if college loans were really 12% then I would be lending money to college students, not buying stocks at 7.5%.  College loans are actually much lower than the return on most investments, which is why every financial planner I've ever met with has encouraged people to keep student loans as long as possible.\r\n\r\nSecond, while the authors claim a high school graduate with a pile of $76k would have the sense to invest it if they weren't spending it on tuition, they don't seem to have thought a college graduate would invest their extra earnings.  Which means either the authors admit a college graduate has a much higher standard of living (starts at 1.5x, ends up at over 2x) or their math is way off.  My calculation, which assumes 6 years for college and equal standard of living and otherwise uses their numbers for salaries at each year, has the college grad with a bank account of $289k 12 years after graduation but a HS grad with only $282k 18 years after graduation.  Naturally the story gets worse from there, since by then the college grad is earning 1.5x the HS grad.\r\n\r\nSo, even from a purely financial points of view, college comes out the winner if you plan on living to age 36 or so.\r\n\r\nMaking it as pessimistic as possible, let's go into $76k of debt for college's sake, and actually pay 12% interest, and let's let our HS grad live for free while the college grad goes to school, and let's charge 7.5% interest on our opportunity cost.  I can't possibly conceive how things could be worse than that, and the college grad comes out ahead 30 years after graduation, when they're around 54, thinking about retirement, and earning double the high school grad.  Did their numbers include pension plans and 401k stuff?  \r\n\r\nSo whether you're going into stupid debt for college or already sitting on a pile of dough, for at least half of the US, college is still the winner.","score":11,"ups":11,"created_utc":1165605989,"author_flair_css_class":null,"subreddit":"reddit.com","edited":false,"parent_id":"t3_u476","id":"cu5mq","author_flair_text":null,"author":"plexluthor","distinguished":null,"retrieved_on":1473808110,"gilded":0,"timestamp_epoch":1566236763,"message_id":"16762-993b19ae-53a1-4231-b8fe-4c3c24a36701-1566236763"}