{"score":5,"ups":5,"author_flair_css_class":null,"created_utc":1165609127,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_u5pd","stickied":false,"controversiality":0,"body":"Whatever the reason, there is an obvious reluctance by the US government or US news outlets to criticize Israel.  \r\n\r\nWhen I follow news stories covered by news agencies globally and compare, I often feel the US media takes it easier on Israel than other organizations do.\r\n\r\nWhen Israel lobbed a few rockets into the Gaza strip last month killing 18 Palestinian civilians and blamed it on a \"targeting malfunction\", the White House barely reacted while many parts of the international community expressed serious outrage.\r\n\r\nWhen Israel began its assault on Lebanon(note: the Hezbollah guerillas who killed Israelis and kidnapped soldiers committed heanous acts) the international outcry was deafening.  Hundreds of innocent people were killed and vital infrastructure was destroyed like hospitals, bridges, and powerplants.  It will litterally take years and billions to rebuild.  The UN Security council drafted a measure to admonish Israel for what the international concensus was a gross overreaction.  The US was the only nation that objected.\r\n\r\nIf in his book, Carter provides documented examples of abuses of civil liberites, prejudice, persecution, and basic human rights violations by the Israeli government, then how can bringing facts to light somehow be misconstrued as detremental or anti-semitic?\r\n\r\nAren't we better off and able to make better judgements with access to greater amounts of accurate information?\r\n\r\nAssuming the things that Carter details in his book are true(I am willing to accept that they could also be false or overblown btw), then shouldn't we addredd them, or at least shouldn't the Israeli governemnt address them.  How can a government put up billboards around my neighborhood with a slogan like \"Israel Supports Democracy\"(actual billboard up in philadelphia), and then be party to the violation of basic democratic rights like impeading people from voting?","distinguished":null,"retrieved_on":1473808114,"gilded":0,"parent_id":"t3_u5pd","id":"cu5u4","edited":false,"author_flair_text":null,"author":"BLACKINFIDEL","timestamp_epoch":1566236763,"message_id":"16882-728c5628-fe65-47e6-b3ca-e060a1ef7866-1566236763"}