{"subreddit":"reddit.com","score":5,"ups":5,"created_utc":1165610084,"author_flair_css_class":null,"body":"&gt;And yet the American people are miserable. Or so it would appear.\r\n\r\nThis Harris Poll in 2005 [begs to differ](http://www.harrisinteractive.com/harris_poll/index.asp?PID=585).\r\n\r\nBut, since Barlow observed so few smiles in San Francisco and **AIRPORTS**, for pete's sake, well, Americans are miserable. Seriously, barring people who just got a free upgrade to first class, how many people are regularly smiling after having to go through the security hoops and wait two hours for a delayed flight?\r\n\r\n&gt;driving them to the fatigue that is despair, in order to acquire possessions that possessed them, money that turned their friends monstrous, addictions that turned them monstrous\r\n\r\nAh, another one of *these* articles. Funny how every author spouting off on happiness and satisfaction can name all these greedy evil people hell-bent on acquisition of material goods, popping prozac left and right. Me personally, I've never known a single one of those people who mindlessly seek to acquire, foresaking all else in pursuit of the possessions which will possess them. Heck, I don't even know a single person on a psychotropic (that would tell me, anyway). \r\n\r\nYou know what with his anecdotal evidence about how no one around him smiles, and how everyone is miserable, I wonder if [this](http://demotivators.stores.yahoo.net/dysfunction.html) wisdom doesn't apply.\r\n\r\nI write this largely as a fan of JP Barlow. He's done some great work for the EFF and is a pretty interesting fellow to boot. But this is just silly navelgazing on his part.","controversiality":1,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_u4l6","gilded":0,"distinguished":null,"retrieved_on":1473808115,"author_flair_text":null,"author":"rafuzo2","edited":false,"id":"cu5wc","parent_id":"t3_u4l6","timestamp_epoch":1566236763,"message_id":"16917-17b8548b-b00a-4754-91ea-9a808464bd7e-1566236763"}