{"author_flair_text":null,"author":"NitsujTPU","id":"cu6cu","parent_id":"t1_cu69i","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808124,"body":"http://www.newstatesman.com/200504180028\r\n\r\n\r\nCuriosity is one of those things that should be nurtured, rather than crushed.  I had a chemistry set and loved making small and even fairly large explosions with it.  There were even instructions on how to make the small ones, like how to fire a ball of steel wool out of one of the test tubes.  I had model rockets... and went out and blew some of them up with a friend of mine.  We weren't out to hurt anyone.  We just wanted to do it.  It was more Independence Day than Guy Fawkes Day.\r\n\r\n\r\nMy parents let me have the, relatively safe looking, chemistry set, and I went and made mischief with it.  I had a friend who had what I perceived to be the same curiosity, but got in big trouble for blowing things up (I got in a little trouble, but my parents didn't take the stuff away).  The friend developed an idea that the mischief was the central part of the equation.  I developed the idea that my parents just didn't want the house burned down, since I could play with fireworks under relatively safe conditions.\r\n\r\n\r\nTo make a long story short, I don't know many of the details after that.  We didn't hang out as much in high school, and fell in with different circles.  Later, I found out that the friend had been sent to a boot camp.  Apparently in his box of mischief there had been a few narcotics.  Mine had mostly chemicals from the hobby shop and funny looking crystals I'd grown.  I don't know what happened to him after that, except that once I saw him at my old high school prior to graduation.  On the other hand, I'm working on my PhD now.  I can't help but wonder how he would have turned out if his curiosity had been nurtured in a more positive way.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_u5p4","subreddit":"reddit.com","score":12,"ups":12,"created_utc":1165617243,"author_flair_css_class":null,"timestamp_epoch":1566236763,"message_id":"17188-b1366aac-21f4-46a6-a439-89d4f8cc7433-1566236763"}