{"controversiality":0,"body":"First off, some of the 'Facts' in this photo essay are WRONG. , but of course, they have no links of any sort to back up their false claims.\r\n\r\nSecondly, If we all stopped buying diamonds all that would do would be to plunge these poor countries into deeper levels of poverty, not help them in any way.\r\n\r\nThe War in Sierra Leon is Over, and the ONLY industry there in an Large Sense is the Diamond Industry and they are working towards turning Sierra Leon around and HELPING the people there.  The Diamond Industry has done a Lot of Good over the Years for Africa.  \r\n\r\nNo, I'm not supporting DeBeers (who IS NOT the Industry, just a large player), and in fact, I am anti-DeBeers, but without the industry Africa would be worse off than ever.\r\n\r\nWhere would Namibia or Botswana be without the Diamonds that they were given?  Where would all of those guys in India be without the diamond polishing jobs.  Must have been pretty good pay for them if they MOVED to the city to work as diamond polishers.  But hey people never think about the difference in costs from one country to another, but they sure love to pay 5 dollars for a meal that would've cost them 200 dollars back in America.\r\n\r\nLet me ask you this, how clean and blood free is that oil in your car?  Did some of that money you paid for it go to the Saudi Royal Family to pay off Osama and his Cronies?\r\n\r\nDisclaimer:  I am in the industry, but I am on the board for my state level national organization that leads in industry and ethics in jewelry (www.arizonajewelers.org).\r\n\r\nIf you want REAL facts go to:  www.diamondfacts.com\r\n\r\n","link_id":"t3_u4i9","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165617584,"score":-10,"ups":-10,"author":"st_gulik","author_flair_text":null,"edited":false,"parent_id":"t1_cu5o7","id":"cu6dq","gilded":0,"retrieved_on":1473808124,"distinguished":null,"timestamp_epoch":1566236763,"message_id":"17203-eb872384-a0c3-465a-b206-335343b4d02e-1566236763"}