{"distinguished":null,"retrieved_on":1473808137,"gilded":0,"parent_id":"t1_cu6wj","edited":false,"id":"cu71d","author":"doubtingthomas","author_flair_text":null,"score":31,"ups":31,"author_flair_css_class":null,"created_utc":1165629722,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_u6la","stickied":false,"body":"From my viewing, it looks like the preacher doesn't know what an ad hominem argument is. The professor did call the preacher a dirty name, but it wasn't a functional part of the argument.   If any fallacy could be attributed to the professor, it could be an appeal to authority. The preacher's assertion was that he is a \"college professor who denies logic\". The professor then asserts that he teaches logic. While teaching logic doesn't assure that he doesn't deny logic, it is a safe bet. \r\n\r\nIt seems clear that the professor isn't particularly interested in engaging the evangelist in debate, and rightly so. From personal experience, there isn't much worth in talking with those guys. You can't reasonably debate someone who doesn't play by the rules of logic, changes the subject whenever things get inconvenient, and chooses to ignore you when you have a valid point. Debating them just gives them the audience they want, and the folks they are looking for won't be looking for the contradictions.\r\n\r\nTaking the briefcase was probably going to far, but \r\nI can't say I entirely blame him. If I spent my days trying to enrich and train young minds, I'd be quite annoyed to see some wacko in a suit spouting accusatory nonsense at them between classes with an undeserved sense of authority.\r\n\r\nEDIT: A quick googling shows that while the professor teaches chemistry, he's a big name in the Philosophy of Chemistry and he is more generally identified as a Philosopher of Science with a focus on chemistry. He's apart of the area philosophy meet-up group and a man of considerable academic distinction. If he doesn't know what an Ad Hominem is, it's a miracle.\r\n","controversiality":0,"timestamp_epoch":1566236763,"message_id":"17637-08cf63ea-6420-4fdc-9fc6-2932106af02e-1566236763"}