{"id":"cu747","edited":false,"parent_id":"t1_cu6jh","author_flair_text":null,"author":"[deleted]","distinguished":null,"retrieved_on":1473808139,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tz0c","controversiality":0,"body":"Your analysis of events seems to have fallen under the thrall of narrow, doctrinaire, even binary thinking; and your moralistic high-handedness with me appears based on a straw man attack against a distortion of my thesis. However, since my last post was so brief, I will allow you the benefit of the doubt and explain my point in more detail.\r\n\r\nYou laid the blame for the failure of the Camp David talks on Arafat, citing a sentence from Bill Clinton by way of evidence. In response, I posted a sizeable quote from an essay by Robert Malley, Clinton's chief aide during the talks, that identified some failings on the part of Ehud Barak. I wasn't trying to argue that the failure was *entirely* Barak's, but merely that it was *not entirely* Arafat's.\r\n\r\nYou seem to be indulging in a false alternative: either the failure was Barak's fault or Arafat's. In fact, the situation was complicated and there was plenty of blame to go around, as Malley's essay makes clear. All three main players - Arafat, Barak, and Clinton - went into the talks saddled with personal agendas that interfered with the pursuit of a lasting peace.\r\n\r\nThis is Malley's thesis, a thesis he articulates at the start of his essay when he states that it is a dangerous orthodoxy to attribute the failure to Arafat alone:\r\n\r\n&gt; For a process of such complexity, the diagnosis is remarkably shallow. It ignores history, the dynamics of the negotiations, and the relationships among the three parties. In so doing, it fails to capture why what so many viewed as a generous Israeli offer, the Palestinians viewed as neither generous, nor Israeli, nor, indeed, as an offer. Worse, it acts as a harmful constraint on American policy by offering up a single, convenient culprit - Arafat - rather than a more nuanced and realistic analysis. \r\n\r\nIn your effort to load all the blame on Arafat, a common tendency to which Malley's essay is a direct and detailed response, you quote: \"Arafat spent far less time worrying about the substance of a deal than he did fretting about a possible ploy. Fixated on potential traps, he could not see potential opportunities.\" However, Malley's essay has something to say about *why* Arafat was so suspicious:\r\n\r\n&gt; Palestinians were looking for early reassuring signs from Barak; his first moves were anything but. His broad government coalition (an assortment of peace advocates and hard-liners), his tough positions on issues like Jerusalem, and his reluctance to confront the settlers all contributed to an early atmosphere of distrust. Delays in addressing core Palestinian concerns -  such as implementing the 1998 Wye Agreement (which Barak chose to renegotiate) or beginning permanent status talks (which Barak postponed by waiting to name a lead negotiator)  - were particularly irksome given the impatient mood that prevailed in the territories. Seen from Gaza and the West Bank, Oslo's legacy read like a litany of promises deferred or unfulfilled. Six years after the agreement, there were more Israeli settlements, less freedom of movement, and worse economic conditions. Powerful Palestinian constituencies - the intellectuals, security establishment, media, business community, \"state\" bureaucrats, political activists - whose support was vital for any peace effort were disillusioned with the results of the peace process, doubtful of Israel's willingness to implement signed agreements, and, now, disenchanted with Barak's rhetoric and actions.\r\n\r\nAgain:\r\n\r\n&gt; When Barak reneged on his commitment to transfer the three Jerusalem villages to the Palestinians - a commitment the Prime Minister had specifically authorized Clinton to convey, in the President's name, to Arafat - Clinton was furious. As he put it, this was the first time that he had been made out to be a \"false prophet\" to a foreign leader.\r\n\r\nSo when Arafat went into the negotiations, it was with someone who had given him almost no reason to believe that he would bargain in good faith or, having reached a deal, would actually honour it. During the talks themselves, Barak was boorish and heavyhanded, presenting each small concession as a final offer and trying all the while to see how little he could get away with actually conceding. \r\n\r\n&gt; [I]t is hard to state with confidence how far Barak was actually prepared to go. His strategy was predicated on the belief that Israel ought not to reveal its final positions - not even to the United States - unless and until the endgame was in sight. ... As a consequence, each Israeli position was presented as unmovable, a red line that approached \"the bone\" of Israeli interests; this served as a means of both forcing the Palestinians to make concessions and preserving Israel's bargaining positions in the event they did not.\r\n\r\nThat's not a good way to conduct negotiations, but Barak was using his positions at Camp David to play politics at home:\r\n\r\n&gt; In many ways, Barak's actions led to a classic case of misaddressed messages: the intended recipients of his tough statements - the domestic constituency he was seeking to carry with him - barely listened, while their unintended recipients - the Palestinians he would sway with his final offer -  listened only too well.\r\n\r\nLet me respectfully suggest that you pull back on your nineteen exclamation marks and consider that you are actually doing what you accuse me of doing: taking quotes out of context to support your narrow thesis. You certainly quoted a full paragraph about the parameters that Barak finally offered to Arafat, but neglected to cite the following paragraph, which addressed why Arafat was still skeptical: in short, because Barak was trying to strong-arm Arafat to accept fuzzy parameters in lieu of an actual offer, parameters that Israel would be able to use against Palestine to stall and delay indefinitely once Barak and Clinton were gone (which happened soon after).\r\n\r\n&gt; With only thirty days left in Clinton's presidency and hardly more in Barak's premiership, the likelihood of reaching a deal was remote at best; if no deal could be made, the Palestinians feared they would be left with principles that were detailed enough to supersede international resolutions yet too fuzzy to constitute an agreement.\r\n","score":3,"ups":3,"created_utc":1165631502,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236763,"message_id":"17687-fc8b2550-4fe8-432c-9ee6-c9eb80d8c995-1566236763"}