{"controversiality":0,"body":"I liked the comment about \"paradigm shift\". There is no such thing in software, but there is paradigm apeareance and integration.\r\n\r\nOTOH...\r\n\r\n&gt;I note that English is arguably the largest and most complex language in the world (measured in number of words and idioms), but also one of the most successful.\r\n\r\nHmmm... I was self-taught in English for years, had an obligatory 2-semester course that was way below my knowledge at the time. Honestly, I think English is the simplest language I know of. Biggest, maybe (number of words an idioms, as he put it), but that is **not** what made it \"successful\". Ok, Bjarne, you went downhill there!\r\n\r\n&gt;Arrogantly damning older code as \"legacy\" and recommending \"just rewrite it\" as a strategy simply isn't good enough.\r\n\r\nComment not needed here. Repeating, IMO, is, so I do it ;-).\r\n\r\n&gt;C compatibility has been far harder to maintain than I or anyone else expected.\r\n\r\nHowever, thanks on a good work! We all have had headaches because of that, but being able to easily call friggin' system function is indinspensable in real world. Once there is an OS without C-interface, I'll sing different tune.\r\n\r\n&gt;MFC (which is not one of the more elegant C++ libraries)\r\n\r\nLove the understatement!\r\n\r\n&gt;I prefer the application to be designed conceptually in isolation from the underlying system, with an explicitly defined interface to \"the outer world,\" and then integrated through a thin layer of interface code.\r\n\r\nAlbeit admirable, this is very hard to do. Examples abound (what \"thin layer of interface code\" is there for cross-system GUI? And, however thin, it's still huge! DB work? etc...)","stickied":false,"link_id":"t3_u5pe","subreddit_id":"t5_2fwo","subreddit":"programming","created_utc":1165647523,"author_flair_css_class":null,"score":3,"ups":3,"author_flair_text":null,"author":"Gotebe","parent_id":"t3_u5pe","id":"cu7oa","edited":false,"gilded":0,"retrieved_on":1473808149,"distinguished":null,"timestamp_epoch":1566236763,"message_id":"18037-5ae36f10-6f85-4a83-9520-770fdf8d229f-1566236763"}