{"subreddit":"reddit.com","score":2,"ups":2,"created_utc":1165656206,"author_flair_css_class":null,"controversiality":0,"body":"As a teenager, I made my own homebrew solution. It wasn't too deadly, but it was dangerous enough.\r\n\r\nIf you mix turpentine oil with aluminum paper, it will quickly react and generate toxic gases. You can also control this gas generation to make bottles explode and generate a toxic cloud.\r\n\r\nI used big Coca Cola bottles. A bit of turpentine oil (can try with other typical kitchen compounds, this was popular in the late 80s and early 90s as a strong bathroom cleaner) 10 cl will be enough for a first try. \r\n\r\nThen there comes the difficult part: get the aluminum in the bottle but not in contact with the liquid - because you want that to happen later when you throw it. One way is bending the bottle, I like this way because it's simple and quick, and also because it delays the explosion some seconds. So you bend the bottle and introduce a bit of aluminum paper (a little bit will do, no more than a small ball you can fit in your nose :D used to measure it that way) then you close the bottle tightly, still bent (if you let the aluminum get in contact with the liquid you have seconds before it explodes). Then the finishing touch: hold it tightly and shake it quickly, then throw it. Depending on the quantities you used, it will take between 5 and 30 seconds to explode. You will see the bottle inflate before going \"boom\". It was exciting for a 13 year old.\r\n\r\nIf you want a bigger boom you will need a sturdier bottle with a very solid cap, and then you can use more turpentine oil. If you use too much, it will explode before you throw it. Careful ;)\r\n\r\n until you have time to close the bottle, then shake","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u5p4","gilded":0,"distinguished":null,"retrieved_on":1473808153,"author":"[deleted]","author_flair_text":null,"edited":false,"id":"cu7xb","parent_id":"t1_cu69i","timestamp_epoch":1566236763,"message_id":"18168-874f299d-3b7e-4f9b-8359-1a8c2c27fd7f-1566236763"}