{"author_flair_text":null,"author":"furyg3","id":"cu80n","parent_id":"t1_cu7e3","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808154,"body":"As a student of Conflict, I have to say, this is not the case.  It all depends on what the goal is.  There's a big difference between a discussion, a debate, and a negotiation.  All three of which you can do with someone about a topic that you fundamentally disagree with, as long as you both know which one of those you're doing.  If one person is coming for the discussion, and the other a debate, the result is disaster.\r\n\r\n[Here's an example](http://www.publicconversations.org/pcp/resources/resource_detail.asp?ref_id=102) where pro-life and pro-choice activists met together after a tragedy.  They came to talk *about abortion*.  They quickly realized that there is no way that they were going to resolve the conflict, since they have completely different world views.  They kept talking however, about vocabulary, about who they are personally, and about why they feel the way they feel.\r\n\r\nThe result to these meetings (done in secret originally) was that the rhetoric between the two sides stopped escalating, and was reduced.  So much so, that the media commented on it (not knowing about the meetings).   I encourage everyone to read the article.\r\n\r\nThe lesson learned is that even though I may have a *fundamental* difference of opinion which will never be resolved, that doesn't mean that we can't be civil, respect each other, and have some common ground as people.\r\n\r\nSo no, discussing with people who believe in \"crazy\" things, from your point of view, is not futile, and does not mean that you respect their position; only that you respect the person.\r\n\r\nSadly, that's not what happened here.  The fundamentalist was disrespectful, disrespected, laughed at, and stolen from.  In no way did either side better themselves as people.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_u6la","stickied":false,"subreddit":"reddit.com","score":13,"ups":13,"author_flair_css_class":null,"created_utc":1165658631,"timestamp_epoch":1566236763,"message_id":"18195-fccd0114-8ddc-4345-8242-219de9f8eb37-1566236763"}