{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165668536,"ups":11,"score":11,"controversiality":0,"body":"http://www.fromthewilderness.com/free/ww3/041106_beloved_mckinney.shtml\r\n\r\nsnip:  \r\n\r\n\"Almost every armchair pundit (left or right) who has criticized Cynthia McKinney has told only part of her story.\r\n\r\n.....\r\n\r\nOne anecdote paints the picture pretty clearly.\r\n\r\nLast fall, after I had acted as a questioner for two panels sponsored by McKinney at the CBC’s annual convention, I was surprised as she handed me a ticket to the CBC formal banquet. This is a big annual event and I sat just a few tables away from John Kerry. Howard Dean was a few tables past Kerry. More than a thousand people, dressed to the nines, filled a crowded ballroom.\r\n\r\nCynthia was a no-show and it didn’t take long to figure out why. As every black member of Congress was introduced by seniority, starting with the Honorable John Conyers of Michigan, Cynthia McKinney’s name was saved for last. Even the Congressional Black Caucus could not recognize a sister’s seniority and service, not even when it wouldn’t have cost them a thing.\r\n\r\nWhere was Cynthia during that dinner? She wasn’t there. She was off violating a direct order from Nancy Pelosi not to attend a massive anti-war rally on the Mall. She was standing with Cindy Sheehan. She was giving a speech denouncing the war in Iraq and the Bush administration. She was doing her job. I sat at McKinney’s table next to my ad hoc dinner partner Kathleen Cleaver, weeping over the insult on McKinney. Not once since have I seen Cynthia McKinney even flinch over it.\"\r\n\r\nTruth, crushed to the earth, will rise again, out of the forest fair and green.\r\n","link_id":"t3_u7t5","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808160,"distinguished":null,"author":"tphyahoo","author_flair_text":null,"parent_id":"t3_u7t5","edited":false,"id":"cu8a8","timestamp_epoch":1566236764,"message_id":"18303-63658578-aca1-47fd-bbf9-ab5fd3bc0a60-1566236764"}