{"subreddit":"reddit.com","score":12,"ups":12,"created_utc":1165686001,"author_flair_css_class":null,"controversiality":0,"body":"Let me start off by saying: I'm so sad that press is a unidirectional medium (and the voice of a credited anthropologist will be heard as being the voice of authority)\r\n\r\n I just watched apocalypto last night, and I loved it for two reasons. Two huge reaasons that she seems to have missed entirely. The first one was this: how interesting it is to finally be able to have a reversal of perspective on what we consider the accomplishments of man kind. When we look at Mayan, or Egyption pyramids, or look at the great wall of China, we always immediately think \"wow, how man kind has accomplished great things\" even though somewhere burried deep in the pages of our history books and minds, we know that they were constructed by slaves.\r\n And this movie does an awesome job of showing that perspective, not from the people who built the pyramids, but from the people who were acquired as slaves and forced to build it.\r\n Whether it's historicaly accurate or not is moot: slaves were used to build these things, and chances are extremely likely that they were acquired by force.\r\n I was sincerely awed by being able to see that different perspective so clearly thanks to this movie.\r\n The second point is that she says Mel is implying that the mayans deserved to be conquered or saved. For starters, the quote at the beginning of the movie says something else. \"A civilization is not conquered from without...\".\r\n Now, if I knew nothing of Mel Gibson's religious beliefs, which I actually choose not to care about, that statement sounds quite neutral to me. The word \"Conquered\" is of importance. The statement is entirely violent, and there is no pretense of \"saviour complex\".\r\n When I was watching the film and that ending arrived out of the blue, I thought \"oh boy, they're fucked now\". Nowhere did my mind wander to \"they deserved it\". In fact, it's important to understand that even thinking \"they deserved it\" is symptomatic of a greater intellectual fallacy: that of not being able to understand what truly weakens you as a person/people/society and instead relying on \"divine morals\" as a gauge for your actions.\r\n\r\n In closing, I find that historical movies always elicit strong reactions from people with strong opinions. As if somehow there was an alternate source of objective reality that you could turn to, and that the historical film was a gross deviation from this point.\r\n History is written by the conquerors is often said but seldom really understood. For me it means that no history book is ever trustable entirely and that the attempt of history as a science is to perpetually infer more information from existing facts.\r\n Movies like this are not here to dictate facts, nor to even dictate story. They're here to make us consider things in different perspectives. The fact that this anthropology professor thinks it's a Christian saviour apology movie is only exposing her own pre-occupying concerns. Not the movie's.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u82w","gilded":0,"distinguished":null,"retrieved_on":1473808174,"author":"[deleted]","author_flair_text":null,"id":"cu90x","parent_id":"t3_u82w","edited":false,"timestamp_epoch":1566236764,"message_id":"18671-3812560c-dced-4d19-80b9-27fdbe8bae00-1566236764"}