{"link_id":"t3_t7nt","stickied":false,"subreddit_id":"t5_6","body":"*\"\"Some individuals will be denied the right to travel and many the right to travel free of unwarranted interference.\"*\r\n\r\nThe Constitutionally protect right to travel is encoded in law.  For the lazy Redditers, I quote:\r\n\r\n    CASE #1: \"The use of the highway for the purpose of travel and transportation is not a mere privilege, but a common fundamental right of which the public and individuals cannot rightfully be deprived.\" Chicago Motor Coach v. Chicago, 169 NE 221.\r\n\r\n    CASE #2: \"The right of the citizen to travel upon the public highways and to transport his property thereon, either by carriage or by automobile, is not a mere privilege which a city may prohibit or permit at will, but a common law right which he has under the right to life, liberty, and the pursuit of happiness.\" Thompson v. Smith, 154 SE 579.\r\n\r\nIt could not be stated more directly or conclusively that citizens of the states have a common law right to travel, without approval or restriction (license), and that this right is protected under the U.S Constitution.\r\n\r\n    CASE #3: \"The right to travel is a part of the liberty of which the citizen cannot be deprived without due process of law under the Fifth Amendment.\" Kent v. Dulles, 357 US 116, 125.\r\n\r\n    CASE #4: \"The right to travel is a well-established common right that does not owe its existence to the federal government. It is recognized by the courts as a natural right.\" Schactman v. Dulles 96 App DC 287, 225 F2d 938, at 941.\r\n\r\nAs the Supreme Court notes in Saenz v Roe, 98-97 (1999), the Constitution does not contain the word \"travel\" in any context, let alone an explicit right to travel (except for members of Congress, who are guaranteed the right to travel to and from Congress). The presumed right to travel, however, is firmly established in U.S. law and precedent. In U.S. v Guest, 383 U.S. 745 (1966), the Court noted, \"It is a right that has been firmly established and repeatedly recognized.\" In fact, in Shapiro v Thompson, 394 U.S. 618 (1969), Justice Stewart noted in a concurring opinion that \"it is a right broadly assertable against private interference as well as governmental action. Like the right of association, ... it is a virtually unconditional personal right, guaranteed by the Constitution to us all.\" It is interesting to note that the Articles of Confederation had an explicit right to travel; it is now thought that the right is so fundamental that the Framers may have thought it unnecessary to include it in the Constitution or the Bill of Rights.\r\n\r\nAs usual, there are many more sources for those that will bother to look it up.\r\n\r\nThe governmental interference with this right to travel, for US citizens is **illegal**, but since when did that stop these fucking goons?  (I'm trying to get more terrorist points)","controversiality":0,"author_flair_css_class":null,"created_utc":1165000870,"score":8,"ups":8,"subreddit":"reddit.com","id":"ct9ko","parent_id":"t3_t7nt","edited":false,"author_flair_text":null,"author":"lifeofliberty","retrieved_on":1473807509,"distinguished":null,"gilded":0,"timestamp_epoch":1566236758,"message_id":"1868-d7d78eb9-b4d6-4e5b-a0e4-c40054e62d89-1566236758"}