{"id":"cu98l","edited":false,"parent_id":"t3_u62g","author_flair_text":null,"author":"grzelakc","retrieved_on":1473808178,"distinguished":null,"gilded":0,"link_id":"t3_u62g","stickied":false,"subreddit_id":"t5_6","body":"Ah, driving rants, who doesn't love them?\r\n\r\nHere's my two. First, of all I don't need to deliberately brake to cause tailgaters to rear end me. They seem to do just fine without my help. In fact I was rear ended twice this year alone. luckily in both cases my car was nearly stopped and it was mostly a matter of the punks behind me not judging their braking distance correctly and stopping a couple of feet too far... \r\n\r\nI'm not a turtle on the road and typically drive 19% over the limit because it's the worst kept secret in Canada that cops are unlikely to ticket you if you're going 119km/h in a 100 zone but will happily slap you with a fine if you speed up to 120. Now this is fine but the system breaks down because of stupid drivers who are not familiar with this unspoken rule. In where I live there is a route that is mostly single lane but doubles up whenever there is a hill. Paradoxically those sections slow me down more than they help me get ahead, and here's why. All those drivers who are unaware of the 19% rule, tend to speed up from their usual 100-105 to 120 as soon as the road widens, preventing me from overtaking them (one ticket and two warnings later I'm not willing to risk going 120 on that road) and as soon as the two lane stretch ends, they are back down to 105 because the road is single lane again. Mind you the speed limit is 100 on that road, no matter if it's a single lane or a two lane stretch. Whether you drive 20km over or 25km under the speed limit please just be consistent so I can react accordingly. Is that too much to ask for?\r\n\r\nFinally, [this bumper sticker](http://www.purplemoon.com/Stickers/peace-chance3.jpg) caused someone to write an obscenity on my windshield. Did it really take just one year for fuhrer Harper and his minions to polarize this country so much? What's gonna happen if he gets another four?","controversiality":0,"author_flair_css_class":null,"created_utc":1165690440,"score":-1,"ups":-1,"subreddit":"reddit.com","timestamp_epoch":1566236764,"message_id":"18789-72360f04-58d5-46b9-bc9c-34b12d0af4d9-1566236764"}