{"controversiality":0,"body":"My point is that organizations use the promise of the future to distract employees from the shitty reality of the present.\r\n\r\nEnvironmental groups with three people that have a mission of solving all environmental problems, distracts the members from realizing that all they do is sit around eating cheetos when they could actually be making a small but measurable difference in one particular thing.\r\n\r\nSchools where the mission is to educate all children, distract teachers from the fact that only 13% of black and 49% of white 8th graders can read at grade level.\r\n\r\nThe fact is, just because you join an organization with a noble mission statement doesn't mean you're doing anything honorable.\r\n\r\nIn fact, joining an organization with a noble mission statement where you actually do things that are dishonorable makes you not only dishonorable but deceitful as well. Deceitful to others, deceitful to yourself.\r\n\r\nIf someone is attacking an innocent person and you come to their aid, that is honorable. The fact that you, azenhi, propagate the myth that the only way to defend our way of life is to join one specific organization, one specific organization that is doing so much unspeakable evil in the world...\r\n\r\nIt's like saying the only way to become educated is attending broken schools where the textbooks have full page advertisements and no one can read. It's like saying the only way to achieve spirituality is by going to churches where the leaders suck off gay hookers in the bathroom of a Denny's. \r\n\r\nExcept it's worse, because innocent people are dying, and you're encouraging it.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u8p8","subreddit":"reddit.com","ups":3,"score":3,"created_utc":1165694487,"author_flair_css_class":null,"author":"Alex3917","author_flair_text":null,"parent_id":"t1_cu9ag","edited":false,"id":"cu9fu","gilded":0,"distinguished":null,"retrieved_on":1473808181,"timestamp_epoch":1566236764,"message_id":"18903-df3b7a68-89a0-4887-9fe7-9d4f1a6def9c-1566236764"}