{"controversiality":0,"body":"1)  You seem to make some distinction between \"staff\" and \"volunteers\" when there shouldn't be.  Anything that a \"staff\" member does can be done by a person donating their time for free.  And if there really are some positions that truly require a full time staff member, you can only justify needing a very small number of them.   And there's no reason why those positions couldn't be staffed by unpaid volunteers that would be more than happy to fill that role for a good cause, like retired people.\r\n\r\n2)  But you aren't in need, so why should I pay you a single dollar?\r\n\r\n3)  If you really wanna help your cause and not just get paid to do something that makes you feel good, then you should work those extra 30+ hours a week at a job that pays you real money, and then donate 100% of that money.  Otherwise, once again, you're just asking me to pay you when you don't need help.\r\n\r\n4)  There are a lot of suckers out there.  If just getting people to pay you money were proof that your cause was real, then there'd be a lot of millionaires out there who got paid by a Nigerian prince trying to funnel money out of his country.\r\n\r\nYour Pellegrino point) If you really need someone to be on staff by law, then let them take a token salary of 1 dollar per day.\r\n\r\nStaff to train volunteers)  There's no reason why one of your volunteers couldn't be in charge of training volunteers.\r\n\r\nI don't want this to come off as insulting, beacuse by volunteering anything at all you're already a much better person than most, but I have to call em as I see em.  And the why I see your situation is that you're getting paid from money that was to help those in need, and that isn't you.","subreddit_id":"t5_6","link_id":"t3_u89o","stickied":false,"subreddit":"reddit.com","ups":-7,"score":-7,"author_flair_css_class":null,"created_utc":1165694730,"author":"breakneckridge","author_flair_text":null,"edited":false,"id":"cu9ga","parent_id":"t1_cu9du","gilded":0,"distinguished":null,"retrieved_on":1473808181,"timestamp_epoch":1566236764,"message_id":"18912-55ffa506-f340-4b11-868a-45b40afc179a-1566236764"}