{"controversiality":0,"body":"You know, killing oneself isn't quite as easy as it seems. For the suicidal, there are many things to consider: the risk of surviving and becoming disabled, the ease and availability of the method in question, the traumatic effect on family and friends, etc. The train-and-bridge jumpers are generally the most serious of the lot, along with the shotgun suicide \"victims\". As far as I know, these methods carry the greatest chance of performing a clean kill. Although incredibly messy, they serve their purpose. Blaming the victims for being \"insensitive\" or \"selfish\" doesn't do any good, they have quite enough on their minds as it is. I have been there myself, and the train driver and cleaners were the last things I worried about. (To tell the truth, I hadn't even considered that part of the equation until the psychiatrist brought it up). Call it selfish if you want, but please show me some good, generally available alternatives. Drug overdoses are _very_ risky, drowning is difficult and hanging is prolonged and scary. As long as there is insufficient coverage of psychiatric emergency services and no accessible euthanasia service, I see these suicides as unfortunate but inevitable. You've got to realize that this isn't CompSci 101 - we aren't discussing the reasoning of a stable, rational individual. There is a special human ruleset for psychiatric emergencies.\r\n\r\nSuicidal humans are incredibly creative, so putting up a fence or even shutting down the subway won't curb the problem of messy suicides. What do you suggest we do about it?","subreddit_id":"t5_6","link_id":"t3_t8jy","stickied":false,"subreddit":"reddit.com","score":16,"ups":16,"author_flair_css_class":null,"created_utc":1165001483,"author":"marvin","author_flair_text":null,"parent_id":"t1_ct9bz","id":"ct9mn","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473807510,"timestamp_epoch":1566236758,"message_id":"1895-6376a17b-f076-4288-8c08-e0d63d545b73-1566236758"}