{"distinguished":null,"retrieved_on":1473807510,"gilded":0,"id":"ct9ni","edited":false,"parent_id":"t1_ct4ru","author":"bosco","author_flair_text":null,"score":1,"ups":1,"author_flair_css_class":null,"created_utc":1165001722,"subreddit":"science","subreddit_id":"t5_mouw","link_id":"t3_t350","stickied":false,"controversiality":0,"body":"I disagree. If the story is described correctly, what the woman has done *is* research, or at the least the beginning of a research program. What she hasn't done, is conducted research under the auspices of a recognized scientific institution. You might argue about the quality of the research, but with something as subtle as distinguishing baby cries, you'll find that in academic research, some researchers are naturally more sensitive to the data than others. In my field, some scientists are known to have an intuitive grasp of complicated molecular dynamics simulations.\r\n\r\nBefore rejecting the work of this woman outright by citing a scientific authority, you have to know that in academic science, scientists are *very* aggressive in protecting their own turf. It would be embarrassing if someone who had been studying cries for years, had missed this particular configuration, it's quite possible that an established researcher would hardly be motivated to investigate her claims fully. \r\n\r\nFurthermore, if you read the article, you will find that the  thing that makes Dr. Celeste of MacGill University seem more scientific is that she has encoded her understanding of baby cries in a computer program. I'm assuming she's using either some kind of baynesian network or neural net. But these a.i. encodings are only as good as the input parameters - if you miss the correct basic cries, then of course, the program will disagree with alternative systems of categorizing baby cries.\r\n\r\nThere have been plenty of cases in science where amateurs in science have provided fresh insight in very difficult subject matters.\r\n\r\nI remain agnostic about this one.","timestamp_epoch":1566236758,"message_id":"1907-c5553839-aa37-486d-91c1-5d62d78fbe6a-1566236758"}