{"id":"cu9p2","edited":false,"parent_id":"t1_cu948","author_flair_text":null,"author":"ecuzzillo","retrieved_on":1473808187,"distinguished":null,"gilded":0,"link_id":"t3_u7w7","stickied":false,"subreddit_id":"t5_2fwo","body":"No, the point of an actual scientific development is not to show useful applications of it. In pure science, you're just trying to discover and predict facts. Usefulness is for engineers, computer \"scientists,\" and people like that. Pure scientists' goal is entirely discovery, not creation. And actually, scientists frequently do pursue research with no immediately obvious applications at all. Cosmology, for instance, has absolutely no applications whatsoever in the forseeable future. It is pure science. And yet people study it, and publish papers on it. \r\n\r\nSo when you're writing a *scientific* paper, a pure scientific one, the uses of your research are mostly irrelevant-- you can include them sometimes as a footnote, but they aren't the point. If you're writing some other kind of academic paper, like a robotics or graphics or OS or mechanical engineering paper, then sure, your point is to invent a better mousetrap than your predecessors did, and of course you're going to tell everyone that it's useful because it catches ten times as many mice. \r\n\r\nSo this talk is perfectly applicable (although probably not nearly as well put as Feynman's talk/essay on scientific integrity, found at the end of \"Surely you're joking, Mr. Feynman\") to pure science, but not to CS, and posting this on the programming reddit is going to be pretty confusing that way. \r\n\r\nFootnote: I put computer scientists in quotes because what CS people do is not really science. It's some odd combination of engineering and magic, as Hal Abelson once put it.","controversiality":0,"author_flair_css_class":null,"created_utc":1165700855,"score":5,"ups":5,"subreddit":"programming","timestamp_epoch":1566236764,"message_id":"19071-5291209d-7ffe-4b94-8c08-7d0340be057b-1566236764"}