{"controversiality":0,"body":"Already in my current health plan, I have a terrific amount of \"freedom of choice\".  The number of health care providers who are \"in network\" is staggering.  Even in the more esoteric of specialities, I have plenty of provider options.  \r\n\r\nWhat I don't have is *enough information* to make a **well educated** choice.\r\n\r\nOur plan will be switching to a \"High Deductible Health Plan\", with a \"[Health Savings Account](http://www.treasury.gov/offices/public-affairs/hsa/)\" component.  I just sat through a 2-hour long meeting this week where our \"benefits consultants\" showed us a powerpoint about how great it'll all be.  I was smart enough to sideline one of them last week and get all the materials ahead of time so that I could be prepared to ask very specific questions.\r\n\r\nBasically, our monthly premium will be a lot lower, but the plan won't cover **any** of the first **few thousand dollars** worth of expenses.  But after that, they'll pick up almost everything.  We're supposed to pay that first few $K out of our HSA (hopefully we'll have enough money socked away into it before that happens).  The insurance company assures us that we'll be getting charged their \"negotiated rate\" by the doctors, so we won't have our wallet emptied like we were just anyone who walked in off the street.\r\n\r\nOkay, so a whole lot more of the choice of how I spend my health care dollars is back in my lap.  But it turns out the only **real** choice I have is **whether I'm going to go** and pay to be seen and treated.  See, the doctor's office *won't tell me* what they are going to charge until they actually *see me in the office* and the insurance company *won't tell me* what the \"negotiated rate\" is until **after the bill comes**.  [Price](http://www.pricegrabber.com/) [is](http://froogle.google.com/) [a](http://www.priceline.com/) [pretty](http://www.mysimon.com/) [significant](http://www.dealtime.com/) [aspect](http://www.realtor.com/) [of](http://www.pricewatch.com/) [comparison](http://www.gasbuddy.com/) [shopping](http://www.slickdeals.net/), but apparently it can't be for medical care.\r\n\r\nExcept when you're buying drugs by mail order.  That, you can research to your heart's content.  And you should.  If you happen to need 90 days worth of prescription medications.  (I don't. Yet.)\r\n\r\nAnd the thing that I never got a straight answer on was, now that the insurance company was keeping more of my monthly premium and NOT paying for most of the care I receive (I'm realtively healthy, so I'm unlikley to get past my several thousand dollar deductible for the next several few years), exactly **how motivated are they** to keep those \"negotiated rates\" low?\r\n\r\nAnd how will I truly know if they're doing a good job of it unless I comb through the statements **weeks or months after the actual service was provided**?","link_id":"t3_t92a","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165001864,"score":3,"ups":3,"author_flair_text":null,"author":"toastspork","edited":false,"id":"ct9oa","parent_id":"t3_t92a","gilded":0,"retrieved_on":1473807511,"distinguished":null,"timestamp_epoch":1566236758,"message_id":"1916-6bd33d21-b65a-4380-aef4-378ef81c074a-1566236758"}