{"subreddit":"reddit.com","score":8,"ups":8,"created_utc":1165709682,"author_flair_css_class":null,"controversiality":0,"body":"&gt;No it doesn't.\r\n\r\nActually it does. There's no way to conclude that any man over the age of 16 years doesn't belong to a militia, as the word was used then. And as far as \"regulated\", it's even more absurd to believe that this means \"limited by scope of law\" in that sentence. All it means there is that the militia be well-trained. Moreso, read the thing and tell me whether it actually says only the militia may bear arms... it only uses that as a justification, the important part is \"people\". You and I are people, even if somehow we aren't militia. It doesn't say \"the right of the people belonging to a well-regulated militia to keep and bear Arms, shall not be infringed.\"\r\n\r\nA recap: \"justification for the right, the right itself\". In the second part it declares the right to apply to the people (of the USA). That first part, feel free to twist it up however you like, I don't care. Even go as far as stating that it's no longer relevant isn't bad. You still have to get an ammendment passed. And since there are good reasons to keep it even if the original is moot, you know which way I will vote.\r\n\r\n&gt;It's a pretty poorly written sentence from a grammatical point of view (and I know there are arguments about the placing of commas in it) but it isn't \"convoluted\" to suggest that it relates the right to bear arms to membership of a well regulated militia.\r\n\r\nIt is a little awkward, but being that it was written by men who are undoubtedly my superior when it comes to prose, I hesitate to criticize them at all. Their worst outshines my very best, and so it will always be.\r\n\r\n&gt;Anyway, this is an amendment isn't it? If the constitution can be rewritten to include the right to bear arms, it could presumably just as easily be rewritten to take it out again. At least it could if it weren't for the fanatical opposition there would be to such a move.\r\n\r\nIt can. The correct question is, should it? A few gun deaths per year seems a small price to pay for such a right. And if you think it is more than a few gun deaths per year, I would point out that we could certainly reduce the number just as much by surrendering in our ill-conceived and futile war on drugs.\r\n\r\nMind you, I'm a little uneasy around gun nuts... people that actually like the things. But I'm downright scared of people that believe I as a responsible adult shouldn't be allowed the means to defend myself.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u9bd","gilded":0,"distinguished":null,"retrieved_on":1473808194,"author":"NoMoreNicksLeft","author_flair_text":null,"id":"cua2q","edited":false,"parent_id":"t1_cu9v9","timestamp_epoch":1566236764,"message_id":"19283-2605c1b7-f2e4-4407-bf45-0a00c0d0b515-1566236764"}