{"subreddit":"reddit.com","score":3,"ups":3,"created_utc":1165714600,"author_flair_css_class":null,"controversiality":0,"body":"&gt; Yes...perhaps it only primarily relates to militia type people as opposed to exclusively.\r\n\r\nI don't see that in the wording at all.\r\n\r\n&gt; It still seems to me that the intent was to arm people to defend the fledgling country against the likes of the British\r\n\r\nI agree, you brits are some insane motherffers. \r\n\r\n&gt; Use a gun to defend yourself from...other people with guns?\r\n\r\nYes, though ideally to defend myself against others without guns. But yes. With 200some million guns within our borders, making it illegal won't make them go away. The same lowlifes who shoot up street corners now will still have the things. And I'd rather have a gun than rely on my, though admittedly awesome still inadequate, ninjitsu skills.\r\n\r\n&gt; Anyway the constitution says that all adults (not just the responsible ones) have the right to bear arms.\r\n\r\nWell, maybe if laws were only seeking to limit ownership to responsible people, you'd not have the furor that you have right now with the gun control agenda.\r\n\r\n&gt; To me, that's more than a little scary.\r\n\r\nIt's also scary that the constitution allows people who shouldn't be parents to have children. But, if we were to try to enact procreation control, people would (rightfully) be riled up about it.\r\n\r\n&gt; Gun crime of all kinds is a lot lower here in Britain than it is in the USA - in fact I read a stat on crimeinfo.org that says that the level of \"shooting homicides\" is 34 times higher in America than it is in the UK.\r\n\r\nThis might be true. But I'd still rather live here than there. I find it amazing that the society that born Orwell strives so incredibly to be like the nightmare he warned the world about.\r\n\r\nWhat was it, I'm sure I read about it here on reddit a few months back. Some old guy in the UK who still had a hunting rifle... victim of a home invasion. He shot them, but didn't kill all of them. Went to prison for longer than they did.\r\n\r\nI don't want to live in that sort of society. I don't need government to protect me, and if I let it do so, I know damn well how incompetently it will provide it.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u9bd","gilded":0,"distinguished":null,"retrieved_on":1473808198,"author":"NoMoreNicksLeft","author_flair_text":null,"edited":false,"parent_id":"t1_cua56","id":"cuaan","timestamp_epoch":1566236764,"message_id":"19391-8d1b7133-bf28-4720-87bd-e5569e5800ea-1566236764"}