{"retrieved_on":1473808200,"distinguished":null,"gilded":0,"edited":false,"id":"cuade","parent_id":"t1_cuac5","author_flair_text":null,"author":"[deleted]","author_flair_css_class":null,"created_utc":1165716595,"ups":-4,"score":-4,"subreddit":"reddit.com","link_id":"t3_ua04","stickied":false,"subreddit_id":"t5_6","body":"As a Christian I am bothered by this video as well. It is just way out there.\r\n\r\nHowever, I think very firmly that pro-choice and pro-God (in the context of abortion) is an oxymoron.\r\n\r\nI'll just come out and say it before I go into detail, but abortion is wrong except for in very rare cases. The vast majority of abortions are 'convenience' abortions. That is, someone has gone out, had sex, gotten pregnant, and realized that they can't support or don't want the baby. Now we can argue all day about whether a baby in the womb is a human being or not, but the fact is, within 9 months, that will be a living, breathing human being. For this reason, it is wrong to have an abortion simply because you cannot support do not want the child. Fact of the matter is, you were engaging in an action which by nature creates children. If you don't want to take the risk of having children, don't have sex.\r\n\r\nI do think that in cases of rape, incest, and situations where the mother's life is in danger, you should legally have a choice to have an abortion. However, abortion for all other reasons (that I can think of), should be illegal.\r\n\r\nIt is a fact of life that each action has a consequence or reaction. A consequence or result of having sex is that sometimes children get made. If you do not want to have children at all, if you don't want to take that risk, then don't have sex. But if you do have sex and do end up having getting pregnant, do not eliminate what will in 9 months be a human being. That is in a strictly moral, non-religious sense. In a religious sense, I doubt very strongly that God would approve of that.","controversiality":1,"timestamp_epoch":1566236764,"message_id":"19440-03633f09-ddb3-4f0f-99fb-4961abaac418-1566236764"}