{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_ua04","body":"&gt; A cumshot is a vagina and 9 months away from being a living, breathing human being. Should we enforce a \"no ejaculation outside of vaginas\" policy?\r\n\r\n&gt; An egg is a cumshot and 9 months away from being a living, breathing human being. Should we enforce a \"no menstruation--get pregnant this cycle or be damned\" policy?\r\n\r\n&gt; Saying, \"in 9 months it'll be a kid\" is one massive hand wave.\r\n\r\n\r\nIf an embryo is formed, then it should be illegal and it is wrong to stop it from growing. That's different from the act of simply having sex.\r\n\r\nIt is saying that if you were to allow the embryo or fetus to grow, it'd be a human being. Stopping that from happening is thus ending the development of a human being. You can call it a hand waving or whatever you want. A sperm that is allowed to develop by itself will not turn into a human being. Neither will an egg.\r\n\r\n&gt; Also, it's totally contradictory to say \"abortion is wrong except for in very rare cases\". If you think it's a living human being inside the womans uterus, then killing it (murdering it) for any reason is horrendous, right? Even if the woman was raped. Even if it was a father nailing his 10-years-old daughter. Even if the thing is retarded. Right?\r\n\r\n&gt; What are these cases? Why is \"murder\" okay in some cases but not in others?\r\n\r\nWhy in these other cases? Because the woman did not have a choice. The woman who gets raped did not chose to engage in an act which caused her to be pregnant. In most cases that goes for incest as well, though even in cases that incest is a consensual act, the baby almost certainly will have major deficiencies. I don't even necessarily think that abortion in these situations is right (I honestly am undecided), but I do think the woman should have the option.\r\n\r\nThose are quite different situations from the person who has sex, gets, pregnant, and then wants to excuse that responsibility, regardless if you think abortion in any situation is right or not.\r\n\r\nI mean, really, most people who are against abortions believe it should be outlawed in every single instance. I don't believe that. But apparently for taking a middle ground, it is damned if you do, damned if you don't.","controversiality":1,"ups":-2,"score":-2,"created_utc":1165720662,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cuaj7","edited":false,"parent_id":"t1_cuaf1","author":"[deleted]","author_flair_text":null,"distinguished":null,"retrieved_on":1473808202,"gilded":0,"timestamp_epoch":1566236764,"message_id":"19548-c6cb6258-b5db-4a2b-879d-2500c13f3ae0-1566236764"}