{"score":3,"ups":3,"author_flair_css_class":null,"created_utc":1165721488,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_u9bd","stickied":false,"body":"Yes, it would be nice if we could enforce that only the responsible adults bear arms.  However, that is not an option -- because there is no way to guarantee that the *enforcers* are responsible.  You can't \"watch the watchers\" when they have all the guns.\r\n\r\nThe choice is between guns being available to everyone, or guns being available only to the government and criminals.\r\n\r\nThat's because everyone responds to incentives.  Criminals have no incentive to give up their guns because of a silly law.  And banning guns works just about as well as banning anything else people want, like drugs or alcohol.\r\n\r\nSpeaking of which, most of the problem with gun violence in the US is a direct result of the drug war.  Banning guns would not fix the problem, because guns are not the cause of this violence.  Gangs manage to get huge quanities of drugs into the US from other countries, and there's no reason to think that the police would be any more successful stopping the illegal gun trade.\r\n\r\nIf you want to stop the violence, get rid of the gangs.  And the only way to get rid of the gangs is to get rid of what makes gangs attractive -- the money.  And that's as simple as making drugs legal.  It worked exactly the same with prohibition and the mafia.\r\n\r\nI agree -- guns are scary.  I hope to never have to use one.  But the important thing to remember is that as scary as guns are, they're much *more* scary when you have a good reason to expect one to be used against you.  This is how privately owned guns make crime less attractive for criminals.\r\n\r\nI think that part of the reason people dislike guns so much is that their effect is mostly passive.  Cars are just as dangerous, but it's easy to see how they help us every day. We just don't see all the crimes that did not get committed because the would-be criminals are afraid for their safety.\r\n\r\nAnd finally, if you look at the crime statistics on the site you linked to, you will find that crime is way up overall in the UK in the years following the 1997 handgun ban -- almost double, in fact.","controversiality":0,"distinguished":null,"retrieved_on":1473808202,"gilded":0,"id":"cuakg","edited":false,"parent_id":"t1_cua56","author":"asokoloski","author_flair_text":null,"timestamp_epoch":1566236764,"message_id":"19564-97ad35f4-41a1-4e5a-9508-47bdd7810148-1566236764"}