{"subreddit":"programming","author_flair_css_class":null,"created_utc":1165734654,"score":-29,"ups":-29,"controversiality":0,"body":"Here Joel is simply hating 37signals. Let me explain:\r\n\r\n[And by the way, to see Joel hating Aaron Swartz, go read  his (Joel's) interview in the book Micro-ISV -- towards the end of the book.]\r\n\r\n\r\nHere he is hating Paul Graham:\r\n\r\n\r\nhttp://discuss.fogcreek.com/newyork/default.asp?cmd=show&amp;ixPost=1998\r\n\r\n\r\nthere are 2 posts by him; in the second he says:\r\n\r\n\r\n=========================================\r\n\r\n\r\nAnd I have the ultimate respect for Paul Graham -- I think there's a good probability that in a year or two we will credit him with being the man who solved spam. But I think that if you try to ignore the fact that millions of programmers around the world have learned lisp and don't prefer to use it, you're in the land of morbid cognitive dissonance. And this attitude that \"lisp is only for leet programmers so it's good because only l33t programmers will work on our code so our code will be extra good\" is just bullshit, I'm sorry. Plenty of brilliant programmers know lisp just fine and still choose other languages. Most of them, in fact.\r\n\r\n\r\n=========================================\r\n\r\nthat's Joel hating!! its an art form!  and all this from a guy who **proudly** proclaims in his AboutMe page: http://www.joelonsoftware.com/AboutMe.html\r\n\r\n\r\n=========================================\r\n\r\n\r\nMy senior thesis was a design for a programming language called U, which was a dialect of C in which the programmer could declare functions as being \"user\" functions which would cause the compiler to automatically generate a user interface allowing the user to invoke those functions.\r\n\r\n\r\n=========================================\r\n\r\nWhy the hate, Joel?\r\n(minor editing update)","link_id":"t3_ualu","stickied":false,"subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473808211,"distinguished":null,"author_flair_text":null,"author":"dooka","edited":false,"id":"cub0a","parent_id":"t3_ualu","timestamp_epoch":1566236764,"message_id":"19802-7043a38e-8e14-4bc3-9054-6a68024ca661-1566236764"}