{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tz0c","body":"So man let me include here the chain of comments:\r\n\r\n\r\n   tofocsend 12 points 2 days ago\r\n&gt;In fact, the closest Israel has come to this exchange was the talks between Ehud Barak and Yasir Arafat, in which Israel \"offered\" a group of non-contiguous blobs with no air or water rights, surrounded on all sides by Israeli checkpoints. It was never a real offer of statehood, and the Palestinians were right to reject it.\r\n\r\n\r\n\\t\r\ntofocsend 5 points 2 days ago*\r\n\r\n&gt; Robert Malley, the senior NSC aide to Clinton during the Camp David talks, is pretty clear on what happened:\r\n&gt;&gt; The final and largely unnoticed consequence of Barak's approach is that, strictly speaking, there never was an Israeli offer.\r\n\r\nAnd now you are trying to said that it was me how: \"narrow, doctrinaire, even binary thinking\"?\r\nThe are pretty simple choise: \r\n1. The was no offer (that you claimed in first post and in second post)\r\n2. The offer was really bad (I gave you arguments from the same article that it was not so bad as you tried to present in first post).\r\n3. The offer was real but sides have not succeeded to reach to conclusions. And the blame for this on one side or on both.\r\n\r\nPlease choose one of them. In two your first and second  posts you claimed that 1 and 2 is true. I gave you citations fro the same article you used that it was not true. \r\nSo let us look on 3.\r\n\r\n&gt;  I wasn't trying to argue that the failure was entirely Barak's, but merely that it was not entirely Arafat's.\r\nYou seem to be indulging in a false alternative: either the failure was Barak's fault or Arafat's. \r\n\r\nYes? It so obviously NOT clear from your first post...\r\nThe blame is on the Barak and on Arafat? No problem. One side tried to play hard hand and another said was feared?\r\nOk. Also no problem. But don't try to said that  \"the was no offer\" again. Ok?\r\n","controversiality":0,"score":1,"ups":1,"created_utc":1165747642,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cubdn","edited":false,"parent_id":"t1_cu747","author":"marglexx","author_flair_text":null,"distinguished":null,"retrieved_on":1473808218,"gilded":0,"timestamp_epoch":1566236765,"message_id":"19962-dfe3c9d7-211d-49f2-a225-83cc59bc949b-1566236765"}