{"author_flair_text":null,"author":"k0mplex","parent_id":"t3_ubs6","edited":false,"id":"cubs7","gilded":0,"retrieved_on":1473808225,"distinguished":null,"controversiality":0,"body":"New York Times\r\n\r\nDecember 10, 2006\r\n\r\nOp-Ed Columnist\r\n\r\nAfter the Fall\r\n\r\nBy DAVID BROOKS\r\n\r\n\r\nIn fall 2007, the United States began to withdraw troops from Iraq, and so began the Second Thirty Years’ War. This war was a bewildering array of small and vast conflicts, which flared and receded and flared again across the entire Middle East, but which were joined by a common theme.\r\n\r\nThe essence of all this disorder was that the Arab nation-states lost control. Subnational groups — like Hezbollah and the Mahdi Army — and supranational groups — like loosely connected terror networks, the new Sunni and Shiite Leagues and the satellite television networks — went from strength to strength while central national governments toppled and fell. The collapse of national governments led to a power vacuum that the more authentic and deeply rooted social groups sought to fill.\r\n\r\nThis war had several stages. The first was the disintegration of Iraq. No national institutions could survive the onslaught: there was no impartial justice, no effective law enforcement, no political organization that put loyalty to nation above loyalty to sect or tribe. Absent a government of laws, government by death squads emerged. Militias — with their own hospitals, schools and indoctrination systems — sought to impose order through assassination and revenge.\r\n\r\nThe Muslim world watched the Sunni-Shiite bloodletting on satellite television and became enraged. Militias, seminaries and terror organizations developed transnational alliances. Shiite uprisings occurred in Saudi Arabia, Bahrain and Pakistan. Furious Sunnis rallied in places like Egypt, demanding that their leaders preserve Sunni supremacy.\r\n\r\nThe environment was ripe for new sorts of radical leaders, influenced by Moktada al-Sadr and Sheik Hassan Nasrallah. These leaders were hot, charismatic and divisive. They had no intellectual ties to the old 20th-century Arab nationalism, which was scorned as the model that failed.\r\n\r\nChaos spread as governments in Lebanon and Jordan collapsed. The Palestinian Authority fell into complete dysfunction as Hamas and Fatah waged a low-boiling civil war. Al Qaeda reveled in the bloodshed and spread it with rapturous fury. The spreading disorder vindicated an observation that the historian Michael Oren had once made: that there are really only three nations in the Muslim Middle East: Iran, Turkey and Egypt. The other nations are make-believe. The borders are arbitrary and the governments are artificial.\r\n\r\nThe surviving governments scrambled to stay in front of their radicalized populations and meddled ceaselessly in the wars around them. Turkey meddled in Kurdistan. Iran meddled everywhere through Hezbollah and a legion of mini-Hezbollahs. The Saudis tried to buy their enemies off, but only ended up financing them. Egyptians spread out everywhere as foot soldiers and assassins, especially after the end of the Mubarak era.\r\n\r\nWesterners had a great deal of trouble understanding the ever-shifting conflicts among sects they didn’t understand and tribes they’d never heard of. Early in the war, Americans engaged in a moronic debate about whether Iraq was in civil war, which illustrated that American vocabularies were trapped in the nation-state paradigm, and how unprepared Americans were to understand the non-nation-state world.\r\n\r\nParallels were made, some apt, some inapt, to the first Thirty Years’ War, which decimated Europe in the 17th century. That, too, was a spasmodic constellation of conflicts not among nation-states, but among faiths, tribes and local groupings.\r\n\r\nThis second version of that war produced a Middle East that looked medieval and postmodern at the same time. The core weakness of Middle Eastern nations was that over centuries Arab society had developed intricate social organizations based on family, tribe and faith. Loyalty to these superseded national bonds. Notions of federalism, subsidiarity and impersonal administration — the underpinnings of the nation-state — had trouble flourishing in these sands.\r\n\r\nThe Middle East’s weak national ties were ripped apart by the rising forces of the 21st century: religious fundamentalism, global terrorism, economic globalization and transnational communications networks. Efforts to do nation-building without security faced long odds. Efforts to exhort Iraqi and other leaders to behave “responsibly” — as defined by Western nationalist categories — were doomed to failure. The American defeat sealed the deal.\r\n\r\nIt was a terrible era for those brave patriots fighting for national unity. There was horrific turmoil, and the emergence of sociopolitical organizations whose likes the world had never seen.","link_id":"t3_ubs6","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165760846,"score":1,"ups":1,"timestamp_epoch":1566236765,"message_id":"20132-8e4309c1-84e9-49d0-8779-88772014ad74-1566236765"}