{"controversiality":0,"body":"Honest to blazes, marglexx, did you miss the part where I quoted Robert Malley writing, \"strictly speaking, there never was an Israeli offer\"? I just posted a karma-busting 1,000 word comment explaining what that means. Now quit attacking straw men and start engaging the actual argument I presented.\r\n\r\nOne thing is clear: if any party is going to bring an end to the conflict, that party is Israel. Israel is the party that is in direct, ongoing violation of international law through its illegal occupation and illegal settlements. This is not in dispute: international law is unambiguously clear on the illegality of Israel's position. \r\n\r\nIsrael has all the cards. It has the military superiority (bought with massive subsidies from Britain and then America). It has maintained a 'kill ratio' of about 10:1 against Palestine (in other words, every time a Palestinian terrorist kills an Israeli, the IDF kills ten Palestinians) since the 2000 intifada. It performs military operations that are guaranteed to kill civilians and excuses the killings as \"collateral damage\" - as if killing civilians as a predictable 'side effect' of its offensive strikes were somehow morally superior to the asymmetric civilian attacks of the Palestinian terrorists.\r\n\r\nIf Israel wants lasting peace with Palestine, it needs do little more than conform with international law. That is, withdraw immediately and entirely from the territories it illegally occupies. When it does this, it has the right to demand that Palestine also obey international law and a) cease all attacks on Israel, and b) formally recognize Israel's existence. (Even Hamas, which officially opposes Israel on principle, has endorsed the Prisoner's Agreement, which implicitly recognizes Israel's right to exist. The Arab Leage supports this, as do a large majority of Palestinians.)\r\n\r\nIf Palestine fails to do these things, Israel has the right to respond in a manner consistent with international law. However, Israel does not have the right to demand that Palestine stop resisting its occupation *before* Israel ends the occupation. Palestine has declared - and honoured - many cease-fires over the years, but Israel has not honoured its prior promises to stop settlements, end military incursions, etc. (That is the context within which Arafat was being asked to trust Barak.)\r\n\r\nBarak and Arafat had an opportunity to negotiate a lasting peace along these terms, but between the former's grandstanding and clumsy negotiating, the latter's relentless skepticism, and the artificial haste of Clinton's anxious desire to \"solve\" the Middle East problem as a legacy of his presidency, the negotiations stalled and then failed completely.\r\n\r\nAt the same time, the Likud opposition in Israel, led by the war criminal Ariel Sharon, was doing everything in its power to undermine Barak's initiative, which after all came closer to a just offer than anything previous and infuriated Israel's right wing. Sharon's inflammatory appearance at the Temple Mount, in particular, was a calculated insult to Palestinians and a strong indication that they would not be treated fairly if a Likud coalition took over the Knesset, which looked likely.\r\n\r\nArafat knew that if he accepted Barak's terms only to have Barak lose to Sharon, Sharon would use the framework to tie Arafat's hands diplomatically with no intention of ever actually finalizing an agreement. Again, as Malley points out: \"the Palestinians feared they would be left with principles that were detailed enough to supersede international resolutions yet too fuzzy to constitute an agreement.\"\r\n\r\n&gt; But don't try to said that \"the was no offer\" again. Ok?\r\n\r\n*There was no offer.* The closest Barak came to an offer was a set of parameters within which an actual offer might be established. I'll let Malley have the last word:\r\n\r\n&gt; When the two sides resume their path toward a permanent agreement - and eventually, they will - they will come to it with the memory of those remarkable eight months, the experience of how far they had come and how far they had yet to go, and with the sobering wisdom of an opportunity that was missed by all, less by design than by mistake, more through miscalculation than through mischief.","subreddit_id":"t5_6","link_id":"t3_tz0c","stickied":false,"subreddit":"reddit.com","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165761382,"author":"[deleted]","author_flair_text":null,"parent_id":"t1_cubdn","edited":false,"id":"cubt2","gilded":0,"distinguished":null,"retrieved_on":1473808225,"timestamp_epoch":1566236765,"message_id":"20146-5e6b107b-36a6-4ad8-a824-035e96d770e8-1566236765"}