{"stickied":false,"link_id":"t3_ubo5","subreddit_id":"t5_6","body":"Your first sentence and your second sentence contradict each other. If people incarcerated for crimes they did not commit aren't victims, what are they?\r\n\r\nRegardless, I don't see prisons as \"full of victims\". I think the US judicial system still works well enough that most of the people in prison deserve to be there. My desire to see prison reform has more selfish reasons in addition to empathy for convicted (justly or not) criminals. First, if anyone anyone who shoplifts or smokes pot is treated like this, I am afraid they will come out as psychopaths at the end of their terms and cause more harm to society. Secondly, and more scary to me, I am afraid that if someday I am unjustly put in prison, I will be treated the same way. \r\n\r\nYou say prisons are not about reform. What then, in your view, is the purpose of prisons? Forfeiting empathy and humanity for the moment, if every prisoner in there was locked down for life, you could argue that the purpose of prisons is isolating criminals (sometimes unjustly) from society. But a very large percentage of these people will be back on street in a few years. Do you think they will forget how society treated them when they were in prison?\r\n\r\nYou also say that prisons are horrible places with or without guard torture. I agree, but I don't think the solution to that is to ignore the behavior of the guards. I think the solution is to prevent this behavior AND do more. I am not an expert on reform but off the top of my head I can think of the following things\r\n\r\n1) Separate violent offenders from the non-violent offenders\r\n2) Allow non-violent offenders a better chance to reform themselves in prison (trade schools in prison)\r\n3) Make sure the penalties for escalating from non-violent to violent crimes are larger.\r\n\r\nBy your own admission, there are many psychopaths in prison. If you force non psychopaths to live in an environemnt dominated by psychopaths it doesn't take long for them to join the club.\r\n\r\nEdit: See this comment by hopeseekr. Here's an innocent man, being forced to go through the same treatment meted out to violent criminals. It is torture in it's worst form and it is inflicted on heorin addicts (who, if addiction is their only 'crime' aren't even criminals, just sick people)\r\n\r\nhttp://reddit.com/info/f8bb/comments/cf8vq","controversiality":0,"created_utc":1165782939,"author_flair_css_class":null,"score":10,"ups":10,"subreddit":"reddit.com","edited":false,"id":"cucr3","parent_id":"t1_cuchv","author_flair_text":null,"author":"mypuppetaccount","retrieved_on":1473808243,"distinguished":null,"gilded":0,"timestamp_epoch":1566236765,"message_id":"20677-ae6d99ae-3341-4884-98fd-ca7687445800-1566236765"}