{"subreddit_id":"t5_6","link_id":"t3_ubuw","stickied":false,"body":"These industries (or rather, certin companies in these industries) were definitely helped by government intervention.\r\n\r\nI would argue, though, that the government's intervention - at least in the example of roads - has probably harmed, more than helped, the US as a whole.\r\n\r\nI recall reading that the US automotive industry was behind the legislation taking billions of our tax money and pouring it into making an international highway system. They recognized that they'd sell a hell of a lot more cars if people could drive them all over the place.\r\n\r\nSo, in being forced to pay for a gargantuan highway system, the government in effect killed off many different methods of getting from A to B.\r\n\r\nWho knows? Maybe we'd have a huge electric train infrastructure, or be shipping cargo around the US with dirigibles or something if those billions (probably trillions by now) had been able to go to other forms of transportation instead of where the car manufacturers wanted.\r\n\r\nHeck, as long as I'm skipping through fantasyland here - maybe we wouldn't be so addicted to oil, we wouldn't be dealing with global warming, and we wouldn't be engaged in an unwinnable war in the Middle East if the government hadn't gotten involved in building highways.\r\n\r\nBut, get me going long enough and I'll be telling you that if we as a society had gotten over our nation-state fixation in the 19th century, we'd be having this conversation in the Metaverse, and I'd be on a L5 space habitat, looking at a 1000 year lifespan doing things we read about in science fiction. Alas, the nation states have killed millions and spent the trillions of dollars that would make such progress possible.","controversiality":0,"score":14,"ups":14,"author_flair_css_class":null,"created_utc":1165784652,"subreddit":"reddit.com","edited":false,"id":"cucu8","parent_id":"t1_cucm5","author":"NoFixedAbode","author_flair_text":null,"distinguished":null,"retrieved_on":1473808245,"gilded":0,"timestamp_epoch":1566236765,"message_id":"20733-44a101b9-b5f0-4c17-bee5-93d49f914dcd-1566236765"}