{"author_flair_css_class":null,"created_utc":1165786226,"score":30,"ups":30,"subreddit":"reddit.com","link_id":"t3_uc9i","stickied":false,"subreddit_id":"t5_6","body":"I can't speak for any other country except Chile (I'm Chilean).  \r\nThe thing most people don't understand about Pinochet and the military coup of the 1973 is that a great portion of the country supported it, because Allende brought the country into near-ruin in just a few short years in office.  Read the wikipedia entry (http://en.wikipedia.org/wiki/Salvador_Allende) for a sampling of how after a brief economic upswing, the country started a fast downward spiral.  Americans always focus on the dubiously-lawful influence of the CIA, ignoring the fast that an equal amount of support on the other side was coming from Cuba.\r\nMore important to my immediate family, though, was Allende's dissolution of private property, at least property exceeding a certain acreage.  My grandfather and uncles are farmers and ranchers (and not involved in politics), and basically from one day to the next were told by the new government that their farms now belonged to \"the people.\"  As a result, they had to defend their homes themselves at nighttime with rifles, from marauding bands of mostly unemployed people coming to claim their \"new\" property.  Allende tried to forcibly redistribute wealth, and it didn't go over so well.    Imagine the government announcing that your house or apartment would now be community property, so move your stuff out of the second bedroom to allow the local druggies to move in.  That was essentially the feeling.  Not to mention the classic hallmark of communism: suddenly having to stand in line for food or gas, when your country is properous just a couple of years ago.\r\nEveryone is sorry people died, but Americans don't understand that Pinochet's actions were greatly appreciated by many.","controversiality":0,"retrieved_on":1473808247,"distinguished":null,"gilded":0,"id":"cucxe","edited":false,"parent_id":"t1_cucjl","author_flair_text":null,"author":"lex99","timestamp_epoch":1566236765,"message_id":"20793-4818ae47-47b6-4cbb-a8d1-55af2d3aa516-1566236765"}