{"id":"cud07","parent_id":"t1_cucwj","edited":false,"author_flair_text":null,"author":"NoMoreNicksLeft","retrieved_on":1473808248,"distinguished":null,"gilded":0,"link_id":"t3_u9bd","stickied":false,"subreddit_id":"t5_6","body":"&gt; Defend themselves from the tiny minority of people who carry illegal guns\r\n\r\nI fail to see how whether its a minority, tiny minority, or majority changes whether this should be allowed or not. Would you care to supply some numbers for a threshold at which you think it should be legal to own guns? Do we need 11% of the population to be homocidal maniacs before guns are legal?\r\n\r\n&gt; If it's a choice between that and giving every Tom, Dick and Harry a gun, then yes.\r\n\r\nOf course, we are referring to responsible, largely-non-criminal adults here. So if it's a choice between letting them have guns and not, you really only want to disarm these people? How fucked up is that? How fucked up is it that the majority of them have voluntarily disarmed, and that only a fraction choose to own firearms, and yet this isn't good enough? It makes a person wonder about your motives. \r\n\r\n&gt; Britain is a much safer place than the US in terms of gun crime so it seems to work.\r\n\r\nAnd this couldn't possibly be for any other reason than public disarmedment.\r\n\r\n&gt; Burglars don't carry guns here as a rule.\r\n\r\nSo because they don't pack in the UK, we should give up legal guns in the US? That's a little absurd.\r\n\r\n&gt; You wouldn't need a gun to be able to defend yourself from them.\r\n\r\nYes, but I'm a grandmaster of ninjitsu and can shoot lightning bolts out my ass. Other people aren't half so talented. Are you going to make exemptions to the gun ban for people over the age of 50? For those that are overweight or otherwise out of shape? For the accountants who have never thrown a punch in their life? Even with a burglar who has no gun, has nothing except his own hands, there are many reasons why someone would need a gun to defend themselves. And if they're carrying a crowbar or a knife or baseball bat... a gun's the only thing that will give most people a chance at all.\r\n\r\nOur problem is not a gun problem. It's a crime problem. Nothing short of an innovative solution that cuts to the core of the issue is likely to solve that. But guns scare people (and they should, I think). It's an emotional issue. It's easy to look at all of this, and incorrectly think \"if they're just weren't so many guns out there, it'd be a better place\". But do you think people still wouldn't want to kill each other, were guns more difficult to acquire? The people doing bank heists would still have guns... they have the connections, and the need. A few random shooting where some day trader loses his shirt and shoots up the office building... those might be reduced. Hell, maybe eliminated after enough time has passed (50 years) to make guns impossible to get for the average joe. A few other scenarios would become rarer, others wouldn't.\r\n\r\nYou'd be trading a few hundred lives for a right so important it was listed #2 in the Bill of Rights. Think about that a moment, and not just listed second, but it got the entire ammendment to itself... every other one, they crammed 3 or 4 or 5 rights into it.\r\n\r\nIf we want to eliminate gun crime, or crime in general, we need to quit the war on drugs. Make it legal to own, possess or sell drugs to anyone over the age of 18. Regulate the production of drugs that must be created in a lab setting, but not to the point where it stifles availability. Make it illegal to discriminate against users unless their job duties involve the use of heavy machinery, and then only if they're under the influence during working hours. Take 1/20th of what we spend on the DEA and fund voluntary treatment programs.\r\n\r\nDo this, and we'd reduce gun crime so much, people would be in shock. Or, you could keep harping on an issue that won't fix anything, but would undermine democracy just as those who planted this meme intended it to.","controversiality":0,"author_flair_css_class":null,"created_utc":1165787368,"score":2,"ups":2,"subreddit":"reddit.com","timestamp_epoch":1566236765,"message_id":"20832-7918261b-3ca2-4a3a-8a5c-cb6f07ad2b08-1566236765"}