{"controversiality":0,"body":"If it is harmful to people a resonable person would expect to encounter such as those with asthma or possibly allergies depending on how prevailent they are then no, you don't have the right to wear that perfume.\r\n\r\nNo, it has nothing to do with my opinion of the odor.  Cigarette smoke does actual verifiable harm to people.  Quit bringing up that stupid straw man.  Cigarettes are 'special' because they do actually hurt other people.  If someone has some perfume that is also demonstratably hurting other people then that perfume should also be banned in the same places for the same reason.\r\n\r\nOh, while we're talking about straw men, let's be clear that we're talking about cigarettes here, not just tobacco.  It's quite possible to use tobacco without harming anyone around you.  You can chew it of course, but even if you burn it much of the poison comes from the additives that are part of turning them into a fuse so that cigarettes will keep burning.  If you stop puffing on a cigar it will go out.  If you stop puffing on a cigarette it will continue to burn like a fuse.  There is a TON of extra crap that is in cigarettes as compared to ordinary tobacco.  I have no idea if tobacco smoke by itself is proven harmful.  The evidence is for cigarette smoke.\r\n\r\n\r\nPoint blank, no more strawman bullshit:  From your post you seem to think that people have a right to smoke cigarettes even around people who will be hurt by them.\r\n\r\nIf that is true, then why do you think that smokers have the right to hurt other people?  If that is not true then why do you seem to be supporting people's right to expose other people to cigarette smoke?\r\n\r\nThe article in question covers circumstances under which other people are being exposed to the smoke.  As much as you may not like it that does include apartment complexes.  There is no amount of duct tape that can block off all the smoke coming in from other apartments.  I've tried.  Others have tried.  It turns out the particles are small enough to actually permeate drywall.  This means even if you really don't miss any macroscopic holes it will make it through the microscopic holes in the drywall itself.\r\n\r\nIf you want to smoke alone in your own house or in a private club where everyone in the building has agreed to be exposed that's fine.  I object to being unwillingly exposed to proven dangerous toxins.  I do not consent to it.  I am currently paying a premium to live in a non-smoking apartment complex.  I do everything reasonable to avoid cigarette smoke.  I want to know why I can't go to the grocery store without being exposed to it because people still stand right next to the door to smoke even though it's technically illegal.  I want to know why I can't go for a morning jog outside without being exposed to cigarette smoke, not from residents, but from people driving through with their windows open.  I want to know why smokers think they have the right to flick their used butts on other people's property.  I want to know why I can't get away from this shit in SLC, UT, AKA Mormon Capital of the world.  I want to know why smokers get to assault me with toxic chemicals, but if I strike back suddenly I'm the bad guy, even if I do it within the legal system.  I want to know why I should have any respect at all for someone who thinks people have the right to assault everyone around them with dangrous chemicals.","stickied":false,"link_id":"t3_ubmh","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165788214,"author_flair_css_class":null,"score":-5,"ups":-5,"author_flair_text":null,"author":"Joss","id":"cud1x","edited":false,"parent_id":"t1_cucni","gilded":0,"retrieved_on":1473808249,"distinguished":null,"timestamp_epoch":1566236765,"message_id":"20868-4ab6d165-9147-49f8-94dd-bf7c3d3931d6-1566236765"}