{"edited":false,"parent_id":"t1_cud2n","id":"cud53","author_flair_text":null,"author":"DA5lD","distinguished":null,"retrieved_on":1473808251,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_u9s2","stickied":false,"controversiality":0,"body":"&gt;\"I tell no children they will burn for all eternity.\"\r\n\r\nThen you don't teach them what's in the bible. I was taught this from an early age. What do you do -- wait until they are old enough to deal with the idea of eternal torture?\r\n\r\n&gt;\"the little girl in the film IS being abused by the simple act of parading her as a tool in front of millions of people for religious and/or political gain\"\r\n\r\nBullshit. The girl is not being treated inhumanely or cruelly. She actually is either a very good actress or is enjoying the whole thing.\r\n\r\n&gt;\"there is NO conflict between religion and politics, and there is NO conflict between religion and science.\"\r\n\r\nI actually don't have a problem if you believe that, but FWIW, I disagree.\r\n\r\n&gt;\"EVERY US President ever has been Christian\"\r\n\r\nSorry, I don't believe that either. Here in the U.S. it has been political suicide for a politician to admit being agnostic or atheist. It's much safer to \"fake it.\"\r\n\r\n&gt;\"My objection is the way the eight year old is being USED without her consent\"\r\n\r\nHow can you possibly know that? Did god tell you in a dream? As I said before I would *Really* like a follow-up on this with the little girl telling her feelings, in her own words on YouTube. I suspect if she didn't say what you wanted, you'd say she was being forced to speak.\r\n\r\n&gt;\"This should outrage every atheist on here as much as every non-atheist.\"\r\n\r\nFWIW, I'm not an atheist, although I'm sure you see no difference in that and an agnostic. I'm not outraged. If it turns out the girl was forced against her will to do just about anything, I *Would* be pissed. But I just doubt that's so. I AM interested enough to try to contact the author of this video to see if we can get some kind of follow-up.\r\n\r\nIn the meantime, try to get \"yer knickers out of a twist.\" :-)","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165789488,"subreddit":"reddit.com","timestamp_epoch":1566236765,"message_id":"20910-3d073ca0-1007-41c3-898c-142329abda01-1566236765"}