{"retrieved_on":1473808251,"distinguished":null,"gilded":0,"id":"cud60","edited":false,"parent_id":"t1_cud0l","author":"CarlH","author_flair_text":null,"created_utc":1165790011,"author_flair_css_class":null,"ups":0,"score":0,"subreddit":"reddit.com","stickied":false,"link_id":"t3_ua04","subreddit_id":"t5_6","body":"Yes yes --- but remember that I was basing that *ONLY* on the video linked in this post. Remember that the link in this post only goes to a short segment about an anti-abortion segment at the camp, which quite frankly isn't all that alarming to me. It does not link to the *WHOLE* documentary, or the ABC NEWS Clip about it -- which changes things.\r\n\r\nTherefore, my original post was written PURELY in response to the link above, and the posts I saw.\r\n\r\nThat said -- there most certainly *IS* a vile hatred which exists against Christians -- and it *IS* just plain wrong and totally unwarranted, and I will most certainly speak out against it. \r\n\r\nIf you dont think people hate Christians, then ... I dont know what planet you are on seriously, just go find any atheist forum and I guarantee you will find *PLENTY* of terribly degrading insulting comments directed at anyone who claims to be a Christian --- not in all cases, but in *MANY* cases.\r\n\r\nAs for why I think Christianity is unfairly treated --- I am speaking in *THIS* forum, about *THESE* posters -- specifically on reddit. Not all, but many.\r\n\r\nThere are *MANY* on here who by their own admission would attempt to use the video of \"Jesus Camp\" in an attempt to abolish *ALL* Christian summer camp.\r\n\r\n\"Do you think its wrong to criticize a theory that has repeatedly contradicted itself time and time again...\" --- I dont follow. Please elaborate.\r\n\r\nThe act of Sept 11/2006 is *IRRELIVANT* in EVERY WAY SHAPE AND FORM to this discussion. If you care to show why its relevant I am all ears.\r\n\r\n*HATRED* against *A GROUP OF PEOPLE* is *WRONG* and *UNWARRANTED* *PERIOD*. There is no wiggle room here. Hating *ANY* group of people *JUST* because they are a member of a group that does not believe as you do, is *WRONG*. It is called \"prejudice.\"\r\n\r\nTell me what the extreme of \"Be nice, dont kill, do unto others as you would have them do unto you\" is.","controversiality":0,"timestamp_epoch":1566236765,"message_id":"20922-492b2609-00fd-4897-a64b-c0f8c5910fc2-1566236765"}