{"author_flair_css_class":null,"created_utc":1165790199,"score":1,"ups":1,"subreddit":"reddit.com","link_id":"t3_ua04","stickied":false,"subreddit_id":"t5_6","body":"&gt; \"There is little or no social stigma on being a Christian\" -- You dream! This is just not so. Many Christians are afraid to even admit it at their place of business, at their job, kids at school are afraid to say it to their friends. Now granted, the same in large part goes for atheists as well --- but to think there is no social stigma on ANY world view is just incorrect.\r\n\r\nI've been both a Christian and an atheist at various times, and I've never seen a situation outside of the internet in which anybody would be afraid to say that they're a Christian. I sure as hell can't say the same about atheism.\r\n\r\nNow, perhaps you've lived in places very different from what I'm used to -- but I still find your claim more than a little incredible.\r\n\r\n&gt; \"It is fairly common for atheists to either state or imply that religious people are on average less intelligent than atheist\" --- Yes this is a large part of what I mean. It is also disgusting and insulting, and wrong.\r\n\r\nLet's address each of those adjectives:\r\n\r\n**Disgusting** -- I think that a claim can only be disgusting if it is wrong and still repeated.\r\n\r\n**Insulting** -- while this claim is insulting to a broad group, it is a *statistical* claim about *mean* intelligence. It should not be taken as an insult to any particular person. Isaac Newton was a Christian, and he was a genius.\r\n\r\n**Wrong** -- here we come to the crux of the matter: is it wrong? [This Wikipedia article](http://en.wikipedia.org/wiki/Religiosity_and_intelligence) gives references to a bunch of research showing that IQ and religiosity tend to be inversely correlated. Caveats: intelligence is poorly defined, and causation is a lot trickier to establish than correlation.\r\n\r\n&gt; More often than not whenever a Christian enters an atheist forum and just mentions They are a Christian, they get blasted for being an idiot, stupid, etc.\r\n\r\nI've seen that happen loads of times, but with one difference: in all the cases that I've seen, this Christian also said something horrendously stupid. Often other Christians join in the flaming.\r\n\r\n&gt; Overall I am amazed at the hypocricy of the atheists I have run into. \"We must advance free speech for all worldviews. Crush religion!\"\r\n\r\nI have yet to meet an atheist who wanted to crush religion through coercive means.\r\n\r\n&gt; \"It is wrong to hate a group of people and to be prejudice! All Christians are idiots\" etc --- its just full of double standards.\r\n\r\nI *have* seen some atheists call all Christians idiots. Then they get flamed by their fellow atheists for saying something so mind-bogglingly stupid.\r\n\r\nMaybe I've been hanging out at higher-caliber forums and I've grown accustomed to atheists acting reasonable.","controversiality":0,"retrieved_on":1473808251,"distinguished":null,"gilded":0,"edited":false,"id":"cud6b","parent_id":"t1_cud3b","author":"sketerpot","author_flair_text":null,"timestamp_epoch":1566236765,"message_id":"20928-3c521d38-d5c7-4362-9419-2fc1a761c237-1566236765"}