{"body":"I do not believe that a free market leaves power vacuums. In fact, it generally increases the power of humans to influence society and their environment both individually and collectively. So if anything a free market increases power.\r\n\r\nNor am I saying that a free market will magically make people stop grasping for power. Or that any system of law/politics/society written on paper/stone tablet/dvd disc will result in a utopia where everybody's happy and manna rains from the sky.\r\n\r\nOn this plane of existence, there is no such thing as perfection, and we must muddle through the chaos the best we can, learning the lessons it has to offer. There will always be evil people who want to do evil things, people just struggling to get by, people who create beautiful things and do wonderful works - that isn't going to change. I do believe, however, that there are political/economic systems that are better than others - that make it easier for people to create and do good things, and more difficult for the evil people to do evil.\r\n\r\nWhat I am saying, and the economics supports this, is that in a free market, power is gained by providing goods and services to other people, the power gained is generally limited in scope, and it is easily lost. All characteristics that are demonstrably not true about the statist system of distributing power that we have now.\r\n\r\nIn our current system, power is gained through a thoroughly corrupted voting system that bears more resemblance to a surrealistic game show than a political process. Power of very wide scope is given to patently unqualified people, and they can hold on to this power, causing immense damage for years and years without fear of losing it.\r\n\r\nYou may accuse me of building fantastic utopias, but asking for more of the same seems to be insanity.\r\n\r\n&gt;And when you claim \"a large number of economists would agree with me\", you should specify which ones are not from the Austrian school.\r\n\r\nHow about the Chicago school? Seriously though - in modern economics, the Austrian/Chicago schools have been wiping the floor with the marxists and keynesians, who have largely been discredited. It is free market thinkers like Milton Friedman who have had more influence recently than any other school of economics. Hopefully this will continue...","controversiality":0,"stickied":false,"link_id":"t3_ubuw","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165793618,"author_flair_css_class":null,"score":5,"ups":5,"author":"NoFixedAbode","author_flair_text":null,"parent_id":"t1_cud7m","id":"cudc7","edited":false,"gilded":0,"retrieved_on":1473808255,"distinguished":null,"timestamp_epoch":1566236765,"message_id":"21021-af24947c-f486-4857-bbc4-a8fdd29b0d1d-1566236765"}