{"author":"marcusk","author_flair_text":null,"edited":false,"id":"cudfb","parent_id":"t1_cuc9o","gilded":0,"distinguished":null,"retrieved_on":1473808256,"controversiality":0,"body":"of course the military is too strong to resist by force, it's absurd to believe otherwise, 200 years ago resistance was easier since the weapons available to the general populace were on a par with those available to the military...  as has been shown in multiple conflicts, modern warfare is NOT hand-to-hand, it is now conducting via air and by missiles...  as you point out the only way that they could be resisted is if the military themselves do not participate in the suppresion of any uprising...\r\n\r\nit's funny but the government is constantly weakening the people, have you not seen this occurring over the past 5 years???\r\n\r\nand the intent of the amendment was NOT for self-defense against other citizens...  any modern reason for the amendment is an absurd attempt to try and keep guns in society...  it's no accident that the u.s. has the highest gun-deaths in the world...  the reason there is no shortage of guns is because gun culture is engrained deep in the pysche of every u.s. citizen...  \r\n\r\nthe problem is not so much that liberty cannot be defended, it's that it's NOT defended, the bush administration has done more over the past 5 years to turn the u.s. into a pseudo-nazi state and EVERYONE has sat back and let it happen...  there is no defense of liberty in the u.s. anymore and there hasn't been for many years, the mere concept of liberty in the u.s. nowadays is a smokescreen...\r\n\r\nit's funny but you describe my scenario as outlandish... on 10th September 2001 the following would also have been described as such:\r\n\r\n1. mulsim radicals (u.s. citizens) hijack 3 planes and fly them into the world trade center towers and the pentagon, the world trade centers are completely destroyed and 3,000 u.s. citizens are killed...\r\n\r\n2. in response the u.s. government invades afghanistan and iraq drawing them into a protracted conflict where over 2,000 u.s. service personnel are killed and iraq teeters on the edge of civil war...\r\n\r\n3. to ensure that the u.s. is protected, the u.s. removes habeas corpus, sets up a number of hidden prisons where terrorist subjects are tortured and interrogated using methods that flout the geneva convention, they also introduce legislation to allow any u.s. citizen to be described as a terrorist and held without trial and without legal representation for an indefinite period...","subreddit_id":"t5_6","link_id":"t3_u9bd","stickied":false,"subreddit":"reddit.com","score":-1,"ups":-1,"author_flair_css_class":null,"created_utc":1165795483,"timestamp_epoch":1566236765,"message_id":"21067-6d351791-39fd-4600-8782-c0db4954c0f6-1566236765"}