{"controversiality":0,"body":"&gt; if you say you're an atheist, it means you believe there isn't a god of ANY [tautology removed] kind.\r\n\r\nIf the following are true\r\n\r\nA. one can prove there is no Judeo-Christian-Islamic god.\r\n\r\nB. one cannot prove that there is no flying spaghetti monster god.\r\n\r\nC. one cannot prove that there is a flying spaghetti monster.\r\n\r\n\r\nWouldn't it follow that: \r\n\r\nD. One must believe there is no Judeo-Christian-Islamic god. \r\n\r\nE. One cannot believe there is no flying spaghetti monster god. \r\n\r\nF. One cannot believe there is a flying spaghetti monster.\r\n\r\n\r\nIf it follows then wouldn't it be useful to describe this as:\r\n\r\n* \"Being atheist with respect to a Judeo-Christian-Islamic god\", and \r\n\r\n* \"Being agnostic with respect to a flying spaghetti monster god.\"\r\n\r\n&gt; otherwise it's like saying you're a vegetarian, but you eat fish.\r\n\r\nVegetarian Peter Singer has said he has no (moral) problem with eating road kill.\r\n\r\nThank for the Altruism link. If Cline is correct to write \"Barber believes that a deeper understanding of the evolutionary background of our moral thinking could help us better address moral problems today.\"\r\n\r\nThen I think Barber wrong. An evolutionary account for morality, interesting in and of itself, applied to solving moral problems directly can only impede those problems. Asking how altruism arose is different from whether one should be altruistic.\r\n\r\nThere would be an evolutionary account for why mathematics exists. But when it comes to solving the problem of 2 + 2, a description of the early human need for barter, say, is a distraction.\r\n\r\nMoral problems, like mathematics problems, can only be solved a priori.\r\n","stickied":false,"link_id":"t3_tq6l","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165799528,"author_flair_css_class":null,"score":0,"ups":0,"author_flair_text":null,"author":"johnbentley","edited":false,"id":"cudn9","parent_id":"t1_ctspz","gilded":0,"retrieved_on":1473808261,"distinguished":null,"timestamp_epoch":1566236765,"message_id":"21186-a2aa8fca-1c08-438b-8555-2bb2dfbce7f3-1566236765"}