{"gilded":0,"distinguished":null,"retrieved_on":1473808270,"author_flair_text":null,"author":"farra","edited":false,"id":"cue4f","parent_id":"t1_cudf5","subreddit":"reddit.com","score":9,"ups":9,"created_utc":1165810930,"author_flair_css_class":null,"body":"Inaccuracies (sorry this is long):\r\n\r\n* Mormon doctrine does not explicitly claim Elohim has multiple wives but doesn't rule it out either.  Mormons do believe in a \"Heavenly Father\" which is sometimes, though rarely, referred to as Elohim.  They also believe a \"Heavenly Mother\" exists but say little about her.\r\n* The video suggests that there are all sorts of Gods running around the known universe and Elohim just happens to be one of them attached to our planet.  That's not how most Mormons would understand it.  Mormons believe that Elohim is _the_ God of this universe.  They also believe that he too went through a mortal life experience in some earlier universe and has progressed to the point where he has created his own universe and populated it with his spirit children.  So Mormons do believe that there were other Gods and that humans may evolve into Gods but let's just say they think of one God for one universe and for all general purposes there's one God around here and it's Heavenly Father.  Or at least, he's all you need to be concerned about.\r\n* There was not vote in heaven.  God chose Jesus.  Other spirit children (you and I) got to chose who to follow, but the winner was not up for vote.  It was not a democracy.\r\n* The bit about blacks being the spirits who didn't take sides is false.  This was never an official doctrine.  I know some did believe it, but it was never officially taught.\r\n* Elohim did not come down to earth and become mortal.  This was a personal conjecture by Brigham Young but never official doctrine.  Elohim and Adam are separate individuals.  If you really get into LDS teachings you see why the idea that they could be the same makes no sense.\r\n* Elohim didn't knock Mary up.  At least not the way that's depicted in the film.  At least in no way more than any other Christians believe this.\r\n* Jesus didn't have multiple wives.  Or maybe he did.  Who knows?  The Mormons don't claim anything.  Though most believe that Jesus must have been married.\r\n* Mormons don't claim Joseph Smith as a decedent of Jesus Christ.\r\n* Joseph Smith is not your personal savior, not Jesus and won't be judging you.  Well, he might help out judging you, along with Moses, Peter and Abraham and all those other holy prophets.  Mormon's claim he did more than any man _except_ Jesus to bring humans to God.\r\n* The role of polygamy is generally exaggerated in the film.\r\n\r\nOn the other hand, several parts of the film are accurate.  In fact, if I didn't list it here, it's accurate.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_ud3o","timestamp_epoch":1566236765,"message_id":"21507-a5c4240a-033b-420d-b1d8-94faf08e52dd-1566236765"}