{"author_flair_text":null,"author":"jdhope","parent_id":"t1_cue18","edited":false,"id":"cue9l","gilded":0,"retrieved_on":1473808272,"distinguished":null,"controversiality":0,"body":"After the teacher's aid documented what happened, it was out of her hands.  She probably has little control over what the parents and principle decide about the matter.  She's just following standard CYA procedure.  If the issue were to come up later(and it very well might), she will be questioned as to why she didn't document the incident.  That's the way the system works.  Her not having a report of the incident will not prevent a parent from seeking testimony from someone else(a bus driver witnessing the scene).  Our society has shown itself to at times be hysterical about our children, even to the point of trusting a small child's solo testimony against an alleged molestor.  Given the negative impact of simply being *accused* of intentional sexual contact with a child, I can empathize with an aid being overly-cautious.  At any rate, I would not wish for her to end up with a sex offender record.\r\n\r\nAccording to the article, the principle mentioned it as \"inappropriate physical behavior **interpreted** as sexual contact and/or sexual harassment.\" in a letter to the parents.  The student's file will refer to it only as \"inappropriate physical contact.\"  This is not a cover up but merely a concession to the parents and a recognition that the student's behavior need not be interpreted as sexual but merely inappropriate.\r\n\r\nAsking the school to remove all paperwork about the incident would rob the school of any defense against a lawsuit.  If the teacher really were a sex offender and a worse incident were to come up later, removing documentation for the previous incident would really look like a coverup and would not be in the school's or principle's best interest.","stickied":false,"link_id":"t3_ucm2","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165813833,"author_flair_css_class":null,"score":1,"ups":1,"timestamp_epoch":1566236765,"message_id":"21586-e3470842-9bba-46bf-a5f0-69a8eefd0e9b-1566236765"}