{"controversiality":0,"body":"Nope. Here's what's happening:\r\n\r\nThe src=\"data:\" part lets him store the entire image in the URL. The image/gif part tells the browser to treat the data as a GIF. \r\n\r\nNow, GIFs are limited to 256 colors, but you can *pick* which 256 colors you want. The way that works is that the first part of a GIF file includes a long chunk of data called the palette, containing up to 256 RGB color codes.\r\nThese are just like the 32-bit hex codes we use for HTML: there's one byte for red, one for green, one for blue.\r\n\r\nNow, because the data for the image is encoded as a URL, each byte is actually represented by 3 characters. For example, the first nine characters, %47%49%46 are the hex codes for the three characters \"GIF\". \r\n\r\nSo, the palette winds up taking 3 x 3 x 256 characters, for a grand total of 2304 characters. \r\n\r\nWhat that replace() call does storing the first 54 characters in a variable called $1, then 9 characters in $2, and 2295 characters in $3. Then it leaves $1 in place and swaps $2 and $3. \r\n\r\nNow, 2295+9 == 2304, so obviously $2 and $3 together are the bytes of the palette. And all the code is doing is taking the first color (9 url-characters or 3 bytes in the gif) and moving it from the beginning of the palette to the end. \r\n\r\nThen of course, the image itself is just laid out as a gradient of the palette. As you rotate the colors, it's just like changing a stylesheet in your HTML: the data stays the same, but the presentation changes. So you wind up with a neat little animation effect.\r\n\r\nPretty cool! :)","stickied":false,"link_id":"t3_ud5h","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165828956,"author_flair_css_class":null,"score":3,"ups":3,"author_flair_text":null,"author":"tangentstorm","id":"cuevi","edited":false,"parent_id":"t1_cuel2","gilded":0,"retrieved_on":1473808284,"distinguished":null,"timestamp_epoch":1566236766,"message_id":"21911-d2618cf6-5aaf-4364-9115-6ab78352e4fc-1566236766"}