{"controversiality":0,"body":"I reckon, then, neither of us has the stamina left for our  semantic dispute. I may have contributed, unhelpfully, to this state. I should have, at the beginning, been clear about reporting V stipulating definitions. \r\n\r\nPerhaps, though, we might continue with substantive disputes.\r\n\r\n&gt; A is definitely not true.\r\n\r\nA is true. Here is the proof:\r\n\r\nG. The Judeo-Christian-Islamic god is claimed to have the characteristics of being all good, all knowing, and all powerful.\r\n\r\nH. There is great suffering of non human origin. \r\n\r\nI. If god is all powerful she can't be all good (she must be a utter cunt), if she is all good she can't be all powerful.\r\n\r\nJ. Therefore, the Judeo-Christian-Islamic god does not exist.\r\n\r\nSo facts about the world are incompatible with the Judeo-Christian-Islamic god. I don't know of any facts about the world that are incompatible with a flying spaghetti monster god. (Although I'd have an eager ear if those more familiar with Pastafarianism could correct me on this.)\r\n\r\nOne should neither believe in a Judeo-Christian-Islamic god nor a flying spaghetti monster god. The difference is in the Judeo-Christian-Islamic case we have evidence against the  existence, in the flying spaghetti monster case we have no evidence for the existence.\r\n\r\n&gt; when it's over, i'm still arguing with somebody over the internet.\r\n\r\nThis is very interesting. Are you suggesting that arguing over the internet, let's assume in a dispute that does not make you mad, is less worthwhile than other forms?\r\n\r\nBy \"internet\" I'm not going to hold you to some future possible medium. Perhaps you have in mind by \"internet\" something like brief text based interactions with strangers with no real investment in continuing.\r\n\r\nWhat do you mean? Potentially something we might agree on. That might make me stop being distracted by it, leaving reddit forever :)\r\n\r\nEdit: Spelling. Sorry.","link_id":"t3_tq6l","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165838979,"score":1,"ups":1,"author":"johnbentley","author_flair_text":null,"edited":false,"parent_id":"t1_cuej0","id":"cuf95","gilded":0,"retrieved_on":1473808291,"distinguished":null,"timestamp_epoch":1566236766,"message_id":"22081-0d8cd677-c1ed-4b18-bba5-e2a497bcd723-1566236766"}