{"subreddit":"reddit.com","ups":4,"score":4,"author_flair_css_class":null,"created_utc":1165009846,"body":"&gt;If a person is willing to kill themselves, do you think they have the slightest regard for others?\r\n\r\nThere's a fair amount of research into suicides and how the suicidal are often quite considerate of those around them. They tend to choose methods that make an orderly retrieval of remains either quite simple and easy (a la hanging, or cutting in a tub filled with water) or nearly impossible (jumping off a high bridge). Many suicides are people who otherwise seem normal and happy, but for some reason or another do not want to continue living, which is why you so often hear shock from close relatives at the news of a person's suicide.\r\n\r\nThere's another class of people who are seeking attention, and thus are only attempting suicide, i.e. are seeking to punish themselves and/or bring attention to their plight without killing themselves. This is not to pass judgment on these people as often times they are simply unable to conceive of another way to solve their problems - but every so often they are a little too good at it, and actually get themselves killed.\r\n\r\nI don't know if the suit was \"as selfish\". For all you know he just had a very bad day and was trying to get to the florists before it closed to pick up flowers for his dying mother. He could be a guy who pays his bills, stays out of trouble, gives to a charity, volunteers with needy kids -- and just snapped. Maybe he had a traumatic experience in childhood with suicide. Who knows? But given the story, it's so clear that he is presented as \"the bad guy\" - I agree with other commenters that this sounds like a contrived story.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_t8jy","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473807521,"author":"rafuzo2","author_flair_text":null,"id":"cta8d","edited":false,"parent_id":"t1_ct9gr","timestamp_epoch":1566236758,"message_id":"2218-6cb91eba-8759-4c67-b0bc-c746b925b7b9-1566236758"}