{"edited":false,"id":"cug9g","parent_id":"t1_cubt2","author":"marglexx","author_flair_text":null,"distinguished":null,"retrieved_on":1473808309,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tz0c","body":"About something:\r\n&gt; Israel has the right to respond in a manner consistent with international law.\r\n\r\nIsrael do not believe in this. I will explain you why. International law is piece of paper. It is unable to bring justice because there is no anybody who can enforce it. It is right in both way - nobody can force Israel to get out of from occupied (btw from Jordan and Egypt) territories. From another side nobody will do anything to stop attack on Israel. Here is last example. Lebanon. The hizzbollah launched thousands of rockets (hiding in populated areas) and international society did nothing. Almost every day (even during so called armistice) rockets are falling into Sderot. Nobody cares. But everybody cares when by mistake civilians from Palestinians side hit. (btw stories about Sderot never hit the reddit front page).\r\n\r\nSharon's inflammatory appearance.. Man this place is also sacred for jews. The El Quds is built ower the Jewish gretes religious building. Second - it seems that in arab world it is really acceptable to make such disorders on any \"insults\"? I'm happy that Sharon did not draw caricatures. Btw do you think that Israel also can start fires in Iranian  properties al over the world because of Holocaust cartons?\r\n  \r\nIsrael has all the cards. It has the military superiority\r\n\r\nIt is not completely true. If the palestenians problem is really Arab-Israel problem than Israel in huge military disadvantage here (because of population ratio). I'm no saying that Israel should not leave territories. It should. You claim that palestenians feared to be cheated. Israelis also feared to be cheated.\r\nIsrael is really concerned abouts its survival. Any risk is not just risk of high casualties but risk of state survival. Thats why Israel want some guaranties of it's security. And frankly speaking nobody can guarantee it. Even if palestenians question will be resolved.  \r\nMoreover nobody in Israel do not talking in removing from map any arab country. While Iran (with his so called \"peace nuclear\" programm) saying that Israel should be erased from map. \r\n\r\n&gt;Even Hamas, which officially opposes Israel on principle, has endorsed the Prisoner's Agreement, which implicitly recognizes Israel's right to exist.\r\nMan do you believe in such bullshit? Will you try to distort any word that Hamas leaders say in order to much your lies?\r\n&gt; Haniyeh reiterated that his government will never recognize Israel's right to exist or abide by previous peace agreements between Israel and the Palestinians. link: http://www.allheadlinenews.com/articles/7005818469\r\n\r\nSo if current palestenian government says this - how can you go and make peace talks?\r\n\r\n\r\n","controversiality":0,"score":2,"ups":2,"created_utc":1165855403,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236766,"message_id":"22550-c927dd4f-94d2-4f7a-8d67-7740931696ff-1566236766"}