{"edited":false,"id":"cugf3","parent_id":"t3_ueqk","author_flair_text":null,"author":"jopejope","distinguished":null,"retrieved_on":1473808312,"gilded":0,"subreddit_id":"t5_2fwo","link_id":"t3_ueqk","stickied":false,"controversiality":0,"body":"**SPOILER WARNING: Do not read the following if you're still working on the puzzle.  If you've solved the puzzle already, there is no need to read this.  In fact, there is really no reason at all why anyone should be reading this, and the only reason I'm posting it is because I'm a smarty-pants and I want everyone on this board to know it.**\r\n\r\nFirst, weigh 4 balls against 4 other balls.  If they are not equal, do the following:\r\n\r\n* label the heavy balls H and the light balls L, and the ones you didn't weigh E.  Now weigh 2 H's and 1 L against the other 2 H's and 1 L.  If they're equal, you know one of the 2 L's you didn't weigh is the one, so weigh them against eachother, and the lighter one is it.  If they are not equal, then you can eliminate the two H's on the lighter side and the L on the heavier side, so it must be one of the remaining 3 balls (two H's and an L) so weigh the H's against eachother, if they're equal it's the L, otherwise it's the heavier H.\r\n\r\nIf the first weighing is equal, it must be one of the 5 balls you didn't weigh, in which case do the following:\r\n\r\n* Label the five remaining suspect balls as follows: A, A, B, B, C.  Label all the other balls E.  Weigh AA against CE.  If they're equal, it must be one of the B's, so weigh a B against an E and if it's not equal it's that B otherwise it's the other B.  If the AA is heavier than the CE, then weigh the A against the A and if they're equal it's the C otherwise it's the heavier A.  If CE is heavier than AA then weigh the A against the A and if they're equal it's the C otherwise it's the lighter A.\r\n\r\nPhew.\r\n\r\n**END SPOILER**","ups":14,"score":14,"author_flair_css_class":null,"created_utc":1165857596,"subreddit":"programming","timestamp_epoch":1566236766,"message_id":"22630-2a8c3dd3-e33c-4197-930f-bf4c5f9dbf5f-1566236766"}