{"controversiality":0,"body":"There are a lot of assumptions in this article, that are incorrect.\r\n\r\n         1. Real estate appreciates in the long term\r\n\r\nThis assumes you will continue to make your mortgage payments for the long term. It also assumes that there will not be a economic downturn and that demand for that particular piece of real estates will continue to climb (not always true).\r\n\r\n         2. The alternative is to pay rent, which does nothing to improve your finances\r\n\r\nThis is utterly false.  Rent is cheaper then a mortgage in many cases.  The money \"saved\" can be used for other things.\r\n\r\n         3. The interest on your mortgage is tax deductible\r\n\r\nThis is a stupid argument and has never made a lick of sense.  Spend more so you can be taxed less?\r\n\r\n         4. You can borrow against your home equity in an emergency\r\n\r\nMaybe you can.  Maybe you cannot.  There are several factors that dictate this, I need not mention them all do I?\r\n\r\n         5. The equity portion of your mortgage payment is a form of automatic savings\r\n\r\nThis assumes you are actually building equity.  Nearly 25% of home loans right now are upside down.  Not everyone \"builds\" equity.\r\n\r\n         6. A home is a leveraged investment using other people’s money\r\n\r\nUtterly False.  A home is a debt you incurred. It may not even be an investment, depending on the market, price paid and the length of time you own it.  Not all real estate rises in value.\r\n\r\nAs for other people's money, this argument claims that ANY loan is other people's money, but ignores the fact that it's still a debt (with INTEREST).\r\n\r\n         7. A home purchased with a fixed rate mortgage has a stable payment schedule that becomes easier to pay over time due to inflation\r\n\r\nYeah, right.  If you believe this, then I've got a bridge to sell you.\r\n\r\nInflation does NOT mean your wages or source of income will increase, this is anothe false assumption.  Inflation does mean, however, that your purchasing power decreases.  There is no guarantee whatsever that your wages will also increase.\r\n\r\nA fixed rate IS much better then an ARM, but  don't bank on inflation to \"help you out\", this is the plain stupid.\r\n\r\n         8. Owning a home is a good way to diversify your assets\r\n\r\nSure, well - maybe.  There are plenty of ways to diversify your assets, this in only one way with a hefty dose of risk involved.\r\n\r\n         9. Home ownership clear of debt will help you retire comfortably\r\n\r\nThis is conjecture.  Debt free home ownership (which is what I have) is great, but it does not mean I will retire comfortably.  It ONLY means that it is a debt free asset and nothing else.\r\n\r\n        10. Pride of ownership helps increase you self-confidence\r\n\r\nWell, if this is true, then you should probably go talk to someone.  \r\n\r\nThe idea that ownership \"makes\" the person is indicative of some mental problems.  Self confidence does not come from ownership of anything, other then your own person.  Being yourself is key.  Being free of debt, like a mortgage or any other loan is also a factor.  \r\n\r\nBut you can be the worst pauper in the world and buried in debt and still have self-confidence.  Debt and ownership have nothing to do with self confidence at all.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_ugj4","subreddit":"reddit.com","score":0,"ups":0,"created_utc":1165861412,"author_flair_css_class":null,"author":"lifeofliberty","author_flair_text":null,"parent_id":"t3_ugj4","id":"cugpm","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808318,"timestamp_epoch":1566236766,"message_id":"22798-19a204b2-ee8d-4274-ba79-69b07f282d84-1566236766"}