{"author":"acrophobia","author_flair_text":null,"edited":false,"id":"cuh0e","parent_id":"t1_cugj5","gilded":0,"retrieved_on":1473808324,"distinguished":null,"controversiality":0,"body":"&gt; Yes, theoretically the market, at any given point, will be in a state of equilibrium (fairly valued, as many bears as bulls, etc.). However, in practice this is far from true\r\n\r\nI think you've misinterpreted what I'm trying to say.  I'm not saying that the market has converged on the *correct* price, what you might call the rational price, I'm saying that to make money on average you must come to a *better* conclusion on the correct price.  I can say with probability 1 that todays valuation of MSFT is wrong.  I say this because I know that tomorrow's price will be different.  **But**, that does not mean that I know in which direction it is wrong, which is the information you need to make money.\r\n\r\n&gt; You make it seem like any trade is a roulette spin which ignores the real-world factors of information/technology imbalances, etc.\r\n\r\nNot at all.  Share price is fundamentally based on all the things you mention.  What I am saying is that to beat the market you need to know *more* than everyone else on what the effects of all these things are.\r\n\r\nIt might be quite plausible for a reader of this site to know more than the market on, say, companies specializing on concurrent programming methods.  After paying attention to all the Eiffel and Erlang articles that come and go, you might be in a good position to make a punt, because these are very specialized technologies that traders are just not going to understand as well as you.\r\n\r\nBut \"the dollar is going to fall because china holds lots of dollars and jp morgan's chief economist agrees with me\" is just the FX version of \r\n\r\n\"invest in yahoo, they do internet stuff, and the internet is growing\".\r\n\r\nIt is naive to think you can beat the market in the long term on such a shallow understanding.  (just to reiterate, i'm not saying here that yahoo is not going to go up, i'm saying that it will be based on much more non-obvious things like: can their technology scale as well as google, can they manage to keep their best employees when their options aren't paying out much, are the algorithms of google more effective than the social-web of yahoo etc etc)\r\n\r\nAs they say, a little knowledge is a dangerous thing.","link_id":"t3_ucp9","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165865262,"score":4,"ups":4,"timestamp_epoch":1566236766,"message_id":"22968-f787b98b-2153-4425-a052-5aea47f38a5b-1566236766"}