{"author_flair_text":null,"author":"johnbr","parent_id":"t3_uhet","edited":false,"id":"cuhhp","gilded":0,"retrieved_on":1473808333,"distinguished":null,"controversiality":0,"body":"No it doesn't, not really.  Because it's not really Econ 101.  If you make something free, or nearly free, entrepreneurs use that thing to help make something else, something bigger and more complex.  Which is exactly what we've seen happen over the past few years.  The unemployment rate for programmers has plummetted, but yet there's more overseas software developers than ever.  Why? Because if you lower the average cost of developing software, it makes paying for new software development more attractive.\r\n\r\nThink of a box of legos.  Any individual lego is virtually free.  But the box, with the instruction manual and the assortment of legos - that's attractive and valuable.  And there's only one kind of person who can assemble various bits of free or nearly-free software together - a programmer type.\r\n\r\nIn the end, it's not about Microsoft.  It's about self-expression.  People want to create, and software is cheap and easy to create that people can give it away.  And then other people can come along and make it better, tune it for an environment, in general make the world a better place.\r\n\r\nAs for Microsoft's lost income - it's not our job to help Microsoft and Seattle earn money.  Our job is to look out for our own best interests, whether that be using open source, or building open source, or assembling tools together to create new value.  \r\n\r\nNo offense, but whenever I see articles like this - basically questioning \"whether letting people choose freely is a good thing\", I always find a lack of imagination on the part of the writer.    Creative destruction is a good thing. It is a good thing for America, it is a good thing for the world, and it is a good thing for the future.   Because it always brings something new and unexpected.\r\n","stickied":false,"link_id":"t3_uhet","subreddit_id":"t5_2fwo","subreddit":"programming","created_utc":1165872334,"author_flair_css_class":null,"score":6,"ups":6,"timestamp_epoch":1566236766,"message_id":"23242-e7b8ada6-a0b3-4a97-860f-ab3fe29327c9-1566236766"}