{"id":"cuhl0","edited":false,"parent_id":"t1_cuhb2","author":"inkieminstrel","author_flair_text":null,"distinguished":null,"retrieved_on":1473808334,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_ufq3","stickied":false,"body":"Some observations on the damage it does from a top notch teacher in a top notch school that's suffering under NCLB:\r\n\r\n* You can't measure good teaching.  Teachers now optimize their teaching for a standardized test with broad coverage, meaning that curriculum tends to focus on cramming for a single test day instead of giving kids knowledge that will stick with them for a life time.  There's no time for the latter.  This seems akin to measuring developer productivity by lines of code.\r\n\r\n* Schools feel compelled to cut time children have with specialists and in subjects that aren't tested such as art, music, and physical education.\r\n\r\n* Well respected teachers with 20 years of experience who excel at their craft are required to take expensive classes on their dime so they may become \"highly qualified.\"\r\n\r\n* In schools in rough neighborhoods where kids underperform because of poverty, gangs, drugs, and overall culture are punished for underperforming.  This punishment ultimately lands on the teachers as though they were responsible for reversing a century of history.  Teachers who arguably should be awarded medals for being willing to work in such a formidable environment are thus forced out of their jobs.\r\n\r\n* Some classes are tougher than others.  This year's third grade may not be the same as last year's.  It may have a higher proportion of disruptive students by the roll of the dice or the new second grade teacher may not have taught as effectively and the kids may be behind.  The third grade teacher is held accountable for these fluctuations.\r\n\r\nBasically what it comes down to is the responsibility for everything is laid on the teachers, but only in terms of negative repercussions.  It's the stick, but not the carrot.  In exchange, the teachers are required to spend money out of their own pockets to fund their education so they can continue to work.\r\n\r\nIt sucks for teachers and makes them scapegoats for random coincidences and socioeconomic factors that are completely out of their control.  Said teacher this is coming from is in one of the most competitive districts in the country and teaches music, which isn't tested under NCLB.","controversiality":0,"score":12,"ups":12,"author_flair_css_class":null,"created_utc":1165873365,"subreddit":"reddit.com","timestamp_epoch":1566236766,"message_id":"23289-e3a60cd9-57b6-408e-aae3-9c1007ea1028-1566236766"}