{"edited":false,"parent_id":"t1_cuh8a","id":"cuhoa","author_flair_text":null,"author":"furyg3","retrieved_on":1473808337,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_uga5","subreddit_id":"t5_6","body":"&gt;Can you imagine a city planner today with either the audacity to undertake a transformation so major or the sheer competence to do it in such a way that the end result is an improvement?\r\n\r\nYes, I can imagine one.  However I can't imagine millions of homeowners and city councils agreeing to allow one guy to completely restructure their city.\r\n\r\nI sit right now overlooking a beautiful canal in Amsterdam.  It's great.  But it was designed when \"trucks\" hauled goods up and down the canals, which are now used for tourists to float around on.  Now, in order to get goods in and out of the city, it's a royal PITA.  Nobody in their right mind would design a city like this nowadays.  The Dutch have great city planning (metros, bike lanes, trams, etc), but even outside the city center things look very different.\r\n\r\nThe reason why we think the heart of cities like paris and amsterdam are beautiful is because they are quaint.  In our eco-friendly world we say \"wow, a city built for no cars\" and think it's great, but the reason it wasn't built for cars wasn't because they were great urban planners, it's because *there were no cars*.  Or fire-retardent building materials (necessitating buildings made of \"pretty\" brick or stone).  Or elevators (keeping buildings from being too big).\r\n\r\nIt's also likely that the way old cities look now, wasn't how they looked then.  You're seeing them with gas heating, modern plumbing, and trash services ... not with suit, feces, and trash (even after Haussmann created his \"master plan\").","controversiality":0,"created_utc":1165874566,"author_flair_css_class":null,"score":11,"ups":11,"subreddit":"reddit.com","timestamp_epoch":1566236766,"message_id":"23331-12606c09-7f5b-49d8-832f-5df93c0f9395-1566236766"}