{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_uhc0","controversiality":1,"body":"&gt;Flight 77 supposedly hit the Pentagon, and was supposedly piloted by Hamid Hamza. This person was assessed by two different aviation professionals as having poor flying skills\r\n\r\nOf course!  I'm such an idiot, all the evidence is BS, TWO, not just one, but TWO aviation professionals have weighed in.  I'm convinced!  It obviously had to be a missile!\r\n\r\n&gt; WTC 1, 2 and 7: These buildings were clearly brought down by demolitions. This topic has been scientifically dealt with by Steven E Jones of Brigham Young University (tenured) and seems to be quite certain.\r\n\r\nMr. Jones had some great questions that I easily found answers to.  This paper written by several civil engineers that specialize in progressive collapse seem to sum it up rather well.  It’s unfortunate that Jones is being persecuted.  He had honest questions that had honest answers.  Though he might have done better by consulting with an civil engineer and saved himself some headaches.  But he did get the media spotlight back, I’ll give him that.   \r\n\r\nhttp://www.civil.northwestern.edu/people/bazant/PDFs/Papers/ProgressiveCollapseWTC-6-23-2006.pdf\r\n\r\n&gt; As it happens, during the weekend before 9/11, at least, the buildings were closed for an extremely unusual 36-hour power down. According to Scott Forbes (see below) only on floors 47 to 50, and men in maintenance suits were seen entering the building that weekend, ostensibly to do a network \"recabling\". \r\n\r\n\r\nSteve Forbes: All systems were shutdown on Saturday morning and the power down condition was in effect from approximately 12 noon on Saturday September 8, 2001 to \r\nApproximately 2PM on Sunday 9/9. \r\n\r\nhttp://georgewashington.blogspot.com/2005/11/interview-with-scott-forbes.html\r\n\r\nIsn’t that 26 hours?  Still I don’t really see the point, I’d expect there to be weekend maintenance on some part of 200+ floors of office space.  \r\n\r\n&gt; Quotations\r\n\r\nGood thing ordinary people under extraordinary pressure are objective!  I’ll take two peoples opinion before 1000s of others that were there but weren’t objective and didn’t want to make statements about what they thought caused it. \r\n\r\n&gt; Each of the building had lots of debris hit them, yet they did not collapse despite major damage. Contrast this with WTC 7, which was hit by nothing and had only minor fires, yet fell and did so perfectly symmetrically and rapidly.\r\n\r\nI wish there were pictures other than these and evidence other than this that shows the minor fires and how nothing had hit it.  All I could find were reports about all the structural damage and huge fires.\r\n\r\nhttp://wtc.nist.gov/progress_report_june04/appendixl.pdf\r\n\r\nIf you haven’t checked it out you should.  It includes a lot of eye witness accounts minute by minute and has some graphic pictures of all the damage.\r\n\r\n\r\n&gt; As early as Sept 23rd, 2001, at least four of the government's designated hijackers were found to be alive and well.\r\n\r\nGood thing we all have distinct names!  My friend John Smith seems to be everywhere but with a different look.  I always have to remind him who I am and where we met.\r\n\r\nWell that was fun.  Thanks again for the link!  I always enjoy going to 911 “truth” sites that have lots of old information that can easily be corrected along with lots and lots of advertising.  \r\n\r\nPuke.\r\n","score":-4,"ups":-4,"created_utc":1165883579,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cui9a","parent_id":"t1_cuhxx","edited":false,"author_flair_text":null,"author":"Fountainhead","distinguished":null,"retrieved_on":1473808348,"gilded":0,"timestamp_epoch":1566236766,"message_id":"23691-2827a2a6-9497-41ad-8d53-6daa65fe5c8c-1566236766"}