{"subreddit":"reddit.com","score":4,"ups":4,"author_flair_css_class":null,"created_utc":1165894806,"controversiality":0,"body":"&gt;They were intensely competitive and were always trying to outdo one another, like mathematicians or physicists today—maybe like anyone who has ever done anything really well.\r\n\r\nThis is likely false. Competitive people do worse in areas where they need to create things of value, such as art. Some examples from No Contest by Alfie Kohn:\r\n\r\n*\"Robert L. Helmreich ... the relationship between achievement, on the one hand, and such traits as the orientation toward work, master (preference for challenging tasks), and competitiveness, on the other. A sample of 103 Ph.D. scientists were rated on these three factors based on a questionnaire. Achievement, meanwhile, was defined in terms of the number of times their work was cited by colleagues. The result was that \"the most citations were obtained by those high on the work and mastery but low on the competitiveness scale.\"*\r\n\r\n*This started Helmreich, who did not expect that competitiveness would have deleterious effect. Could the result be a fluke? He conducted another study, this one involving academic psychologists. The result was the same. He did two more studies, one involving male businessmen, measuring achievement by their salaries, and the other with 1300 male and female undergraduates, using grade point average as the attainment criterion. In both cases he again found a significant negative correlation between competitiveness and achievement.*\r\n\r\n...\r\n\r\n*But Helmreich did not stop there. As of 1985, he had conducted three more studies. The first compared the standardized achievement tests of fifth- and sixth-graders to their competitiveness. They were negatively correlated. The second examined the relationship between performance of airline pilots and competitiveness. The relationship between the latter and superior performance was negative. The third looked at airline reservation agents and again found a negative correlation between performance and competitiveness.*\r\n\r\n...\r\n\r\n*Consider the question of artistic creativity. The little research that has been done suggests that competition is just as unhelpful here as it is in promoting creative problem-solving. In one study, seven- to eleven-year-old girls were asked to male \"silly\" collages, some competing for prizes and some not. Seven artists then independently rated their works on each of 23 dimensions. The result: \"Those children who competed for prizes made collages that were significantly less creative than those made by children in the control group\" Children in the competitive condition produced works thought to be less spontaneous, less complex, and less varied.*\r\n\r\n...\r\n\r\n*Consider journalism, a profession that, while no more competitive than many others, is worth exploring by virtue of its unusual visibility to outsiders. The frantic race for news generates terrific levels of anxiety ... on the part of journalists. Can we at least point to better reporting as the result of this competition? Setting reports against one another in a battle for space on the front page or the first block of a television news show probably lowers the quality of journalism in the long run, and so, too, does the contest among news organizations for subscriptions or ratings.\"*\r\n\r\nI'll stop there to avoid retyping the guy's entire book into the comment field, but there are many more examples. Also I note that Paul has written several essays on creating wealth, and it's basically the same thing where the people who end up making the most money are the ones who try to create something of value as opposed to trying to beat someone else.\r\n\r\nThat aside, there is some serious situational irony in this essay, in that it's about what makes art good and it's a pretty mediocre essay by PG standards.\r\n\r\nIt seems like there is a connecting paragraph missing between graph 2 and 3 under \"Audience,\" and it *sounds as if* it's repeating itself constantly:\r\n\r\n1. You could just go out and buy a ready-made blank canvas. If there's no such thing as good, that would be just as great an achievement as the ceiling of the Sistine Chapel.\r\n\r\n2. And the reason you can't equal Michelangelo by going out and buying a blank canvas is that the ceiling of the Sistine Chapel is more interesting to people.\r\n\r\n3. Because humans have so much in common, you'd also find they agreed on a lot. They'd nearly all prefer the ceiling of the Sistine Chapel to a blank canvas.\r\n\r\n...\r\n\r\n1. I'd be willing to eat the apple the world's population had voted most delicious\r\n\r\n2. Man-made stuff is different. For one thing, artists, unlike apple trees, often deliberately try to trick us.\r\n\r\n3. If we were talking about the taste of apples, I'd agree that taste is just personal preference. \r\n\r\n4. The thing is, art isn't apples. Art is man-made. It comes with a lot of cultural baggage, and in addition the people who make it often try to trick us.\r\n\r\n5. So it turns out you can pick out some people and say that they have better taste than others: they're the ones who actually taste art like apples.\r\n\r\nI understand that what you are trying to do is develop a metaphor, and then keep extending that metaphor as you explain further with logic. In theory it's a clever idea for a writing style, but in practice it's extremely grating because it just sounds like you are repeating yourself over and over unless you put them side by side and compare them.","subreddit_id":"t5_6","link_id":"t3_ufsk","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473808359,"author":"Alex3917","author_flair_text":null,"id":"cuito","edited":false,"parent_id":"t3_ufsk","timestamp_epoch":1566236767,"message_id":"23972-e65df261-9a15-48b7-b969-984efd9b1702-1566236767"}