{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165894785,"ups":28,"score":28,"body":"I'm no conspiracy theorist.... but..\r\n\r\nWhen i read the FEMA report put out explaining the collapse of WTC Building 7 (a building across the street from the two towers) which has the following paragraph, i have to wonder what's going on:\r\n\r\n“Loss of structural integrity was likely a result of weakening caused by fires on the 5th to 7th floors. The specifics of the fires in WTC 7 and how they caused the building to collapse remain unknown at this time. Although the total diesel fuel on the premises contained massive potential energy, the best hypothesis has only a low probability of occurrence. Further research, investigation, and analyses are needed to resolve this issue.” (Chapter 5, pg 31.)\r\n\r\nAfter 5 years an millions spent, the investigation of the collapse comes up with the line \"the building to collapse remain unknown at this time\".. \r\n\r\nI have to shake my head and say:\r\n\"It's damn weird to see 3 massive steel buildings all collapsing in 1 day due to fire, thereby being the FIRST ever occurance of a steel framed building collapsing due to fire\"..\r\n\r\nIt's even more weird that every single building with the label WTC (7 of them) were destroyed that day, but not a single other building in the area fell that day.\r\n\r\nForget theories, step back and think \"what are the odds\"?\r\n\r\nFor those who say \"two planes crashed into the building, obviously they fell\", you apparently don't realize that both tower 1 and tower 2 were specifically designed to withstand an impact from an airplane the size of the planes that hit. Including fire.","controversiality":0,"link_id":"t3_uhc0","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808359,"distinguished":null,"author":"neoform","author_flair_text":null,"id":"cuitk","edited":false,"parent_id":"t3_uhc0","timestamp_epoch":1566236767,"message_id":"23971-f98c0099-dcb3-4a0e-af96-2ed48106bf90-1566236767"}