{"body":"&gt; I don't recall reading that he was banned from seeing his friends.\r\n\r\nI doubt that he is, but if he doesn't spend a good chunk of each day with them, then he'll be an outsider. This can be useful training, but it's a hard road. It's like an office where a lot of interesting stuff happens at the water-cooler. You can't schedule a 3:30 daily meeting to recapture that.\r\n\r\n&gt; True, but I don't see what the problem is with letting him go to college. \r\n\r\nI got the impression that this was his full-time schooling. Dropping in to college for a few courses would be very different -- I'd recommend that. It would allow him to explore various interests, without the clock ticking on a degree program.\r\n\r\n&gt; He'd be wasting his time in school all day.\r\n\r\nProblem is, he may be wasting his time at Uni. It says he wants to be an astronaut, or a veterinarian, or study mass communications. It sounds like he doesn't really know what he wants to do. \r\n\r\nWhat are the chances that in 4-8 years he'll want to go back and study something else? So, what's the rush?\r\n\r\nInstead of studying mass comm at school, he could be blogging, or writing, or making videos, or learning illustration, or whatever. He would get more out of studying it later, after having done some unscripted stuff on his own.\r\n\r\nHe could apprentice with a vet. There are many ways to do meaningful projects without skipping a bunch of grades. Having the time to sample a bunch of different pursuits and really find out what they're like is invaluable.\r\n\r\n&gt; For every child whose parents put them in college at age 11, there are a million who were merely beaten or molested regularly. I find it ridiculous that so many people worry about this non-issue.\r\n\r\nThis is nonsencial. By this argument, we should not try to prevent non-fatal assault, because there are people out there being murdered. Just because it could be worse, doesn't mean it's good.\r\n\r\nIn any case, have you been through it? I have. It was an issue for me. I started high-school when I was 11. I started university at 15 -- at least at that age I could participate socially, as well as academically. \r\n\r\nI enjoyed university; I met my future wife there, so overall things worked out. The thing is, there was no need to rush. I would have gotten much more out of school if I had been more mature.\r\n\r\nLook, here's the thing. High skills take time, effort, and experience to develop, in addition to aptitude. Prodigies demonstrate aptitude, but they won't come into their full abilities until they've also been seasoned. Why rush that process? \r\n\r\nWhen Richard Feynman got bored at school, his teacher gave him a book on variational methods; his parents let him play with his tube radios, and his chemistry set -- they didn't skip him to the next level of schooling.\r\n\r\n\r\n","controversiality":0,"stickied":false,"link_id":"t3_uhfb","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165903169,"author_flair_css_class":null,"score":4,"ups":4,"author":"HiggsBoson","author_flair_text":null,"parent_id":"t1_cuj2b","edited":false,"id":"cuj7p","gilded":0,"retrieved_on":1473808366,"distinguished":null,"timestamp_epoch":1566236767,"message_id":"24191-3f1f1eb2-99ed-4c28-8129-9b76cb7f7254-1566236767"}