{"edited":false,"id":"cujno","parent_id":"t1_cuij0","author":"drawkbox","author_flair_text":null,"distinguished":null,"retrieved_on":1473808375,"gilded":0,"subreddit_id":"t5_mouw","link_id":"t3_ue7m","stickied":false,"body":"I hope we went to the moon but...\r\n\r\nNot saying its fake, just lots of reasons to do so:\r\n\r\nReasons to fake the moon landing\r\n\r\n- appear to win the communist battle (after WWII technology advancements were needed to show superpower strngth)\r\n\r\n- Middle of the Vietnam War just as the war was getting unpopular, we had money to go to the moon then?\r\n\r\n- Nixon was president, JFK promised the moon in the decade, we went in 1969\r\n\r\n- Even if they went the pictures are very high quality and video relays faster than does satellite communication from Afghanistan.\r\n\r\n- Justify more defense funding and star wars programs.\r\n\r\n- Kubrick did such a good job on 2001 in 1968 :P\r\n\r\n- unforunately it became a huge political event and something a government might think is in the best interest of the war\r\n\r\n\r\nThings almost unbelievable about the trips\r\n\r\n - 6 flights, all made it there and back safely (Yes even Apollo 13 that was severly hampered by failed systems)\r\n\r\n - Went to the moon in the heat of the anti-war turn in the Vietnam war (buy off the people)\r\n\r\n - Stopped going at the end of the Vietnam war\r\n\r\n - Its almost unprovable to refute\r\n\r\nI hope we went to the moon but Groom Lake might be what we are looking at hehe.  I want to believe it but you have to have an open objective mind about these things and look at motive first of all. We can spot a Rover on Mars from a surveyor, can't we check on our landing spots?\r\n\r\nI am awaiting the results of this probe on the moon, no sign of anything just yet...\r\nhttp://www.msnbc.msn.com/id/7091082/","controversiality":0,"score":4,"ups":4,"author_flair_css_class":null,"created_utc":1165914637,"subreddit":"science","timestamp_epoch":1566236767,"message_id":"24401-0767b563-5df5-4965-b9eb-da22e97a1f41-1566236767"}