{"edited":false,"id":"cuk3t","parent_id":"t1_cugsd","author":"johnbentley","author_flair_text":null,"retrieved_on":1473808383,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_tq6l","subreddit_id":"t5_6","body":"Many thanks for your response.\r\n\r\n&gt; To be blunt, you have a narrow mind about this topic.\r\n\r\nNo. Not just narrow but closed. That is, I will not hold a belief just because I come across it, or others say I should, or it is comforting to believe it, but only because there are good reasons for supposing it true.\r\n\r\nBut I am also open to be shown that my belief wrong, should good reasons or evidence come to my attention.\r\n\r\n&gt; In fact, you're imposing your own moral view on a diety.\r\n\r\nIt's not just my moral view. Would a morality based on the Rabbinic literature or Christian bible permit me, on whim, to inject a virus into a child that may cause Encephalitis?\r\n\r\n&gt; If each emotion or ability were to be a set where the members of that set were beings that displayed that emotion or had that ability, God would be the only member of all sets simultaneously. If a human were to be in just two opposing sets, we'd consider that person to be a walking contradiction, or a hypocrite. \r\n\r\nNo we wouldn't. If set A is Joy (emotion), and set B is skiing (ability), a person can be in both sets, at the same time, without contradiction nor hypocrisy.\r\n\r\nWhether a common definition or not suppose we where to define a hypocrite as a being who professes one moral belief but acts against the belief. A useful definition because the phenomena is common. If a person says that we ought not, for moral reasons, cause pain to someone on whim, and then causes pain to someone on whim, then we would call them a hypocrite.\r\n\r\nWhether someone is a hypocrite or not, anyone who causes pain to another on whim, is acting immorally. So if someone believed that causing pain to another, on whim, is morally OK, and does this (causes the pain), then they would still be doing something immoral. Even though they are not being hypocritical.\r\n\r\nMore, hypocrite or not, you could cause pain to someone you have kidnapped and at the same time call up Oxfam and donate money to save lives. You could be wonderful and terrible at the same time. \r\n\r\nNevertheless the terrible thing that you do is immoral.\r\n\r\n&gt; But it's one of the great paradoxes about God, that God can be both wonderful and terrible at the same time.\r\n\r\nSure, such a god like this could exist, just as many humans do exist like this. But such a god could not be (morally) good in the sense of moral goodness that the Rabbinic literature or Christian bible is taken to prescribe for us. \r\n\r\nYou'd have to understand, then, there to be two sets of moral goodness. One for us and one for god. If what is good for god whatever she decides is good, or whatever she acts, then she is all good. But she is also very whimsical, and an utter cunt, by the standard of good alleged to be set for us by the cited religious texts or the (partly in common) standard of good one can grasp just by thinking things through (standing on the thoughts of others throughout history).\r\n\r\n&gt; I hope I'm not wasting my time in explaining this to you.\r\nThat depends on whether your purpose in explaining this is to teach me or teach yourself.\r\n\r\nThere is something interesting to the idea of not naming something. For example, it is a tangential point, I'm contemplating dropping the need to speak of \"Love\". Rather one just acts it rather than express it.\r\n\r\n&gt; That's why your neighbors don't name your kids- they're your kids (implying some sort of posession), so you name them.\r\n\r\nFor the sake of your (real or hypothetical) kids I hope you where speaking very loosely. I hope you don't think of possessing your kids. I hope a phrase like \"my kids\" denotes relationship rather than ownership.\r\n\r\nEnjoyed your link to the picture.","controversiality":0,"created_utc":1165925695,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","timestamp_epoch":1566236767,"message_id":"24586-34620c35-8cb4-4f48-b0b1-9ca2132cb74f-1566236767"}