{"author":"vasile","author_flair_text":null,"parent_id":"t3_ufsk","id":"cuk8d","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808386,"controversiality":0,"body":"I will attempt to explain why people in XV or XVI century thought as they did.\r\n\r\nUntil the XIX century, the culture was highly influeced by the christian thinking, and this is especially visible in art, since there are so many Bible-based paintings and sculptures dating back then. People generally had a uniform view of life, that is, they believed that human is created in the image of God, and this was the general pattern of thinking. Even if they were not necessary christians, the understanding of life and its different domains was not based on a darwinian framework of thinking, people had a very strong and well defined \"common ground\".\r\nWith the advent of the Big Bang to molecule to man evolution, this foundation was lost, and people have rebuiled the cathedral of thinking, reevaluating each and every area of knowledge, and removing the Bible-based assuptions.\r\nIt was a big paradigm shift, from the \"there is only one truth\" to \"there are many individual subjective truths\", or, even worst, \"there is no absolute truth\", or more commonly \"there is no absolute good\".\r\nIn this sense, people do not pursue their artifacts the way people in other centuries did.\r\nIn my comment I do not try to justify the concusion of Mr. Graham, but to explain why (most) people paint like they do it now. It is because they don't create things inspired by a same God or His creation, thus leading to a unified kind of artifacts creation, but instead they search the inspiration within themselves, thus being more difficult for a wide range of people to find the same sense in an artwork, because of the divergence of individual experience and understanding of life.","subreddit_id":"t5_6","link_id":"t3_ufsk","stickied":false,"subreddit":"reddit.com","ups":1,"score":1,"author_flair_css_class":null,"created_utc":1165928528,"timestamp_epoch":1566236767,"message_id":"24636-96dd4c48-0032-463d-9e46-ef2655d11c9d-1566236767"}