{"distinguished":null,"retrieved_on":1473808388,"gilded":0,"parent_id":"t1_cuhoa","edited":false,"id":"cukfr","author":"rodelrod","author_flair_text":null,"score":3,"ups":3,"created_utc":1165931522,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_uga5","body":"&gt;In our eco-friendly world we say \"wow, a city built for no \r\n&gt;cars\" and think it's great, but the reason it wasn't built \r\n&gt;for cars wasn't because they were great urban planners, it's\r\n&gt;because there were no cars.\r\n\r\nThat may be true, but is \"*why* they did it\" the real question? The fact is, my life today is much better because they *did*.  Yes, my car stays on a garage outside the city most of the time; yes, I walk or skate or bike miles every day (not that I have to, the public transportation system is great); yes, the native Parisians are probably the most arrogant, presumptuous and unfriendly people on the planet; yes, I wound up living in a 17th century building (you can see it in the photo, how cool is that?) where water drips on your head while you're sitting on the loo minding your business (not so cool); but life is just so much better...\r\nI do agree that city planning often leads to disaster, especially when large scale political projects are involved.  I wouldn't overemphasize Haussmann's role in the Parisian cityscape. Although it was probably the most important single intervention, it's far from explaining the success of Parisian urbanism. It wasn't him who built the old churches and palaces, nor did he shape the curves of the Seine, nor the small streets of the Marais and Montmartre. Especially, the system of many self-subsistent neighborhoods, each with its character, makes living in the city a real pleasure. Haussmannian rules add an overall structure and consistency that make these elements work together. \r\nOh, and the car is a vastly overrated mean of transportation and it doesn't belong in an inner city. Period.","controversiality":0,"timestamp_epoch":1566236767,"message_id":"24711-1a351ed6-f371-49e7-80a6-f8c2fc8fd2df-1566236767"}