{"subreddit":"programming","created_utc":1165935375,"author_flair_css_class":null,"score":7,"ups":7,"body":"It's true, you absolutely need to see what's going on below the decks of do-notation in order to really understand. I don't really mind introducing it fairly early to beginners though, because it does actually do a decent job of explaining one major way to think about monads as a form of sequencing computation. It is easy to mislead people this way though, if one isn't very careful to explain what is going on.\r\n\r\nThere's also no one-true-way of thinking about monads. My [Monads as Containers](http://haskell.org/haskellwiki/Monads_as_containers) article describes another way to look at things, which works sometimes better for things like List, Maybe, various Tree monads, and even Reader, and eventually with more computation-like monads (State, IO) if you stretch your brain enough.\r\n\r\nReally, what you're dealing with is a couple of combinators which occur in a bunch of combinator libraries, and satisfy a basic set of rules no matter which library you're working with. They're also polymorphic, so that things can be written which work across all of those combinator libraries, and will have related, but different results in each. (I'm thinking of all the stuff in Control.Monad)\r\n\r\nMost people don't know much about combinator libraries, so that view isn't a useful starting point, and by the time one has had a chance to see a bunch of monadic libraries, the idea of a combinator library should be fairly clear anyway. One of the major steps in learning monads for me though (where I started to really get a foothold early on) was in learning [Parsec](http://www.cs.uu.nl/~daan/download/parsec/parsec.html) since the idea there is different enough from ordinary sequential computation to perhaps act a bit like a Zen koan and wake up your senses to the abstraction that's taking place.","controversiality":0,"stickied":false,"link_id":"t3_ujjo","subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473808393,"distinguished":null,"author":"cgibbard","author_flair_text":null,"edited":false,"id":"cukoh","parent_id":"t1_cuk37","timestamp_epoch":1566236767,"message_id":"24828-c52bd4ea-ac21-482b-b560-4478ad42fd08-1566236767"}