{"id":"cul9j","edited":false,"parent_id":"t3_28041","author_flair_text":null,"author":"Sarge88","distinguished":null,"retrieved_on":1473808404,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_28041","stickied":false,"controversiality":0,"body":"This passage from your “How to do what you love” essay is brilliant, to wit: \r\n\r\n“Constraints give your life shape. Remove them and most people have no idea what to do: look at what happens to those who win lotteries or inherit money. Much as everyone thinks they want financial security, the happiest people are not those who have it, but those who like what they do. So a plan that promises freedom at the expense of knowing what to do with it may not be as good as it seems.”\r\n\r\nMost people can’t understand your statement because they’ve never had access to enough wealth to experience this counterintuitive phenomenon.  For someone stuck in a dead-end existence with (seemingly) limited control over decisions and desires, the allure of financial security is strong.  Financial security offers the promise of at least “buying” the life of one’s dreams especially if you are not quite sure what your dreams are.  \r\n\r\nMost don’t believe that (as you have stated in another essay) “idleness is lonely and demoralizing” if you possess the trappings of affluence.  The thought is, “If I could just do anything I want, then I would…….”  To viscerally understand this point, you really do need to have experienced affluence at least for a significant period of time.  Otherwise, statements such as “money does not buy happiness” appear to be lies uttered by rich people while sipping sour apple martinis at the pool.\r\n\r\nOur American mythology includes the holy grail of “striking it rich” (by any means possible) and then living “happily ever after,” as if all one required in this world to achieve happiness and peace is affluence.  Unfortunately for the lottery winners and similar lots, the “happily ever after” never comes.  \r\n\r\nMy instinct is that the empirical data will support these claims.  Take a look at our society and one sees that the problems associated with affluence abound.  “Rich” kids tend to have higher levels of drug/alcohol problems and issues with anxiety and depression than their poorer peers. Why?  Because once material needs at met in abundance, life in general takes on a different perspective.  The downside of affluence may influence the following type of thinking:  “now that I am constrained by nothing, what the hell do I do?”  \r\n\r\nThe fear of poverty, for example, is no longer a motivator.  Also, the internal longings for a more meaningful existence are easily brushed aside by the myriad distractions that affluence can provide. \r\n\r\nIn simpler terms, it’s just easier not to participate in the struggle of discovering what you love to do.  If physical and material needs are met in spades, then talking about pipe-dreams and “what might have been” becomes a preferred path of least resistance.  This truth is axiomatic now that a drunken or drug-abusing child of a prominent family has become cliché; take a look at the progeny of the Kennedy clan, for example.\r\n\r\nOver the years, I’ve seen people pining for riches quite frequently.  Such people speak of money in a lustful fashion believing that it is the panacea to all their ills.  Unfortunately, it’s not.  In fact, material wealth in a vacuum is probably more of a hassle than its worth.\r\n\r\nI think that what we most crave and admire is skill and purpose rather than wealth.  Wealth is often created by skill and is can be the evidence of skill.  People don’t go to baseball games, for example, because they want to catch a glimpse of a bunch guys who are fantastically rich.  They go because they are in awe, and rightfully so, of the prodigious athletic skill and talent they see on the field of play.  \r\n\r\nIt’s the skill and ability that we admire, and the easier it appears from the outside, the more we admire it.  Skill that creates vast wealth is like catnip to the human race.  We find ourselves worshiping that which we cannot do or achieve ourselves.  And the “playing fields” are multiple. People admire a vast array of talents and skills from intelligence to athleticism, but the emotional response is the same.\r\n\r\nClearly, there is an aspect of unfairness here, if you are someone naïve enough to believe in the concept of fairness.  Does Manny Ramirez of the Red Sox, a $20 million guy, contribute so much to society that he deserves $20MM annually?  The question is really irrelevant.  The market creates the demand and those skilled enough to fill the demand get rewarded.  \r\n\r\nUltimately, however, everyone in society ultimately benefits from the skill and genius of others.  Society has been proof of this fact since the dawn of civilization, and the evidence is everywhere.  Technology, medicine, real estate, entertainment, etc.  Don’t we all still benefit from the inventions of Thomas Edison?\r\n\r\nYes, there are millions to who do more “good” for society than Manny Ramirez and are just barely eking out a living.  But there are millions who are afforded great joy by watching Manny perform.  It makes them feel good.  It allows them to stretch their imagination regarding human potential.  Is this fair?  \r\n\r\nI have enjoyed your essays…keep’em coming.\r\n\r\nJohn S.\r\n","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165943266,"subreddit":"reddit.com","timestamp_epoch":1566236767,"message_id":"25116-2bd70ab8-877e-41ca-b78b-0775a44949d0-1566236767"}