{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_ul2v","body":"Anyone that utilizes the television for anything other then pure entertainment is a fool. The main stream media does a horrible job of portraying the issues (and the news).\r\n\r\nThe Internet is the only viable source for real information, but a great deal must be read and waded through.\r\n\r\nBut \"voting\" in this country is a friggin joke. Anybody that doubts this should simply examine the choice of candidates we are \"permitted\" to choose from. Why would someone spend millions of dollars for a $150,000 job?  This is called \"democracy\" by the way - pay as you go and play the game.\r\n\r\nThe sad reality is, the American people have absolutely no control over their political processes, absolutely none. The Democratic \"win\" is utterly meaningless (just watch, it will be business as usual).  It always is.  Faces change, but the game doesn't.\r\n\r\nSo no, it's not important if you vote.  Not even. Voting gives credence to a system that is now horribly broke.  Voting implies that you believe that the system works.\r\n\r\nIf it works - prove it.\r\n\r\nBecause it doesn't work.  Congress does not listen to the people, and neither does the Senate. These scum believe their job is to lay even more onerous burdens on the backs of the people, passing even more laws.  The gargantuan amount of crap they shove down our throats is unbelievable.\r\n\r\nIt's time to disband this failed experiment of a Republic (it was never a democracy, but few Americans realize this fact) and start over.  Voting will NEVER change our political processes because there is no vested interest in listening to the will of the people. The corporations own our government, which is why these scum will rake in millions for their political campaigns to take a $150k year job.  You have to be a fool to believe anything else.\r\n\r\nRebel.  Withhold your vote.  Reserve your right to refuse to participate in this monstrosity of a government that would rather kill you then help you.","controversiality":0,"score":-1,"ups":-1,"created_utc":1165944191,"author_flair_css_class":null,"subreddit":"reddit.com","id":"culca","parent_id":"t3_ul2v","edited":false,"author":"lifeofliberty","author_flair_text":null,"distinguished":null,"retrieved_on":1473808405,"gilded":0,"timestamp_epoch":1566236767,"message_id":"25143-e0170a18-f1c7-492f-b541-bdc2b937afa4-1566236767"}