{"gilded":0,"distinguished":null,"retrieved_on":1473808405,"author_flair_text":null,"author":"crake","id":"culd8","edited":false,"parent_id":"t1_cujlr","subreddit":"reddit.com","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165944554,"body":"This isn't the point of the article.  The point of the article is that millions of Americans believe that 9/11 was a conspiracy carried out by the U.S. government--whether that belief is grounded in fact is not germane to the debate presented by the article.  The article is asking why, if so many people believe the government is run by mass murderers, is there no popular outcry?\r\n\r\nI agree with TheNoxx on all three points.  I would add to this a fourth point:\r\n\r\n4.) Debt.  Many of us are students. Many are graduate students.  Some of us are professional students.  But we all have debt.  College is enormously expensive now and most of us are deeply in debt to the government and private lenders, some to the tune of 100k. I know that I, for one, have to work every free minute that I'm not in school just to make ends meet (pay loans, pay car insurance, pay healthcare, etc.) Maybe that's because I have a crappy job, but I think that most young people are in the same boat with me.  We don't have time (TheNoxx's point #1) to be revolutionaries.  We can't risk our livlihood to be revolutionaries. Those of us who are still students can't risk our assistantships or funding to be revolutionaries.  The leadership of this country has been snatched from the intellectuals and given over the lower classes and the super rich (see US Congress, Presidency, Governorships, State Legislatures, etc).    This is why we have members of the Armed Services Committee who can't tell us if Al Quaeda is Sunni or Shiite; the people who could answer that question are a few years out of college, living with their parents, and working 2 jobs to pay the minimum on outrageous loans.  \r\n\r\nI would add that as a corollary, the quality of the US leadership has slowly degraded over time and we have now hit rock bottom.  We may laugh when Colbert has a blustering idiot congressman from Georgia crowing about the 10 Commandments (which he doesn't even know) and basically struggling to even enunciate a coherent thought, but THAT man is a US Congressman, making decisions that impact the entire country, while we are sitting in our basements/cubicles laughing at him and doing nothing.  The best have been consigned to menial tasks and full/overtime employment in the wonderous \"service\" economy.  We've all made our Faustian bargain and now our country is going to fall while we collect our measly paychecks and hand them over to Citibank.  \r\n\r\nIronically colleges destroyed the United States by getting too greedy and failing to produce leaders.  Those who go on scholarship become ibankers and engineers, seduced by the almighty dollar and content to see the country fall as long as they're enriched in the process.  Those who go to study history, art, literature, etc. and actually have the intellectual acumen for original and/or selfless political thought and action are left to become middle-level managers and sit in a cubicle all day.  They're made to feel worthless because of their small paychecks and left to post on Reddit and Slashdot while people like George W. Bush and Dick Cheny make the world-shaking decisions.  The intellectual class has been neutered by modern society and is damn near extinct or at least freightfully deep in hiding.  \r\n\r\nGovernment has become the province of the telegenic know-nothings who are all polish; substance is irrelevant to the modern 30 second news clip.  It is only going to get worse as Republicans further gut education and redistribute wealth to the super rich, who do not care about \"their\" country whatsoever in a global world in which they can live anywhere and nowhere.  The middle class is dead and impoverished, the lower classes are placated with gay marriage amendments and stem-cell bans and hypnotized by mass religion into ignoring real issues and instead eating up nonsensical bs fed to them by the ruling plutocracy. Intellectuals hide in their cubicles and basements as Rome falls all around them.\r\n\r\nEventually an outside power will realize how weak the US really is and will invade and defeat it.  The noble experiment of American democracy didn't end in a flourish of revolution or the institution of dictatorship, it was slowly strangled by greed and crumbled brick by brick.  Hundereds of years from now historians will wonder how such a powerful empire could collapse, much as we speculate about how Rome could have collapsed. They'll speculate about why at the beginning of steep decline men sat around and did nothing.  And here we are.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_uhc0","stickied":false,"timestamp_epoch":1566236767,"message_id":"25158-97a228ed-ef1a-43df-a335-fc04ef8429b8-1566236767"}