{"distinguished":null,"retrieved_on":1473807448,"gilded":0,"edited":false,"id":"ct6an","parent_id":"t3_t5zc","author_flair_text":null,"author":"lifeofliberty","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1164937961,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_t5zc","stickied":false,"controversiality":0,"body":"In the last few days, since I've been reading on police corruption, I came across other websites that posted pictures of dirty cops, lawyers and their ilk.\r\n\r\nBut I won't post the link.  I think this is a *good* idea.  Letting these scum work in the dark prevents us from knowing about their crimes.\r\n\r\nThis reminds me of \"Assassination Politics\" (look it up), which was an interesting idea on how to effectively remove such dirtbags.\r\n\r\nUnfortunately, the guy who penned it got arrested.  Seems like the status-quo defenders didn't like the citizenry to act for themselves.\r\n\r\nThe irony of the article however, is that when our checks and balances in our judicial system no longer work, the people have no options left except individual action.  The article implies that the State is \"afraid\", as if this is wrong somehow, but it's as it should be, at all times.  As our servant, the State and its agents should be answerable to the people.  And when it stops answering to the people (like now), then the people have the right to rebel against it's overarching \"authority\".\r\n\r\nCooperating with the police (in my *experience*) has proven to be disastrous (at any level), but everybody else may have a differing opinion or experience.  I see no problem with exposing informants either.\r\n\r\nThe very fact that they are going after Bucci say's that they refuse to be \"intimidated\", although that's **exactly** the principle and operating factor utilized by the State thugs.  The duplicity is however, lost on them.\r\n\r\n*\"While prosecutors haven't pointed to a case where a witness or officer was harmed because of the Web site, it has been used to shatter an undercover agent's anonymity.\"*\r\n\r\nThis is noteworthy.  There is **no proof** of harm caused by revealing who these thugs are.  And the entrapment operations utilized by undercover agents absolutely sucks.  But it's okay if the *State* does it, just don't **you** try it.  The double standards are amazing.","timestamp_epoch":1566236758,"message_id":"253-60b9b057-d8fa-4d98-87a1-1c2f4aee0f77-1566236758"}