{"subreddit":"programming","author_flair_css_class":null,"created_utc":1165950402,"score":4,"ups":4,"controversiality":0,"body":"&gt; &gt; In the long run the language that makes libraries easier to write\r\n\r\n&gt; But the advocates of Lisp would argue that it's the most powerful language\r\n\r\nI think it is both true that lisp is more powerful than other types of languages (so far, that I've seen, etc), *and* that lisp (Common Lisp, at least) does not make libraries easier to write.\r\n\r\nMaking libraries easy to write is not about language power, though power is good.  Rather, it's far more important to increase the liklihood that a library which actually *is* written is well-written.  Libraries should expose the functionality most useful to a library-user, and hide the functionality which is only important for implementing the exposed portion, while not using stupidly slow techniques for doing the work.  \r\n\r\nA language can be, at the same time, better for doing complex work in, and worse for writing generic tools.  Apart from power, an important aspect of languages for libraries is obviousness.  \r\n\r\nIf most developers who use a language would come up with almost the same interface, it's clear what interface to use (unless that interface is hideously wrong, but that would be a problem with the language itself, I'd think).  If there are a lot of equivalent ways to do something, and any particular developer just has to pick one, then that has its own benefit, as it's clear that there's no reason to expect a library to conform to one's expectations.  However, if there are a lot of apparent ways to do something, and the vast majority of them are wrong ways, that language is probably poor for writing libraries in, quite separately from its power as a language.  \r\n","link_id":"t3_ujjm","stickied":false,"subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473808415,"distinguished":null,"author_flair_text":null,"author":"randallsquared","edited":false,"parent_id":"t1_culoe","id":"culu7","timestamp_epoch":1566236767,"message_id":"25363-ff8bb404-a1ee-4249-9a46-f012c4410334-1566236767"}