{"subreddit":"reddit.com","score":1,"ups":1,"created_utc":1165953825,"author_flair_css_class":null,"controversiality":0,"body":"&gt; but if he doesn't spend a good chunk of each day with them, then he'll be an outsider.\r\n\r\nOh, horrors.  Like that doesn't happen to smart kids WHO STAY IN SCHOOL every. Fucking. Day.\r\n\r\n&gt; It would allow him to explore various interests, without the clock ticking on a degree program.\r\n\r\nThat's good regardless of age.  There's no reason why a degree program is appropriate at 18 but not 11.  In fact, it is much MUCH easier to concentrate before you hit puberty.\r\n\r\n&gt; Problem is, he may be wasting his time at Uni. It says he wants to be an astronaut, or a veterinarian, or study mass communications. It sounds like he doesn't really know what he wants to do.\r\n\r\nWhich puts him in exactly the same boat as the majority of college students.  He fits in more, not less, because of this.  Assuming he graduates at 15, it's not like his life is over!  He can do normal teenage stuff, waste time, or go into some other college program.\r\n\r\n&gt; There are many ways to do meaningful projects without skipping a bunch of grades.\r\n\r\nGetting out of grade school gives you that time, which you can use to do whatever -- including going to college.  Check it out, at 15 with a degree, he'll have 7 extra years to mess around.\r\n\r\n&gt; Just because it could be worse, doesn't mean it's good.\r\n\r\nI dispute that it's \"Bad\" at all!  Grade school was mostly an exercise in wasting time for me.\r\n\r\n&gt; In any case, have you been through it? I have.\r\n\r\nYep.  Same age as you.\r\n\r\n&gt; I would have gotten much more out of school if I had been more mature.\r\n\r\nI don't know about you, but when I was 15 I was much more mature than my friends of the same age.  Now that I'm old I've regressed!  Yippee.  \r\n\r\nIn my experience, *most* of the people who went to high school normally are unprepared for college because of the 4 years of stultifying babysitting.\r\n\r\nI would NEVER send my kid to high school early, because it's a ridiculous place.  But college is a whole different deal.  It is way, way, way more relaxed and a much better place for someone to be who doesn't fit in socially than high school is.\r\n\r\n&gt; High skills take time, effort, and experience to develop, in addition to aptitude. Prodigies demonstrate aptitude, but they won't come into their full abilities until they've also been seasoned.\r\n\r\nProdigies demonstrate *ability*.  A musical prodigy, a chess prodigy, a mathematics prodigy, all these demonstrate skill and understanding in the subject.  That's how you know they are \"prodigies\".\r\n\r\n&gt; Why rush that process?\r\n\r\nWhy hold them back?  If I'm 11 and very interested in programming, and can go to an \"Advanced\" course, I want to do that -- not be told by Mom, \"we're waiting until you're older to let you use your brain\".\r\n\r\n&gt; When Richard Feynman got bored at school\r\n\r\nThe radios he was interested in regardless of school.  He also would go to the library to check out advanced math texts on his own.    You can't rely on others to find out what your own interests are.\r\n\r\nAnything you do is a trade-off.  You will miss out on social time if you are very busy with *anything*.  To me it's an acceptable one; to others, it may not be.  Of course, you have to remember he was going to Daddy's private school so he may not have had tons of 11-year-old friends beforehand anyway.  When I was that age my friends and I would actually visit each other in what we called our parents' \"houses\", which exist outside of school.\r\n\r\n","subreddit_id":"t5_6","stickied":false,"link_id":"t3_uhfb","gilded":0,"distinguished":null,"retrieved_on":1473808420,"author_flair_text":null,"author":"lemmikins","edited":false,"id":"cum2m","parent_id":"t1_cuj7p","timestamp_epoch":1566236767,"message_id":"25494-fc84417f-6757-4859-9119-393d24fc0783-1566236767"}