{"gilded":0,"distinguished":null,"retrieved_on":1473808433,"author_flair_text":null,"author":"Stani","edited":false,"id":"cumv8","parent_id":"t1_cui69","subreddit":"reddit.com","score":3,"ups":3,"created_utc":1165965322,"author_flair_css_class":null,"body":"I looked at the two examples you quoted. Regarding the first:\r\n\r\n&gt;British banks are banning piggy banks because they may offend some Muslims\r\n\r\nNo. The story about British banks banning piggy banks is untrue, according to [this article from ABC](http://www.abc.net.au/mediawatch/transcripts/s1494636.htm).\r\nFrom this article, titled \"PC Piggy or Hogwash?\" :\r\n\r\n&gt;\"**There is absolutely no fact in the story**. *We simply had a UK wide savings marketing campaign, which included pictures of piggy banks, running until the end of September.\"*\r\n\r\n&gt;*\"Piggy banks have been and will continue to be used as a promotional item by NatWest.\"*\r\n\r\n&gt;— [Email from Caroline Harris, Media Relations, NatWest](http://abc.net.au/mediawatch/img/2005/ep35/natwest.pdf)\r\n\r\n&gt; &amp;nbsp;\r\n\r\n&gt;\"*It appears as though this is* **purely a silly season story** *... Although it is disappointing to see, we are realistic enough to know that no damage has actually been done.\"*\r\n\r\n&gt;— Email from Mark Hemingway, Group Communications Manager, Halifax\r\n\r\n&gt; &amp;nbsp;\r\n\r\n&gt;\"*Halifax has* **not withdrawn any piggy banks** *from branches. As a matter of fact, we have not used piggy banks in our branches for a number of years.*\"\r\n\r\n&gt;— [Email from Paul Fincham, Halifax Press Office](http://abc.net.au/mediawatch/img/2005/ep35/halifax.pdf)\r\n\r\n---\r\n\r\n---\r\n\r\nRegarding the second example you quoted:\r\n\r\n&gt;A West Yorkshire head teacher has banned books containing stories about pigs from the classroom *in case* they offend Muslim children.\r\n\r\nThis is, IMHO, a bizarre case where a teacher took it upon herself to ban stories with pigs. She does not say that she did this in response to any complaints from Muslims  &amp;mdash;  apparently, she didn't even consult any Muslims before unilaterally removing pig stories from the curriculum. From [another report about the same incident](http://www.thesun.co.uk/article/0,,2-2003100517,00.html) :\r\n\r\n&gt;A school has banned the Three Little Pigs story from classes — *in case* it offends Muslims.\r\n\r\n&gt;The school insists any talk of pigs is offensive to Muslims who make up 60 per cent of the 250 pupils.\r\n\r\n&gt;But leading Muslims yesterday said there is *nothing in their religious rules to stop children READING about pigs.*\r\n\r\n&gt;The ban at Park Road Junior Infant and Nursery in Batley, West Yorks, was discovered when a parent saw words relating to pigs had been removed from a homework sheet.\r\n\r\n&gt;Another fuming parent said: “I’ve never heard of anything so ridiculous. It is absurd.”\r\n\r\n&gt;Head Barbara Harris said the books had only been removed from classes for under-sevens and were still available in the school library.\r\n\r\n&gt;But Inayat Bunglawala, of the *Muslim Council of Britain*, said: “This is **bizarre** — there is *nothing* to stop children reading about pigs. The ban is simply on the consumption of pork and pig products.”\r\n\r\n&gt;Religious leader Shaykh Ibrahim Mogra added: “It is rather sad. Muslims would *not* find the Three Little Pigs offensive.”\r\n\r\nMore [from the Muslim Council of Britain](http://www.mcb.org.uk/library/07-06-05.php) :\r\n\r\n&gt;a school in Batley, West Yorkshire made national news after the head-teacher, sent a memo to her staff instructing them to not use books featuring pigs when teaching the under-seven classes in her school where two-thirds of the children came from a Muslim background. The reason the head-teacher gave for her action was that *she believed* the books \"*might* have caused offence to religious sensitivities.\" Now it is true that Islam forbids the consumption of swine-flesh - except in the most extreme circumstances - however, there is no Qur'anic authority whatsoever to prohibit the portrayal of pigs.\r\n\r\n&gt;As a child I recall being charmed by the tale of Charlotte's Web featuring the shy pig, Wilbur, and the little girl who tried to save him from the usual fate that awaited fat little pigs. As I grew older I read and then often re-read George Orwell's Animal Farm with its salutary lesson about the idealistic pigs who take over the farm and then begin to assume ever increasing dictatorial powers over the other farm animals. Preventing kids from reading about these pigs and discovering these characters seemed simply **bizarre**.\r\n\r\n&gt;In the end, the Batley head-teacher's well-meaning but misguided initiative had the *opposite effect* from that intended. Her intentions had been quite noble. Yet she had inadvertently managed to stir up anger towards precisely the same minority groups that she had tried to show consideration for. The whole damaging episode might have been averted had some contact been made with the local Muslim community and their opinions sought. They would have quickly disabused the head-teacher of the *mistaken* notion that pigs are not halal/kosher story material.\r\n\r\n&gt;The head-teacher's action seemed to fit into a worrying pattern where others would decide what was or was not offensive to minority groups.\r\n\r\n---\r\n\r\n---\r\n\r\n(Textual emphases are mine throughout)\r\n\r\nMy personal feelings are that we Muslims mostly don't want special treament  &amp;mdash;  whether it's patronizing \"affirmative action\", unreasonable political correctness, or profiling based on false stereotypes and broad generalizations.\r\n\r\nIn conclusion, neither example provides evidence of Muslims being offended by portrayals of pigs  &amp;mdash;  on the contrary, Muslims have been more concerned about an anti-Muslim backlash as a result of reports like these, which are fodder for the LGF crowd and other islamophobes.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_ugjk","timestamp_epoch":1566236767,"message_id":"25874-37ab10e0-dbe3-48f8-984f-1a33db4bf076-1566236767"}