{"created_utc":1165988879,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_ul6o","subreddit_id":"t5_6","body":"yeah, you speak from an idealist stand point -- and all that shit I read in first year economics and globalization. Too bad the world isn't ideal. First, people in these nations don't have the means by which to produce a good or service and sell it in a wealthy market. Therefore, corporations will always be able to offer a higher wage in an undeveloped nation. While it does produce some temporary wealth for the individual, the over all economy and infastructure is not bettered beyond what is necessary for the investing corporation(s) to achieve the lowest possible cost of production. The wealth generated in these nations is then piped out to foreign shareholders. The net result is a double-damn -- 1) the host nation just lost the majority of the wealth generated in the nation to foreign investors. 2) the host nation had just wasted its human and resource capital on t-shirts and other shit for foreign consumption, instead of developing a domestic economy. The end result is systemic poverty, where the host nation continues to offer cheap labour to full a foreign economy with BOTH profits and goods. I believe following the economic strategies of Spain (post-civil war), New Zealand (post-globalization experiement), or even China (presently) to be more prudent. All of which have taken a heavy hand regulating FDI and built  successful economies. \r\n\r\nHere is a perfect example of how a corporate controlled economic strategy fails. (which is repeat around the world)\r\n\"But they can't avoid helping people by employing them for more than farm wages.\"\r\nUnder pressure from the corporations offering factories and a fast buck (and often kick backs) the governments deregulate trade and another nation is championed into the globalist model. Jobs are offered above the average wage to attract workers. The works leave their job in there economy and start working for the Western (or whomever is buying the shit) economy. They are paid by Western corps, their work goes to Western nations and the profits go to Western shareholders. They no longer contribute to their own economy beyond the earnings they spend. But, here is the kicker. The deregulated trade now allows foreign companies to dump food on the market  and the people obvious buy the cheapest food... they are poor. Now the earnings which would have been spend on the domestic market is spent on the foreign market and the increased wages are exported out of the country. This no only means that those wages will not help the domestic economy, but also that the domestic economy is trashed by falling revenue. The farmer sells his land to Cargill (gawd I hate Cargill), the cobbler sells his storefront to Nike, etc. The end result is a form of colonialism where the nation's economy is not focus on building itself, but rather it is focused on supporting a foreign economy. \r\n\r\nNow you can talk about how people should take the job that pays more... but the rich never got rich working for someone else. If David Henderson would like to argue that point with me... tell him I have a job for him, and it pays well. \r\n\r\n\r\n","controversiality":0,"retrieved_on":1473808456,"distinguished":null,"gilded":0,"edited":false,"id":"cuo1f","parent_id":"t1_cun8q","author":"Draracle","author_flair_text":null,"timestamp_epoch":1566236767,"message_id":"26455-2a67e5ee-a3f0-48dd-86f0-35b4abd164d6-1566236767"}