{"gilded":0,"retrieved_on":1473808457,"distinguished":null,"author":"ubernostrum","author_flair_text":null,"id":"cuo3e","edited":false,"parent_id":"t1_cuny0","subreddit":"programming","author_flair_css_class":null,"created_utc":1165989893,"ups":4,"score":4,"controversiality":0,"body":"I _have_ programmed in Lisp. And yet I'm using Python by preference ;)\r\n\r\n&gt; claiming that Factor has an integrated online help and Python doesn't, because for all I know, Python very well has integrated online help.\r\n\r\nIt does. And you'll see that he repeatedly asks about, for example, doctests. Does Lisp have something like Python's doctest module? I don't recall seeing anything, but I may have missed it. The best answer this guy seems to have gotten out of Lispers was, \"well, it'd be trivial to implement\".\r\n\r\nSo. Want to talk about social problems? \"We don't have it, but it'd be trivial to implement\" is a social problem. Lots of languages have communities which will help people find their way around the standard library or point people to useful third-party modules so they don't have to reimplement trivial stuff. Python folks will point you to the Cheese Shop. Ruby folks will point you to the gems. PHP folks will point you to PEAR. Perl folks can kick everyone's ass by pointing to the CPAN.\r\n\r\nAnd if there's no standard or third-party module available, odds are that people in every one of those communities will be happy to help you walk through the implementation, or maybe even contribute some code because it'll help make the language that much better.\r\n\r\nLisp? Lisp tells you it'll be trivial to implement, so why don't you get on that? \"Trivial\" is a naughty word. It's the word mathematicians use when they want to imply that something is beneath them, and that while lesser minds might want to dally over this, _their_ massive intellects can't be bothered with such piddly things as useful reusable libraries.\r\n\r\nBut that situation probably won't change anytime soon; too many prominent Lispers are stuck in 1960. There's no better example than the fact that, in 2006, Lisp still seems to think that acronyms for the contents of registers on the IBM 704 are excellent mnemonics for fundamental parts of a high-level language. Meanwhile, the rest of the wide world rolls on, borrowing the useful ideas and leaving everything else in the history books. And the Lispers sit around on c.l.l., patting each other on the back for being so much smarter than all those jerks who are actually getting things done.\r\n\r\nSo if you want to talk about social problems of Python (and yeah, we've got problems), hold up something other than Lisp to compare it to. Perl's probably the gold standard on the social language evangelism front, so why not try it for a change?","link_id":"t3_unxc","stickied":false,"subreddit_id":"t5_2fwo","timestamp_epoch":1566236767,"message_id":"26474-548b4323-3a1e-4237-baa5-f649da5e85f1-1566236767"}