{"stickied":false,"link_id":"t3_ums7","subreddit_id":"t5_2fwo","body":"Er. Not really.\r\n\r\nJust in the first tutorial:\r\n\r\n* The `CDATA` block is only needed in XHTML, only when XHTML is served as XHTML, and even then the version shown won't work. In HTML it's no good.\r\n* Doesn't use `var` to initialize local variables.\r\n* Recommends the `javascript:` pseudo-protocol as a way to embed JS in HTML.\r\n\r\nThat's three strikes.\r\n\r\nTutorial 2:\r\n\r\n* Drops parens off the call to a constructor with no parameters. Inconsistently (e.g., does `new String` in one place, but `new Image()` in another). Major bad style points.\r\n* Uses HTML attributes for event handlers.\r\n* Uses JavaScript to achieve effects best left to CSS.\r\n\r\nThree strikes again.\r\n\r\nTutorial 3:\r\n\r\n* Recommends \"faking\" an associative array by using a bare `Object`, rather than explaining that an object in JavaScript pretty much _is_ an associative array. Also leaves out object literal notation.\r\n* Still refuses to use `var` or really explain its significance, even when talking about variable scoping. That counts as two strikes in one.\r\n\r\nTutorial 4:\r\n\r\n* Uses a DOM lookup without assigning the results to a variable, but _does_ assign the `style` attribute of that result to a variable when it's unnecessary to do so.\r\n* More bad style: cramming things into one line, Perl-style, with no whitespace after the semicolons.\r\n* Still using HTML attributes for event handlers. And doing them in a way that won't work in XHTML (despite earlier presenting something which tried -- and failed -- to be an XHTML-compatible template for inline JS).\r\n\r\nAnd at this point I basically gave up. Throughout these \"great tutorials\", the author also refuses to use any consistent naming scheme for variables; sometimes they're camel-case, sometimes they use underscores, and sometimes they're just words smooshed together (like those one-liner statements that are everywhere).\r\n\r\nIf this is how people are supposed to learn JS nowadays, \"Web 2.0\" is screwed.","controversiality":0,"created_utc":1165991862,"author_flair_css_class":null,"score":5,"ups":5,"subreddit":"programming","edited":false,"id":"cuo62","parent_id":"t3_ums7","author":"ubernostrum","author_flair_text":null,"retrieved_on":1473808459,"distinguished":null,"gilded":0,"timestamp_epoch":1566236767,"message_id":"26518-68c6c50a-0176-4668-ae6a-93032905c40b-1566236767"}