{"body":"&gt;There's a famous scene in the 1987 movie Wall Street in which Gordon Gekko, the corporate predator played by Michael Douglas, tells a meeting of stunned shareholders that greed is good, that the unbridled pursuit of individual wealth serves the interests of the company and the nation. In the movie, Gekko gets his comeuppance; in real life, the Gordon Gekkos took over both corporate America and, eventually, our political system.\r\n\r\n&gt;Oliver Stone didn't conjure Gekko's \"greed\" line out of thin air. It was based on a real speech given by corporate raider Ivan Boesky -- and it reflected what many corporate executives, conservative intellectuals and right-wing politicians were saying at the time.\r\n\r\nSo what he's saying is that the fictional Gordon Gekko went to prison, unlike the real thing. And that Gordon Gekko was based on Ivan Boesky. Apparently, he's forgetting that [Boesky went to prison](http://en.wikipedia.org/wiki/Ivan_Boesky). Is Krugman lying, or merely incompetent?\r\n\r\n&gt;Why isn't Wal-Mart unionized? The answer is simple and brutal: Business interests went on the offensive against unions. And we're not talking about gentle persuasion; we're talking about hardball tactics. During the late 1970s and early 1980s, at least one in every twenty workers who voted for a union was illegally fired; some estimates put the number as high as one in eight.\r\n\r\nSince when is it a 'hardball' tactic to not deal with someone who joins a coercive monopoly? That's really all a union does and all it ought to be thought of: a cartel of self-interested individuals who artificially manipulate prices for their own benefit. If that's 'hardball', then I'm playing 'hardball' with OPEC when I bike and take the subway.\r\n\r\n&gt;Third, the administration effectively blocked what might have been a post-Enron backlash against self-dealing corporate insiders. Corporate scandals dominated the news in the first half of 2002 -- but then the subject was changed to the urgent need to invade Iraq, and the drive for reform was squelched. With Americans focused on the war, CEOs are once again rewarding themselves at impressive -- and unprecedented -- levels.\r\n\r\nHuh? We invaded Iraq to avert the passage of bills like Sarbanes-Oxley (it passed). By the way, Sarbox didn't just react to the scandals, it *overreacted* (if you're willing to believe a thuggish, plutocratic theocon like [Nancy Pelosi](http://www.bloomberg.com/apps/news?pid=20601103&amp;sid=aybvu65TXavQ&amp;refer=us).","controversiality":1,"subreddit_id":"t5_6","link_id":"t3_unoz","stickied":false,"subreddit":"reddit.com","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1165996441,"author_flair_text":null,"author":"[deleted]","id":"cuod6","parent_id":"t3_unoz","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808462,"timestamp_epoch":1566236767,"message_id":"26614-f5e852ab-48ba-4c51-97fd-4c4de6372c9a-1566236767"}