{"retrieved_on":1473808466,"distinguished":null,"gilded":0,"id":"cuolh","edited":false,"parent_id":"t3_tvr2","author":"ech2os","author_flair_text":null,"created_utc":1166032072,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_tvr2","subreddit_id":"t5_6","body":"I don't know that statistics are the way to analyze this situation.  Fortunately, I have been able to work out visitation and finances with my ex.  The visitation isn't as much as I would like, but the finances are fair.  I have one daughter....The government would expect my contribution to be between 1100 and 1400 a month were we to go to court.  Fortunately, my ex sees this for the ridiculousness that it is.  Let's break this down.....let's split the difference of the above figures and say.........1250 a month.  Daughter is in kindergarten. No daycare expense.  Extra bedroom 200 per month (even though prior to getting together mother always had an extra bedroom anyways)  Insurance.  I pay that also. Food for 6 year old (150 per month) Clothing (50 per month) Babysitter (100 per month) Utilities (extra 50 per month) I am struggling to come up with more expenses.......but right now we are at and extra 550 per month.  If I am off by 50%, that brings the total to 825.  So if I pay 1250, I am paying for everything plus 425 a month for good measure.  I also do ALL the driving.  Doesn't sound like a lot, but my daughter is 50 miles away from me one way.  In Atlanta traffic, that sometimes takes me 3.5 hours to commute round trip.  Is my daughter's mother a headcase or a bitch........not even close.  But she, like a lot of mothers, tends to think everything is alright with the world because its easy to do that when you control everything.  She believes, and I am getting this through her actions not her words, that she and my daughter would be just fine if I just signed the checks and checked out.  That's because she is toooooo close to the situation.  You can't expect a 6 year old to look at her mother and say.......I think I need to spend more time with Daddy.  So if my daughter goes home and doesn't commuincate to her mother how much she enjoyed spending time with me or she thinks that if she tells mommy how much fun she had that she would be hurting mommy's feelings......you can see how the mother might think.....hmm......my daughter is just fine with just the two of us.  Meanwhile, deep down our daughter is torn apart and if I suggest it is good for everyone involved for my daughter to spend more time with me........I have no case because the mother only sees what she sees.  Anyways......I could go on all day about this, but I would say this.......there are just as many crazy women out there as there are crazy guys......and just because as one poster put......men might be more susceptible on average to certain types of behavior that lessens their credibility as a parent, doesn't mean there aren't a lot of women out there who although they may not drink, gamble, or carouse, negatively impact their childs growth and environment with other less than desirable characteristics.","controversiality":0,"timestamp_epoch":1566236767,"message_id":"26677-7495f9a6-9459-48ea-812d-dafe0ce7a76c-1566236767"}