{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166039905,"ups":3,"score":3,"controversiality":1,"body":"&gt;People who got rich through method X always advise method X, whether it's oil, marketing, cattle-raising, you name it.\r\n\r\nInterestingly enough, this isn't the case. Bill Gates doesn't say to get rich working in software like he did; he says to get rich by being really smart, working really hard, and being five years ahead of the rest of your competitors (which he was. He doesn't advocate ruthlessness, but that's a given).\r\n\r\n&gt;Your money is determined by how much of it, X, you get per \"customer\", times the number of \"customers\" who give it to you, Y. You can make the greatest widget ever and not market it well, and your \"value\" will be less, according to Paul, than if you make something crappy (imagine a scale from 0-10 where it's worth 0.00...something) but manage to sell it to a lot of people. \r\n\r\nWhich is valid so long as there's no relation between popularity and quality. There seems to be one, though, even if it's not perfect.\r\n\r\n&gt;The idea being that being a teensy bit useful to a million people is worth more than being hugely valuable to one person.\r\n\r\nWhich is true. Sam Walton made more money saving people 5 or 10% on their shopping than Eddie Lampert did (so far) earning high returns for the already-rich in his hedge fund. Why are you positing some relationship between maximum use for the ideal customer and total worth to all customers? Does this have any grounding in theory or fact, or did you make it up to bolster your argument?\r\n\r\n&gt;Unfortunately, measuring value in dollars breaks down when you give stuff away.\r\n\r\nI don't think he advocates measuring everything in dollars, but if you're going to say \"Money is a bad measurement of achievement,\" you ought to suggest a better standard. I can imagine that Linus Torvalds and Richard Stallman feel quite well rewarded for their efforts, even though they don't charge for their software (their reputations give them speechmaking and code-manging sinecures, anyway). So what's your measurement, and how is it more precise than money?","link_id":"t3_unoz","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808471,"distinguished":null,"author":"[deleted]","author_flair_text":null,"parent_id":"t1_cuods","edited":false,"id":"cuoux","timestamp_epoch":1566236768,"message_id":"26784-7562ed0f-54d1-435c-be63-abe19fd7c4c6-1566236768"}