{"created_utc":1166050306,"author_flair_css_class":null,"score":2,"ups":2,"subreddit":"reddit.com","stickied":false,"link_id":"t3_unoz","subreddit_id":"t5_6","body":"Which books would you recommend on Microsoft's history. I've only read a few (and some articles/interviews), so I'm not an expert, but I do know that the company has a knack for taking esoteric or academic ideas and turning them into consumer products. They sold Altair BASIC, bought a nice command-line interface to standardize, and pushed Windows out when most customers were unfamiliar with the 'window' concept. They weren't ahead on the internet, but they did turn the browser into something *everyone* got for free (keep in mind that Netscape's model was \"Let anyone download it, then announce that commercial use requires a license.\" Imagine if Reddit suddenly decided that there was a retroactive fee for all those 'submit this to reddit!' buttons).\r\n\r\n&gt;In dollars. But \"value\" is hard to measure, and we aren't objective about it.\r\n\r\nOnce again, you're using a comparative without comparing! Dollars are bad relative to *what*? Mass? MIPS? Half-life? Number of chromosomes? Genetic closeness to you? Genetic closeness to me?\r\n\r\n&gt;Because there is no such thing as one single quantifier for value; you can imagine rather a \"value profile\" ranked in a dozen or more categories, much like an IQ test.\r\n\r\nRight, but there is a [general intelligence](http://en.wikipedia.org/wiki/Intelligence#Intelligence.2C_IQ.2C_and_g) that transcends those categories. As far as we know, the best measure of value is \"What you'll give up for an object.\" Instead of measuring everything in relation to other *things*, we pick an arbitrary standard and call it the 'dollar'. So we can measure, say, the values of different foods not in terms of how many oranges you sacrifice to eat a steak, but in the dollar cost of oranges and steaks.\r\n\r\n&gt;I don't think I argued anything other than \"value is hard to measure\".\r\n\r\nRight. When you say \"Wealth is a bad way to measure value, because wealth is hard to measure,\" you're either saying \"...and a better standard is...\" or \"...but it's the best standard we have, so I accept it.\" I can't think of anyone who thinks it's just that Linus Torvalds' kid(s?) will never be as rich as Ken Lay's heirs, but I also don't know of anyone who's designed a better system than pricing for aggregating the talents, preferences, moods, and whims of everyone on earth and distributing goods accordingly.","controversiality":0,"retrieved_on":1473808480,"distinguished":null,"gilded":0,"id":"cupbw","parent_id":"t1_cup6x","edited":false,"author":"[deleted]","author_flair_text":null,"timestamp_epoch":1566236768,"message_id":"26989-662a4f67-34e5-4df9-99b9-31066fe96ca9-1566236768"}