{"created_utc":1166050667,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_unoz","subreddit_id":"t5_6","body":"What a stupid article.  He completely fails to name a single one of the real reasons for wage stagnation:\r\n\r\n1) Globalization.  In the late 60s Western Europe and Japan finished recovering from WWII and provided greater competition to the US.  More recently, Communism fell and suddenly billions of people joined the global labor market, suppressing the value of labor.  While the global value of labor was suppressed by the newcomers, at the same time the value of capital went up, because rapid global growth provided great investment opportunities.  The rich can deploy capital anywhere, so they get richer.  But most people are wholly dependent on the value of their labor.\r\n\r\n2) Immigration.  This is similar to the first point.  Historically unprecedented mass immigration has suppressed wages.  \"The great compression\" period he talks about coincides with a time when the US was virtually closed to immigration.  Then he cites the early 70s as starting the inequality trend.  The immigration reform act opening the floodgates was passed in 1968.\r\n\r\n3) Energy scarcity.  The other thing that happened in the early 70s was peak US oil production.  During \"the great compression\" energy consumption was massively ramping up as more and more oil was pumped domestically.  Then in 1971 we started to run out and we've been importing more oil ever since.  Whereas the money spent on energy used to stay in the country for reinvestment, now it leaves.  Those rich Saudi princes have money that used to wind up in American's pockets.\r\n\r\nWealth and energy consumption are more or less synonymous.  You see strongly rising wages in China now as they massively increase their consumption of domestic coal.  It's no different than the US during the 20th century.  If China stopped increasing coal production, their rate of growth would stall and inequality would increase.\r\n\r\n4) Massive expansion of the government.  The government has exploded in size and scope since the mid 60s.  Total federal, state, and local government spending are now roughly 48% of GDP.  The rich are always the best politically connected, so a larger government invariably provides more ways for the well off to profit at the expense of others.\r\n\r\nThe international correlation between the size of government and wage inequality is unmistakable.  Where governments are big and powerful, there is great inequality.\r\n\r\n5) The fiat dollar and credit expansion.  Yet another thing happened in the early 1970s: The end of the gold standard and the start of a huge expansion in the money supply.  The US had developed large trade deficits and it became impossible to service them with gold reserves, so Nixon axed the \"gold window.\"  Since then inflation has been dramatically higher as the government produced more and more money through debt.\r\n\r\nThroughout all history a universal consequence of printing more money has been increasing inequality.  This is close to the same as point #4.  The rich are politically connected, so they leverage government spending of inflated dollars first, while normal people suffer the inflation later.  The roaring 20s, when inequality increased greatly, was a period of massive monetary expansion.  It's no coincidence that the current massive increase in credit, which began in 1995, has created a situation where financial services is the main growth industry, the former head of Goldman Sachs is the treasury secretary, and Goldman Sachs bigwigs are getting $25 million bonuses.  Rich bankers are riding the system at our expense.\r\n\r\nThe increased role of inflation in our economy also helps explain the phenomenon of record corporate profits and stagnant wages.  Normally demand is driven by wages, and vice-versa.  Profits go up when people are earning more money and buying more, and at the same time profits are held down by rising wage costs because expanding production requires more workers.  But this totally breaks down when there's tons of free money floating around.  Introduce loads of cheap credit into the system and demand goes up without any wage increase.  In other words, profits are high because people are spending home equity loans instead of wages.\r\n\r\n6) Technology and growing economies of scale are eliminating many middle class roles.  Walmart is a handful of elite logistics professionals orchestrating a computer networked fleet of trucks and international supply lines.  That handful of highly paid professionals has replaced what used to be thousands and thousands of store owners and wholesalers who earned middle class wages.\r\n\r\nLegions of secretaries earned almost middle class wages typing up documents.  Industrial robots replaced large numbers of line workers.  There used to be many times as many farmers, but now huge computerized systems allow a few people to farm thousands of acres.  Notice how you can't actually get anyone from the bank on the phone anymore and you're forced to use an automated system?\r\n\r\nNew jobs just aren't matching the ones that have been eliminated by technology.  I believe the BLS says bartenders and food servers have been the strongest growth professions in recent years.","controversiality":1,"retrieved_on":1473808480,"distinguished":null,"gilded":0,"edited":false,"parent_id":"t3_unoz","id":"cupcs","author":"kkrev","author_flair_text":null,"timestamp_epoch":1566236768,"message_id":"27003-65e8848c-1702-4689-b5a8-f19f338aa908-1566236768"}