{"subreddit":"reddit.com","score":-1,"ups":-1,"created_utc":1166051740,"author_flair_css_class":null,"body":"&gt; but I do know that the company has a knack for taking esoteric or academic ideas and turning them into consumer products.\r\n\r\nMost computer companies do this.  Microsoft's financial success stems directly from buying QDOS and selling it to IBM.  From that \"lucky\" deal, they were in a market position to buy out, squeeze out, or out-FUD their competitors.  Remember they were convicted of *abusing* their monopoly power.\r\n\r\n&gt; you're using a comparative without comparing!\r\n\r\nNot at all.  The idea is that there are so many criteria one can use that notion of value fluctuates wildly.  One can make an argument for a given method, and a compelling counter-argument for a different method, which are both compelling and which give different results.  It depends on how you weight the factors, which tends to boil down to subjective preference.\r\n\r\n&gt; Right, but there is a general intelligence that transcends those categories.\r\n\r\n...Which shows a \"medium\" to \"large\" correlation with \"job performance\", which also means a small to large gap in the correlation.\r\n\r\n&gt; When you say \"Wealth is a bad way to measure value, because wealth is hard to measure,\"\r\n\r\nWhat?  What is \"wealth\"?  \r\n\r\n&gt; you're either saying \"...and a better standard is...\" or \"...but it's the best standard we have, so I accept it.\" \r\n\r\nNeither!  I don't have to propose \"A\" better standard, because what constitutes a better standard depends on what you value *individually* as being important!  People often don't even act in their own best interest.  The point is any one standard will not suffice for all situations.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_unoz","gilded":0,"distinguished":null,"retrieved_on":1473808481,"author_flair_text":null,"author":"lemmikins","edited":false,"id":"cuped","parent_id":"t1_cupbw","timestamp_epoch":1566236768,"message_id":"27025-06601e7b-2f1f-4f64-b516-5e9a020b96d4-1566236768"}