{"author_flair_text":null,"author":"jmillikin","id":"cupwn","parent_id":"t3_upui","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808491,"body":"&gt; \"It's about infantilizing people,\" she explained. \"Give them free food, do their laundry, let them sit on bouncy brightly-colored balls. Do everything so that they never have to grow up and learn how to live life on their own.\"\r\n\r\nThat's not infantilization. Google is not refusing their employees the right to do these things. Google is creating the world's best [development abstraction layer](http://www.joelonsoftware.com/articles/DevelopmentAbstraction.html), and doing so so well that they are able to consistantly produce quality software. They are also able to attract new developers to replace those who have left to form start-ups (see next point).\r\n\r\n&gt; But as much as they may want to leave Google, the infantilizing tactics have worked: they're afraid they wouldn't be able to survive anywhere else.\r\n\r\nGoogle has something of a problem with retention right now - their star programmers are running off to create start-ups.\r\n\r\n(EDIT: I thought I'd heard this in a reddit story somewhere. I can't find it now though, so it's probably not true. If you can find where this was mentioned, please reply with the link)\r\n\r\n&gt; People read the airbrushed versions of Google technologies in talks and academic papers and think that Google has some amazingly large computer lab with amazingly powerful technology. But hang around a Googler long enough and you'll hear them complain about the unreliability of GFS and how they don't really have enough computers to keep up with the load.\r\n\r\nThat's true of every company, no matter the field or product quality. Go take a peek in the code of some high-quality open source software some time, such as Python or Apache. There is evil there that does not sleep. While the quality perceived by insiders is almost always poor, outsiders merely see that Python, Apache, and Google work very well.\r\n\r\n&gt; Enjoy being huge and powerful while you can. Because, like the dinosaurs, this too will pass.\r\n\r\nConsidering the dinosaurs ruled uncontested until almost all life was destroyed, that last bit isn't really helping your argument.","controversiality":0,"subreddit_id":"t5_2fwo","link_id":"t3_upui","stickied":false,"subreddit":"programming","score":42,"ups":42,"author_flair_css_class":null,"created_utc":1166062884,"timestamp_epoch":1566236768,"message_id":"27265-7677f1c1-82cc-48e5-9836-8226aac4609a-1566236768"}