{"parent_id":"t1_cuozt","id":"cupwy","edited":false,"author":"Fountainhead","author_flair_text":null,"retrieved_on":1473808491,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_uhc0","subreddit_id":"t5_6","body":"&gt; Looks like a duck, walks like a duck, etc.\r\n\r\nWe know the earth is round and that we orbit the sun because we look for answers.  You have stopped looking for answers because the building collapsed like you’ve seen other controlled demolition buildings collapse.  There is a whole new interest in progressive collapse in the engineering world because of the Oklahoma Federal building, 911, and highway collapses, which are all examples of progressive collapse.  \r\n\r\nBasically this document explains why a fire, mixed with debris damage, and the structure of WTC7 combined to result in a progressive collapse.  \r\nhttp://wtc.nist.gov/progress_report_june04/appendixl.pdf \r\nSince I can find nothing on the net by other engineers that contradict any of the findings I'm going to accept it as what happened.    \r\n\r\nThe best you have given me so far is “No building, in the history of mankind has ever collapsed due to fire or falling debris.”  Can you provide me an example of a building staying up after having structural failure and fires?  Probably not, it doesn’t happen very often.  Usually there is just structural problems or fire, not both.  The only cases that I can find are WTC1 WTC2 and this example of WTC7.  Maybe you can find some.  \r\n\r\nThis is the type of work the 911 truth movement needs to do.  This would be a great paper if you could show how another building like WTC1/2/7 had similar damage but managed to stay up.  Or papers on how the structure of WCT1/2/7 should have been able to stand up to the structural damage and fire.  So far all I've seen is \"it looks like a controlled demolition, it must be so\", that's not good enough for me, I require some sort of evidence.  \r\n","controversiality":0,"created_utc":1166063133,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","timestamp_epoch":1566236768,"message_id":"27272-5f7ce606-2c16-416d-b8ca-121a20d4cd6e-1566236768"}