{"distinguished":null,"retrieved_on":1473808495,"gilded":0,"parent_id":"t3_upl4","edited":false,"id":"cuq53","author_flair_text":null,"author":"rocky_m","score":27,"ups":27,"author_flair_css_class":null,"created_utc":1166068032,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_upl4","stickied":false,"controversiality":0,"body":"Some background is obviously missing..\r\n\r\n------------------\r\n\r\nFrom http://en.wikipedia.org/wiki/Hajj#Non-Muslims_in_Mecca\r\n\r\n&gt; The second caliph, Umar, is believed by many Muslims to have expelled non-Muslims from Hijaz (Western part of Arabia). Non-Muslims were not to visit nor to live in the holy land. There is much evidence against this claim, at least so far as it relates to the early centuries of the Islamic empire, but it is well documented that by the 18th and 19th centuries, there were small colonies of merchants in various port and trading cities as well as communities of Yemeni Jews,. The prohibition was not so much imposed by the authorities as enforced by rioting crowds and was most strictly enforced with regard to the Hejaz, and the holy cities of Mecca and Medina.\r\n\r\n----------------------------\r\n\r\nI have quite a few muslim friends who completed the Hajj-pilgrimage.. And I have known this rule ( \"No Non-Muslims allowed\") for some years now.. \r\n\r\nThe reasoning my friends gave was that there are some religious rules to be followed while preparing to go on a pilgrimage and also while in Mecca (and Medina). And, traditionally, non-Muslims either are unaware or unable to follow those rules (dietary, abstinence, attire etc..)..Hence, not allowed in Mecca..\r\n\r\nIt may be more appropriate to compare Mecca with a huge Mosque rather than a city..\r\n\r\nDue to similar reasons, there are some Hindu Holy Sites where non-Hindus, and in some cases, all women (Hindu or not) are not allowed...\r\n\r\nIs it bad?.Probably...Why would I want to goto Mecca anyway??..\r\n\r\n\r\n-----------------------\r\n\r\nAlso, I try to check if the site/blogs these things are hosted are not some Evangelical \"Our God has a bigger Dick than your god\" propaganda.. This site, to me, didn't seem one of those. Most posts are just plain linkjacked from reddit front-page (which may be a coincidence).\r\n","timestamp_epoch":1566236768,"message_id":"27390-e0b87191-8b31-4fb2-9da8-78eaf900e5dd-1566236768"}