{"score":0,"ups":0,"created_utc":1166068820,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_u5pd","controversiality":0,"body":"Blackifidel - Why in the world would the US government \"be reluctant\" to criticise Israel?  They don't generally go around sliming their friends.  One hardly hears the US criticise any country, even when there is plenty of criticism to go 'round.  As for the news outlets, the only channel with any 'reluctance' to criticise Israel is FOXNEWS.  All the rest criticise her frequently.  In fact, it would only take me about 5 minutes of Googling (if that) to prove you wrong.\r\n\r\nBlackinfidel says that \"When I follow news stories covered by news agencies globally and compare, I often feel the US media takes it easier on Israel than other organizations do.\"  I would ask if we have having a world pissing contest to see who can take Israel to task the hardest?  \r\n\r\nAnyway, I realise that most of those who have dugg with article positively already have a hardened view of Israel, ie \"don't bother me with the facts\" and \"most people believe therefore I believe\" view -- but for a slightly different perspective from Gidon D. Remba. Remba was a senior foreign press editor and translator in the Israel Prime Minister’s Office during the Egyptian-Israeli peace process from 1977-1978. ie A PEACENIK\r\nAs J S Mill said, \"He who knows only his own side of the case knows little of that.\" So here is another side:\r\n\r\nThe story is called \"Carter's Palestine-Israel Book: It's Even Worse Than They Say\"\r\n\r\nCarter's top 10 misrepresentations reveal systematic anti-Israel bias and a Manichean view of the Palestinian-Israeli conflict\r\n\r\nhttp://tough-dove-israel.blogspot.com/2006/12/carters-palestine-israel-book-its-even.html\r\n\r\n\r\n","distinguished":null,"retrieved_on":1473808495,"gilded":0,"id":"cuq5w","edited":false,"parent_id":"t3_u5pd","author_flair_text":null,"author":"dajudem","timestamp_epoch":1566236768,"message_id":"27403-5214507b-01c9-42b6-8afc-b88d7ad6e580-1566236768"}