{"controversiality":0,"body":"It's not surprising this was Indiana. Here's why. I used to live there and of course we all know there's a major international speedway there and so the culture is there. But what you may not know is that the land there is incredibly flat and you can often see for several miles, thanks to the last Ice Age. So when you speed, you can spot cops a lot easier.\r\n\r\nI once did something stupid like this at 19, when my girlfriend broke up with me. Driving in the dark with a full moon to light the distance, I gunned the engine at somewhere beyond 125 in a beatup Chevy Nova from Greenfield,IN to Indianapolis,IN. I went through a red light at that speed. I was driving so fast that the speedometer was bouncing on the right and couldn't handle it. I drove about 20 minutes at this speed, I think. The reason I ran the red light was because I could see for miles in farm land, saw no place where a car could turn in or pull out of a driveway to join my road, and so my feeble little teenage brain at the time thought it would be cool to drive through the red light at such an enormous speed.\r\n\r\nThere's something about the thrill of going over the 125 mark. It's like shifting space and time or something. Too bad we can't do this safely.\r\n\r\nSure enough, when I got to Indianapolis, the police flipped their lights on behind me. However, by that time, I was going 55 and the speed limit was that. This puzzled me and my chest about exploded with pressure, thinking I was going to be in prison for a few months. I pulled over, but to my surprise, he drove on, chasing something else -- I was not the intended target at all!\r\n\r\nAs I grew older, my wife has hit a few deer and it's done quite a bit of damage. I once had a friend who ended up in the hospital because he hit a huge stag and instead of it flying over his car or under it, it flipped up onto his hood and slid into his window. He was smart enough to lean to the right but the antlers came through the window, hit beside his eye, and poked through his lung. He survived, miraculously, but was shook up.\r\n\r\nAnd just last week, a teenager raced his new Mustang GT for something called \"pink slips\", where he was racing his opponent to own the title to the car. They both thought they had the lanes free. A car came barreling down past the teen's guarded checkpoint and they couldn't notify the racers in time by cellphone. The GT veered over into his opponent's lane to avoid the collision but then ended up causing both racers to wreck and roll their cars several feet, throwing the occupants from the cars. All of the racers died except the kid in the GT. His axle was separated from the vehicle and was hanging in a tree. The kid was not found for a few days and had actually shifted down a stream. He was freezing when they found him half alive. He was so paralyzed that he could only move his eyes. He's permanently screwed up for the rest of his life.\r\n\r\nSo parents, don't trust your teens and talk to them about the realities of what happens to them or to others when they speed. And teens and young adults, please try not to go over 15 miles over the speed limit if you can -- you never know what a deer can do.","stickied":false,"link_id":"t3_uq66","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166083086,"author_flair_css_class":null,"score":5,"ups":5,"author":"supermike","author_flair_text":null,"id":"cuqom","edited":false,"parent_id":"t3_uq66","gilded":0,"retrieved_on":1473808505,"distinguished":null,"timestamp_epoch":1566236768,"message_id":"27650-72a6cadb-b974-436a-9e7a-3c0d29b97c28-1566236768"}