{"link_id":"t3_o23b","stickied":false,"subreddit_id":"t5_6","body":"That second hand smoking thing always gets to me… Did you know that the anti smoking laws are based on an EPA study done in 1993? Did you also know that that study was thrown out by Federal Courts? That’s because the EPA was found “cherry picking” evidence to make their case. The ruling found the EPA “disregarded information and made findings on selective information; did not disseminate significant epidemiologic information; deviated from its Risk Assessment Guidelines; failed to disclose important findings and reasoning; and left significant questions without answers. EPA's conduct left substantial holes in the administrative record. While so doing, EPA produced limited evidence, then claimed the weight of the Agency's research evidence demonstrated ETS causes Cancer”.\r\n\r\nI’m not saying it’s the healthiest thing in the world but people have definitely blown it out of proportion. In fact, you’re only truly at risk if you are continually exposed to second hand smoke of extended periods of times… and I’m talking months and years, not hours or days. Encountering smoke at the park every now and then? Not going to harm you. Living with a chain smoker in an apartment? Probably something you should worry about more. Oh, and for the record, I quit smoking and still think that almost all anti smoking laws are a steaming pile.\r\n\r\nBy the way, did it ever occur to you that automatically assuming that someone from the US would consider Canada a “socialist hellhole” is every bit as jingoistic as that which you are oh so cleverly attempting to decry?","controversiality":0,"author_flair_css_class":null,"created_utc":1165032748,"score":1,"ups":1,"subreddit":"reddit.com","id":"ctb8y","edited":false,"parent_id":"t1_co4li","author_flair_text":null,"author":"SpikeWolfwood","retrieved_on":1473807540,"distinguished":null,"gilded":0,"timestamp_epoch":1566236759,"message_id":"2789-f93a8061-6653-4acf-b3dd-5c8f1e59c98f-1566236759"}