{"distinguished":null,"retrieved_on":1473808520,"gilded":0,"id":"curhz","edited":false,"parent_id":"t3_uope","author":"richiejp","author_flair_text":null,"score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166104596,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_uope","stickied":false,"body":"\"Too bad my blog isn't more influential. I've been ahead of the curve on this 'global warming is bad for business' thing.\".\r\n\r\nI hope there is humour in the author's claim that they are practically alone in the understanding of how climate change relates to business. It has been written about in many mainstream business and political publications for years. In Europe at any rate and indeed most European governments and corporations are now trying to take steps to stop global warming.\r\n\r\nAmerica is the lone western country in thinking climate change is a) not our fault b) not happening or c) not a problem. Ironically climate change is only good for 'green' companies, the companies causing climate change will suffer the most from it. I hate to sound undiplomatic, but the best word to describe the Bush admin and their benefactors is 'ignorant'. I am loath to use that word, mainly because many people who make frequent use of it are themselves simply failing to understand their opponent's motivations and or reasoning.\r\n\r\nIn this case however I believe it to be fully correct. It's always amazing how such clever people can be so stupid. Oil companies are changing the rules so they don't have to innovate, just like Microsoft has tried to do. It's not a problem for the company bosses if the oil industry just keels over one day, their made already. What is completely foolish is the American government's willingness to go along with it. Mainly for the benefit of a small section of the Rupublican party and various companies who want to take the easy route to profit.\r\n\r\nIn the short term this ignorance will keep the American economy from suffering. In the long term it's going to make things far more difficult. Some of the people involved in this fiasco no doubt have a strategy to make themselves even richer from the eventual chaos caused. I wouldn't describe them as ignorant, but rather immoral scum.","controversiality":0,"timestamp_epoch":1566236768,"message_id":"27937-6e95ad0f-9c26-4ce6-bcda-5950321d0cfb-1566236768"}