{"distinguished":null,"retrieved_on":1473808532,"gilded":0,"edited":false,"id":"cus8q","parent_id":"t1_cuqnt","author":"Fountainhead","author_flair_text":null,"score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166116501,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_uhc0","stickied":false,"body":"&gt;Take a look at what happened in OKC and compare to NYC. I can't believe you are saying both buildings suffered the same type of damage. It's not even close. First of all the OKC building didn't even collapse. I mean it was hit with massive explosives and tons of \"debris\" as well as a massive fire and somehow it didn't collapse.\r\n\r\nHave you done any research on what happened to the OKC building?  If you had you would know that the blast only took out a few supports on the bottom couple floors that resulted in the whole half face to collapse.  4% was destroyed by the blast, 38% destroyed by the ensuing collapse. The fire happened AFTER the collapse.  The reason the whole building didn’t fall is because it was build with earthquakes in mind so had several reinforced features that helped it to “survive”. The fire was also put out by firefighters. \r\n\r\n&gt;I can provide you examples of buildings that were hit with debris and didn't fall down.\r\n\r\nPlease do.  All the examples I’ve seen have been 3 story buildings that aren’t designed anything like WTC7.   \r\n\r\n&gt;Did you watch loose change? \r\n\r\nYes, I have watched/read as much or more stuff on your side as I do on my side.  Apparently more than you as you refuse to read through anything I send you. \r\n  \r\nThe examples that LooseChange provides are poor.  The empire state example sucks because the fire was put out in 30 minutes and the planes were vastly different in size and speed.  The rest of the building examples all are fires, no damage and in case of the Windsor building was a concrete building.\r\n\r\n&gt;Besides it's not like WTC was on massive fire or anything. It was hardly touched for gods sake.\r\n\r\nObviously you don’t want to take serious or read any of the reports I send you.  If you don’t want to read what I send you then I really don’t see any reason to continue.   I could sooner disprove god.\r\n\r\nThe building was hit by falling debris from one of the towers, was missing much of one corner, had a huge hole in the middle and was on fire for hours. The building had started leaning and making creaking noises so fire department officials ordered the evacuation of the area over an hour earlier. The visible collapse of WTC 7 was fairly quick. But seismic readings time the rumblings of the building (culminating in collapse that measured 0.6 on the Richter scale) to 30 seconds before the mechanical penthouses on top start to cave in.  What did they do fake the seismic activity? \r\n\r\n","controversiality":0,"timestamp_epoch":1566236768,"message_id":"28288-2424ec3a-279b-4e3a-a5b0-5053ef30875c-1566236768"}