{"id":"cusah","edited":false,"parent_id":"t3_urzo","author":"[deleted]","author_flair_text":null,"distinguished":null,"retrieved_on":1473808534,"gilded":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_urzo","body":"&gt;    1. Women don't apply for the jobs,\r\n&gt;    2. When they do, they aren't hired (or at least not for the best positions), and\r\n&gt;    3. When they are hired, they're sometimes driven out by having to deal with a**holes of whatever variety\r\n&gt;\r\n&gt; The way you fix problem #3, however, is by not hiring a**holes.\r\n\r\nI would like to see numbers, but I'd bet that the number of women being compelled to leave IT due to a**holes is minute compared to the number that are eliminating themselves from the job opportunity by not wanting it in the first place (step #1)!\r\n\r\nOn the other hand, as a manager, your hiring practices may be very intelligent. The other day I happened to click on a brochure for google job positions and guess what? Half of the pictured employees where fairly attractive women. I would categorize your \"improves the team's morale\" policy as a google-like \"make your employees feel good and good things will happen\" rational -- You could be on to something.\r\n\r\n&gt; When I run a team, everyone is treated *equally*: with respect for their abilities.\r\n\r\nAh yes. The same ingenious policy as is held throughout the school years. Sure everyone is graded based on his abilities. Unfortunately for me, that includes inter-personal, sucking-up abilities!\r\n\r\nNow, I recognize programming/engineering for what it is-- an extremely solitary effort *when one is actually getting work done*, more so than any other occupation I can think of. Then again, who says that companies' profit is proportional to their actual programming productivity..\r\n\r\n&gt; there are issues in education, culture, etc.,\r\n\r\nYes, it is extremely competitive and 95% self-taught. Not the most comfortable environment for many people, especially the women I've known. Also, credibility is earned entirely separate from school work.\r\n\r\n&gt; who're so desperate to have more women in IT ought to try doing something about the actual problem\r\n\r\nI would kill to work along-side a woman that is as intense and willing to pour herself into programming/engineering at the cost of *everything* else she has. Someone as competitive and holding the same vision of great achievement, a vision something of greater significance than anything else attainable, just beyond a few more blocks of code/circuit designs. You misunderstand the whole point of the men who say they want more women here. We don't want them just because it's our only chance at being next to females. We want them because a mysterious, intense, solitary-minded women is.. attractive and basically unheard of?\r\n\r\nIndeed, the actual problem of women not wanting to enter IT/engineering in the first place will not be solved because (using your own reasoning) women are better suited to just work with people. [You said it!]\r\n\r\n&gt; Is porn driving women away from the computer industry?\r\n\r\nNow that was funny. I've had a similar experience and I'll just say that ever-increasing political correctness makes life blow.\r\n","controversiality":0,"score":2,"ups":2,"created_utc":1166117586,"author_flair_css_class":null,"subreddit":"programming","timestamp_epoch":1566236768,"message_id":"28312-ecb8b92e-84ca-4026-936c-af1afb690193-1566236768"}