{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_utkc","controversiality":0,"body":"The relations between France and Rwanda were never good since the FPR came on power in 1994. \r\n\r\nThe party of Kagame always tried to contain French influence in the region of the Great Lakes. The regime is in a bad need of an common enemy who should calm down the inner rift between Rwandans after the genocide. \r\nThe FPR and France are old enemies on the bloody battle-field of the Rwanda genocide. They need one another because they know the best what happened in the combat zones between 1990 and 1994. In reality Rwanda and France needed one another because the truth had to be hidden. But since November 2006 things has changed radically.\r\n\r\nThe Rwandan commission to investigate the French role during the genocide was established in 2004 after French newspapers reported about the Judge Bruguière's inquiry. The silent agreement between the FPR and a part of the French establishment was broken and the time of mutual accusations has begun. The tactics of the Rwandan government was to play the African joker which means that they are mobilizing complexes colonized peoples use to have. But Africans should not forget that the most evil hangmen in Africa are black, not white. African dictators always used to hide behind white men in order to get money or an alibi.   \r\n\r\nThe relations between the two countries deteriorated although the two partners were interested in coming to terms with the other side. But after the Bruguière's warrant against Kagame and his combatants were published, not only a taboo was broken. Under these circumstances normal diplomatic relations were not possible any longer. A power has to be deactivated which could be a danger for the legitimacy of the present Rwandan gouvernment. And on the other side the FPR is still a current risk for the French presence in the region reminding the world that France was the best ally of the régime which committed the genocide. \r\n\r\nThe genocide of 1994 cannot be separated from the war which took place between the FPR and the Hutu government. This war ressembles in a certain way to the genocide Hitler committed against Jewish people. The war against the external enemy was in this sense always the combat against the so-called world enemy, the Jews. When the Nazi party recognised that the war against the Allies was lost, the idea of the \"final solution\", the genocide, was realized. The genocide took place when the Hutu government had already lost the war against the FPR.\r\n\r\nI would like Britain to be a mediator doing more for a real reconciliation between France and Rwanda. But this can only be done when the truth come out and an international investigation is established.","score":1,"ups":1,"created_utc":1166135589,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cutqk","edited":false,"parent_id":"t3_utkc","author_flair_text":null,"author":"kecke","distinguished":null,"retrieved_on":1473808561,"gilded":0,"timestamp_epoch":1566236768,"message_id":"29089-cadf3bb5-46aa-4fdf-ae26-311b889084df-1566236768"}