{"retrieved_on":1473808572,"distinguished":null,"gilded":0,"id":"cuub9","edited":false,"parent_id":"t1_cuttw","author_flair_text":null,"author":"berberine","created_utc":1166143724,"author_flair_css_class":null,"score":21,"ups":21,"subreddit":"reddit.com","stickied":false,"link_id":"t3_ut1n","subreddit_id":"t5_6","body":"Much of the problem relies on two things:\r\n\r\n1) Standardized tests in high school have created a \"teach to the test\" atmosphere where teachers are threatened with their jobs unless their kids pass these tests.  Thus, teachers, like my husband, get to spend 2 days teaching slavery because there is ever only one question (what's the triangle trade?) on the test.\r\n\r\n2) Discipline problems.  My husband spends most of his free time and lunch period filling out paperwork on the various problems he has every single day.  Not only does this mean he has to bring work home, but other students, who sincerely want to learn, have to put up with dealing with the discipline problems that take away from class time.\r\n\r\nJust today, he was over an hour late coming home because he had to speak with the police over an incident he witnessed.  He saw a small scuffle that was broken up quickly but one kid couldn't let it go.  This kid found the other kid later on today and punched him repeatedly in the face so hard that the kid's eye socket and jaw are broken and will need reconstructive surgery. \r\n\r\nMany of these problems started when schools thought inclusion (where everyone, no matter their ability) was a good idea.  You then end up with discipline problems in the same classes as the more advanced students.  The only seperation at my husband's school is Advanced Placement and everybody else.\r\n\r\nThe teachers themselves can only throw a kid out of class and, if the kid refuses, they call in the monitors whose job is to deal with these hellions. They can't physically touch a kid or risk losing their jobs, being arrested or sued, a chance at an assault conviction.\r\n\r\nNow, there is blame to go around for everyone but no one wants to fix anything.  The only person that seemed to want to fix it was George Bush and his No Child Left Behind has only made it worse.  I'm not sure if homeschooling is the answer but curiousity and a desire to learn needs to be brought back to the schools because, seriously, the kids are getting dumber and dumber with the current system.","controversiality":0,"timestamp_epoch":1566236769,"message_id":"29386-5e0c3b3e-a64b-46f1-b51b-217810ebf2bd-1566236769"}