{"distinguished":null,"retrieved_on":1473807546,"gilded":0,"parent_id":"t1_ctab1","id":"ctbko","edited":false,"author":"iheartbeer","author_flair_text":null,"score":1,"ups":1,"created_utc":1165044165,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_sx1y","body":"&gt; \"So if a bouncer checks your ID at a bar, does he think you're not who you say you are?\"\r\n\r\nThis is an awful analogy. First off, bouncers don't give a shit who I am, nor am I telling them who I am. Secondly, I have no idea what a bouncer \"thinks.\" They're checking to see if I'm old enough to drink in their establishment because it's against the law to sell liquor to minors. And thirdly, and most importantly, this isn't remotely similar in nature to rent-a-cops at the corporate stores in question. Maybe if the bouncer asked to see my receipt along with the alcohol I just drank as I was leaving just to make sure I didn't drink more than I paid for or to make sure my friend, the bartender, wasn't loading me up with free shots... \r\n\r\n&gt; \"If your teacher checks your homework, does that mean they think you did it wrong, or not at all?\"\r\n\r\nAgain, another poor analogy.  It's more like I receive a diploma and before I leave the graduation ceremony the school's rent-a-cop wants me to verify my knowledge by having me take a few tests just to make sure everything matches up -- the knowledge I paid for and the receipt, a.k.a. my diploma. \r\n\r\n&gt; \"And are you paranoid about them as well?\" \r\n\r\nThese fictitious examples? Nope, just you.\r\n\r\n&gt; \"Sounds like you could use that reading comprehension class yourself.\"\r\n\r\nGood comeback. What the hell are you even talking about? Care to enlighten me as to what I misconstrued regarding what you wrote? I mean, I at least gave an example.\r\n\r\n&gt; \"Though I gather, if you're paranoid about anyone who disagrees with you,...\"\r\n\r\nI'm not, and I never said I was. Hey look, another example of your reading comprehension problem. \r\n\r\n&gt; \"...I'm guessing comprehension is not something you're altogether interested in.\"\r\n\r\nGuessing is fun, isn't it. I am the one who brought up reading comprehension to make a point. The point was that you assumed I said something I clearly did not. Go back up and read it again. You're just trying to throw \"reading comprehension\" back at me, so you don't look stupid. Guess what? It's not working. By the way, since I'm not paranoid about people who disagree with me, comprehension is something I'm interested in (at least according to you and your argument).\r\n\r\n&gt; \"Funny, someone ranting about being accused of \"stealing\" for having their receipt checked, would then accuse someone of \"working for a corporate entity\" and \"being paranoid of them\" for simply asking why they think that way. But hey, foolish consistency is the hobgoblin of little minds like mine.\"\r\n\r\nYou see, it's called a snide remark. I don't actually believe you work for one of those corporations, I believe you're a fucking retard. By asking which corporate entity you work for, I'm calling you a fucking retard without actually saying you're a fucking retard.\r\n\r\n&gt; \"oh, and it's spelled 'receipt'.\"\r\n\r\nIt sure is, and I'm sure you'll be handing out lots of them in the future. It's also called a typo. (short for typographical error) but since you obviously don't make mistakes, don't bother looking that up either.\r\n\r\nSee you at the check-out, buddy!","controversiality":0,"timestamp_epoch":1566236759,"message_id":"2972-2edda384-c31a-4e53-9a32-315dd3170dc4-1566236759"}