{"created_utc":1166157737,"author_flair_css_class":null,"score":15,"ups":15,"subreddit":"reddit.com","stickied":false,"link_id":"t3_utol","subreddit_id":"t5_6","body":"[It's not pointless:](http://www.commondreams.org/views04/0611-01.htm)\r\n\r\n&gt; \"It's all visuals,\" Karl Rove told campaign finance chief Don Evans. \"You campaign as if America was watching TV with the sound turned down.\"\r\n\r\nSame link:\r\n\r\n&gt; Reporter Leslie Stahl tells a story in her memoir, 'Reporting Live', of an experience she had in 1984 when she broadcast a piece for the CBS Evening News about the gap between rhetoric and reality under the Reagan administration. She juxtaposed images of staged photo opportunities in which Reagan picnicked with ordinary folks or surrounded himself with black children, farmers and happy flag-waving supporters. These images, she pointed out, often conflicted with the nature of Reagan's actual policies. \"Mr. Reagan tries to counter the memory of an unpopular issue with a carefully chosen backdrop that actually contradicts the president's policy,\" she said in her Evening News piece. \"Look at the handicapped Olympics, or the opening ceremony of an old-age home. No hint that he tried to cut the budgets for the disabled or for federally subsidized housing for the elderly.\"\r\n&gt;\r\n&gt; Stahl's piece was so hard-hitting in its criticism of Reagan, she recalled, that she \"worried that my sources at the White House would be angry enough to freeze me out.\" Much to her shock, however, she received a phone call immediately after the broadcast from White House aide Richard Darman. He was calling from the office of Treasury Secretary Jim Baker, who had just watched the piece along with White House press secretary Mike Deaver and Baker's assistant, Margaret Tutwiler. Rather than complaining, they were calling to thank her. \"Way to go, kiddo,\" Darman said. \"What a great story! We loved it.\" \"Excuse me?\" Stahl replied, thinking he must be joking. \"No, no, we really loved it,\" Darman insisted. \"Five minutes of free media. We owe you big time.\" \"Why are you so happy?\" Stahl said. \"Didn't you hear what I said?\" \"Nobody heard what you said,\" Darman replied. \"Come again?\" \"You guys in Televisionland haven't figured it out, have you? When the pictures are powerful and emotional, they override if not completely drown out the sound. Lesley, I mean it, nobody heard you.\"\r\n&gt;\r\n&gt;Stahl was so taken aback that she played a videotape of her segment before a live audience of a hundred people and asked them what they had just seen. Sure enough, Darman was right. \"Most of the audience thought it was either an ad for the Reagan campaign or a very positive news story,\" Stahl recalls. \"Only a handful heard what I said. The pictures were so evocative-we're talking about pictures with Reagan in the shining center-that all the viewers were absorbed. Unlike reading or listening to the radio, with the television we 'learn' with two of our senses together, and apparently the eye is dominant. When we watch television, we get an emotional reaction. The information doesn't always go directly to the thinking part of our brains but to the gut. It's all about impressions, and the White House understood that.\"\r\n","controversiality":0,"retrieved_on":1473808585,"distinguished":null,"gilded":0,"id":"cuuzp","edited":false,"parent_id":"t1_cuuod","author":"winstonsmith","author_flair_text":null,"timestamp_epoch":1566236769,"message_id":"29766-aa16b413-ba00-457a-aac0-0fa2f5e8ced1-1566236769"}