{"subreddit":"programming","created_utc":1166162829,"author_flair_css_class":null,"score":2,"ups":2,"controversiality":0,"body":"This week, Joel tells us a theme he's touched on before where he's not a fan of simplicity because someone thinks it's more elegant. He thinks it creates software that doesn't do much or solve his problems the way he wants them solved.\r\n\r\nI'm a fan of some of what Joel says, but in this case I'd like to remind Joel the case of the SDK. Imagine you want to build a CRM product. Now when you think CRM, and I think CRM, and Jane down the street thinks of CRM, I'm sure it's a completely different set of animals. Well, like most CRM products, you really need to customize them to your particular customer need, and often that requires a programmer because no one size fits all. So CRM products are often SDKs but 50 percent of these you see on the market don't advertise that because it's messy and complicated. Instead, they try to get the CEO to let them get their CRM in the door and then the beans are spilled with the CIO or CTO that it's going to take some customization before it suits the companies needs.\r\n\r\nSo, knowing that, if you had to build a CRM designed for programmers, which do you think they'd rather see so that they could customize quickly, or perhaps replace some of your features with ones of their own (often things like a login mechanism or a customer database)? Do you want to go with the full-featured one that solves every problem known to man? Do you want to go with the slim-featured one that solves about 50% of what you want?\r\n\r\nWell, the full-featured one is probably going to be a pain because it's probably got 50% more than what you *don't want* and has all this programming goo that you have to muck through in order to customize it. The slim-featured one is probably going to be *easier* and *better* for you because it doesn't have these problems. It's slim and so it doesn't have 50% more than what you don't want. It's also slim from a code standpoint so that programmers can get in there, understand how things work, and customize it into something tremendous.\r\n\r\nSo for me, I see Joel's argument is a worthy one, but not in all cases.","stickied":false,"link_id":"t3_uv0q","subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473808589,"distinguished":null,"author_flair_text":null,"author":"supermike","edited":false,"parent_id":"t3_uv0q","id":"cuv8s","timestamp_epoch":1566236769,"message_id":"29859-d2301db0-7813-41f5-91ba-a36d886f8268-1566236769"}