{"subreddit_id":"t5_6","link_id":"t3_uaus","stickied":false,"controversiality":0,"body":"Your ISP has a router that receives data from the high-speed backbone and sends it down your DSL or T1 line.  Data often comes in bursts, so the router buffers it and sends it down the slow line to your location.  If the buffer fills up then the router throws away packets.  If VoIP packets get buffered or discarded then the conversation breaks up and sometimes the call is disconnected.  Packet prioritization solves this problem.  The router can check packets for special priority markings and deliver the high-priority packets immediately.  This means that VoIP packets always get through but email, web pages, and everything else has to wait their turn.\r\n\r\nThe problem is the packet markings.  If every ISP honored the packet priority markings then people could cheat the system by marking **all** of their packets as high priority.  Imagine if you could make your bittorrent download go faster than everyone elses?  The only feasible way to make prioritization available is to charge money for it.  ISPs can already charge extra for special packet prioritization rules for packets going over the customer's wire.  The problem is that they are not allowed to set up those rules on core Internet routers.  And they are not allowed to cooperate with other ISPs to do it.  Most ISPs erase the priority markings on packets that come from other ISPs.\r\n\r\nSo what does this mean for VoIP?  Well, if you have two offices with internet connections from the same ISP, you can set up VoIP just fine.  That ISP can do prioritization on the routers that serve both locations.  Your calls will be clear and reliable.  But what if the offices are in different states and there is no ISP that can serve both?  Then your VoIP packets must traverse a boundary between ISPs and be stripped of their priority markings.  Also, if there is a large amount of traffic over the inter-ISP boundary connections, your VoIP packets might be buffered or discarded.  This happens when there is an Internet worm like Code Red.\r\n\r\nIn short, packet prioritization is a necessity for VoIP.  Eventually, ISPs **will** earn the legal right to provide such services, for an extra fee.  It's only a matter of time.","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166166795,"subreddit":"reddit.com","id":"cuven","edited":false,"parent_id":"t1_cueim","author_flair_text":null,"author":"mleonhard","distinguished":null,"retrieved_on":1473808592,"gilded":0,"timestamp_epoch":1566236769,"message_id":"29922-6e5167a2-5ce8-490d-a26e-8e70e8fcf7e4-1566236769"}