{"gilded":0,"retrieved_on":1473808604,"distinguished":null,"author_flair_text":null,"author":"swissmap","id":"cuw31","edited":false,"parent_id":"t3_uvvc","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166183624,"score":1,"ups":1,"controversiality":0,"body":"How much pain and anguish has to be caused by prohibiting \"recreational\" drugs before even liberal MP's wake up and sniff the coke, if they don't already. \r\nEcstasy, or it's main component MDMA was prescribed legally in the 70's to help couples in marital difficulty - to produce that warm cuddly loving feeling. Today with ecstasy pills as cheap as £3 that feeling is not nearly as strong, it is cheap and weak because they're being cut with substances that are unknown and are really harmful to health. In the papers recently we are being told that coke is the cheapest that it has ever been, again it is being cut to ensure every middle man down to your dealer gets a cut.  It's the cutting to make the profits that poses the most danger. One of the most important pieces of advice today is to know your dealer, stranger danger has never been more relevant.  A dealer you know or are introduced to is not knowingly going to sell you rubbish, it's easier and far less dangerous for him to have a good base  regular clients than to tout on a street corner with his wares. Recreational drugs are that for the majority of users, to force clients and dealers underground only increases the risk of cutting the product, increasing the risks to the public.\r\nHow much money could the tax man make? Or perhaps more importantly, take, from organised crime networks that exist in every country to supply the increasing demand. Because no matter what other spin governments put, none dare try a spin the line that drug use is decreasing. It is well known that the rise and rise of the American mafia came during the prohition era, the enormous amounts of money to be made supplying liqour outweighed the risks of getting caught. As it is today, organised crime networks profit enormously from this prohibition.  I cannot tell you the amount that the NHS spends on therapy and health for drug related illnesses, however I would estimate that it's far far less than what the drug bosses and cartels earn.  The excise tax on alcohol also more than covers the NHS cost for alchol related illnesses.\r\nHow much imagination does it take, to borrow a phrase from the business world, to turn this in to a win-win for governments and citizens?","link_id":"t3_uvvc","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236769,"message_id":"30203-47d7ed00-59ca-4594-bf70-2fc124a5cc81-1566236769"}