{"id":"cuwyl","edited":false,"parent_id":"t3_up24","author_flair_text":null,"author":"jfpbookworm","retrieved_on":1473808622,"distinguished":null,"gilded":0,"link_id":"t3_up24","stickied":false,"subreddit_id":"t5_6","body":"From my time at Brown in the late 90s:\r\n\r\nThe Slacker Genius.  Shows up to the classes, provided they're after 11 a.m.  Already knows almost as much about the subject as the professor, but doesn't bother talking much unless something interesting comes up, at which point the Slacker Genius gets into a conversation with the professor that flies over everyone else's heads.\r\n\r\nThe Grade Grubber.  Favorite question: \"Is this going to be on the test?\"  If the answer is \"no,\" totally uninterested in the topic.  Shows up at every office hours to argue for points on a paper or test.  Participates only if their grade depends on it.\r\n\r\nThe Theoryhead.  The apolitical version of the Agenda Assailer.  Reads a few European postmodernists, and filters all human knowledge through them.  Thinks that name-dropping Foucault makes their position unassailable and relevant.\r\n\r\nThe Heir to the Throne.  Basically the international version of CEO Junior the Third.  Gravitates to communications and international relations rather than business and econ, because they're as likely to be running their parents' country as their company.  Sent by their parents to an elite American college to get an education, they'd rather just keep the expensive clubs and restaurants in business.\r\n\r\nThe Trendy Hipster.  Usually an art or literature major.  Name-drops as much as the theoryhead, but references bands, writers and artists nobody else has ever heard of (yet).  Not clear if they ever go to classes.\r\n\r\nThe Neohippie.  Sits outside a co-op playing bongo drums.  Is a vegan, either because they're rich enough to buy organic everything or because they're too poor to buy anything but lentils in bulk.","controversiality":0,"author_flair_css_class":null,"created_utc":1166196327,"score":3,"ups":3,"subreddit":"reddit.com","timestamp_epoch":1566236769,"message_id":"30560-4882b22c-0083-4b74-8f55-b2d05e6ce8c8-1566236769"}