{"id":"cux2z","edited":false,"parent_id":"t1_cuwzi","author":"masklinn","author_flair_text":null,"distinguished":null,"retrieved_on":1473808624,"gilded":0,"subreddit_id":"t5_2fwo","link_id":"t3_utqb","stickied":false,"body":"&gt; I don't know about what kinds of applications you write for a living, but where I work, it is REALLY important to have fine grained control over exceptional conditions.\r\n\r\nSo what? Where the hell did you see that Python somehow didn't have that \"fine-grained control over exceptional conditions\"?\r\n\r\n&gt; In this allegedly simple to read Python code, what happens when localfile.txt doesn't exist?\r\n\r\nThrows IOError whenever the file can't be opened, whatever the reason is, as written in the documentation for the `open` and `file` built-in functions\r\n\r\n&gt; I can't tell by looking at your code. \r\n\r\nBecause Python doesn't force you to perform empty catchs when you just don't want the compiler to bother you?\r\n\r\n&gt; I can interpret the intent of the programmer - which is (in the case of the Java samples in this discussion), since the catch block has no implementation, the programmer is saying that it doesn't matter if this code doesn't run. THAT's readable.\r\n\r\nI strongly disagree, when the programmer says that it doesn't matter if the code doesn't run, he usually still logs the error because he cares. From my experience, empty catch blocks in production code just mean that the programmer wanted the compiler to shut up and compile.\r\n\r\nPlus nothing stops you from writing something along the lines of\r\n\r\n    try:\r\n        f = file('localfile.txt')\r\n    except IOError, e\r\n        pass\r\n\r\nin Python.\r\n\r\nAnd this does, in fact, express much more intent than the equivalent Java:\r\n\r\n * You don't have to catch the exception, catching it means that you care\r\n\r\n * You have to use an explicit \"pass\" statement to define an empty block, which translates into the fact that you explicitely want to do nothing.\r\n\r\n","controversiality":0,"ups":13,"score":13,"author_flair_css_class":null,"created_utc":1166197380,"subreddit":"programming","timestamp_epoch":1566236769,"message_id":"30612-e4cb6698-998a-46a7-8f8d-fe55fa8b3282-1566236769"}