{"edited":false,"id":"cux64","parent_id":"t1_cux1k","author":"cgibbard","author_flair_text":null,"distinguished":null,"retrieved_on":1473808626,"gilded":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_utqb","body":"re: teaching new ideas\r\n\r\nI think it's really just a matter of digesting the ideas ourselves. Monads are now far, far, easier to learn than when I started programming in Haskell. Quite often it's obvious that an idea is a good idea for programming before you fully understand its implications and the best ways to think about it. Haskell tends to adopt new ideas in highly mathematical forms way earlier than they're digested to the point where they can be taught to beginners, and the community slowly figures out the right words to explain them without referring to all that abstraction.\r\n\r\nI don't see the problem with throwing more advanced features into the standard once they've been digested. One doesn't have to understand the whole standard in order to get simple programs running as it is. I view the standardisation process as more for the benefit of the compiler writers than the users of the language. The status quo of Haskell development uses lots and lots of stuff which isn't in the standard, and ignores other parts (though not so much as it stands).\r\n\r\nThe standard doesn't have much influence on popularity, tutorial materials do.\r\n\r\nOn a side note, I like the current way in which the Haskell community is growing, and wouldn't seek to artificially accelerate it. It's nice to be able to give every newcomer personal attention on the level that we've been able to, and the resulting effect on the community is very positive -- most people turn around and repay the attention they were given many times over. Nobody is ever told to RTFM, and quite often we're willing to spend lots of time working with people on making their programs efficient and elegant, and teaching lots of things in ways that we just wouldn't be able to keep up with if there were 10000 new people on the mailing list overnight.","controversiality":0,"score":6,"ups":6,"created_utc":1166198411,"author_flair_css_class":null,"subreddit":"programming","timestamp_epoch":1566236769,"message_id":"30651-9cc2ae7d-eec4-4dde-aca3-8163960e8795-1566236769"}