{"retrieved_on":1473808630,"distinguished":null,"gilded":0,"parent_id":"t1_cuuh2","id":"cuxfn","edited":false,"author_flair_text":null,"author":"UncleOxidant","created_utc":1166201509,"author_flair_css_class":null,"score":5,"ups":5,"subreddit":"programming","stickied":false,"link_id":"t3_uqnu","subreddit_id":"t5_2fwo","body":"&gt; The worry is more directed at how many people are actually working on the new interpreter. If it's a single individual then there should be a lot of concern. If this guy gives up then you're in trouble.\r\n\r\nAnd now it's time to talk about the elephant in the Ruby-room: the split between Japanese and developers from elsewhere in the world.  YARV is entirely a Japanese project (seemingly by one person) and there hasn't been any sort of an invitation for other developers to join in as far as I recall.  I suspect there is a cultural aspect at work.  I used to work for a Japanese company.  I'm American.  Those of us in the US office of the Japanese company never really felt like full partners - there was always a distance that couldn't quite be bridged.  It was tacitly clear that we were not trusted at the same level as our Japanese counterparts.  I suspect there are similar cultural forces at work in Rubyland.  Granted, part of this divide is due to the language gap, but that doesn't account for all of it. That's why I like the open approach of Rubinius development.\r\n\r\n&gt; He suggested that the lack of Ruby interpreter developers may be due to the fact that there are fewer and fewer people who work natively in C/C++.\r\n\r\nExactly.  Here you've got a group of people who've escaped from the C/C++ world - that's why they use Ruby.  Yet, the 'standard' way of developing these things is in C.  Again, this is where I think Rubinius shows promise: you'll be able to do core development of the interpreter in a subset of Ruby.  C is still involved deep down (it has to be somewhere for speed and because gcc is ubiquitous) but there's going to be much less of it.\r\n\r\nAnd from your previous post:\r\n&gt; However, the fact that the interpreter is aging sort of speaks volumes about how much love there really is for the language. If there are only one or two people willing to work on interpreters for a language what does that signify?\r\n\r\nThere's plenty of love out there for Ruby the language.  It's just that the skillset required for developing a new interpretter is pretty specialized (as you note).  There's lots of work going now to develop alternative implementations.  I think part of the problem has been that people kept thinking that YARV was on the way and that someone else was working on it so we'll just let them do it.  That lulled people into complacency.  Now people are waking up and realizing that we can't let someone else work on it, we need to work on an alternative in case YARV doesn't pan out.","controversiality":0,"timestamp_epoch":1566236769,"message_id":"30795-09a6e951-6596-403e-be07-be0b5169b143-1566236769"}