{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_ut1n","body":"&gt;&gt; No. That's how the teachers see it. There are problem kids but the reality is (usually) the teachers are trying to deny to themselves how boring and un-knowledgable they are.\r\n\r\n&gt; This is exactly right, the only teachers that have ever disciplined me have been the idiots that don't know their subjects and by extension aren't teaching it to me or anyone else in the class.\r\n\r\nHow about \"some from column A, some from column B\"?  I don't deny that there are incompetent teachers.  However, I think it's foolish to believe that there aren't some students whose primary goal is to disrupt class.  (More than once during my term in public schools, I was that person.)  I'm not saying these agitators are beyond hope, impossible to educate; I am saying that I'm not sure a teacher with a class of 35 is equipped to handle students ranging from consistently mischevous to very confrontational (such as telling the teacher \"go fuck yourself\"--and getting away with it).\r\n\r\nI was talking to a (now ex-)teacher friend of mine who pointed out difficulties with discipline.  Easy-going administrators that essentially give everyone a slap on the wrist.  Not that it matters, since the classrooms have no phones and no one answers the intercom buzzer; to remove a child from the classroom you have to find another teacher to keep an eye on your class while you bring them to the office (who knows how far away that is, with sprawling fields full of \"mobile classrooms\"), and then you're lucky if the administrators will even let you remove the disruptive student from your classroom.\r\n\r\n&gt;&gt;&gt; Teachers' hands are tied\r\n&gt;&gt; No. If you look at statistical data there is a huge difference between effects of different teachers.\r\n\r\nAgain, I don't want to excuse the incompetent teachers, but from what I understand in my school system, teachers are given a curriculum which teaches to the test, and they are not allowed to deviate from it.  They have some freedom in exactly how they teach the lessons, I gather, but even that is apparently dwindling (presumably in an attempt to help out the aforementioned incompetent teachers that can't make a decent lesson plan).  Their lesson plan must be written down and in a particular color notebook on the teacher's desk.  Administrators can then come in at any time in the middle of a class, walk to the teacher's desk, pull the notebook out, and make sure the teacher is (a) following the lesson plan that must (b) follow the curriculum they were given.\r\n\r\nMaybe this is all part of a grand goal, though: everyone is taught their lessons by video instruction, and the teachers can just stick to being disciplinarians.","controversiality":0,"ups":6,"score":6,"created_utc":1166208583,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cuxyg","edited":false,"parent_id":"t1_cux8v","author":"darkness","author_flair_text":null,"distinguished":null,"retrieved_on":1473808641,"gilded":0,"timestamp_epoch":1566236769,"message_id":"31089-67a2596a-c4e0-49a7-a5e0-dc88457a6cb9-1566236769"}