{"subreddit":"programming","author_flair_css_class":null,"created_utc":1166213011,"score":3,"ups":3,"controversiality":0,"body":"You are right that 50 pages is short by most standards.  I am not sure, however, that this is a good thing.  I want a language spec that looks like an RFC.\r\n\r\nAt the risk of being too nasty, one might say that the people who write languages with specs like the Haskell Report or even R5RS are living, in a way, in the '70s.  A language is a standard by definition, and tomes like the Haskell Report or R5RS are very well-suited to a '70s style of standards process, where grad students bang out the bugs for five or ten year, then a big quasi-governmental organization such as ANSI puts a committee of disinterested experts together, they kick the thing into shape, and produce a spec.  It's not that this process didn't work fine and can't be defended in its own way; it is just that it has very little to do with reality as it exists now, in which even much more agile organizations like IETF and W3C often seem too slow and clumsy.\r\n\r\nAlso, I perhaps should have been a little clearer on \"readability.\"  Lisp notation for example, looks like ass to a non-Lisp programmer, but Lisp (or Scheme, etc) programmers quickly learn not to fear the parentheses.  The learning curve on this particular feature is actually flatter than it looks.\r\n\r\nMy point was that syntax in a language like Haskell has really the opposite quality.  The learning curve is steeper than it looks.  In examples like dons's, Haskell appears very straightforward and easy to grasp.  Yet I don't know if even the most diehard Haskell advocate would defend this characterization. \r\n\r\nIf one were, again, a nasty and bitter person, one could characterize this as a sort of [Potemkin](http://en.wikipedia.org/wiki/Potemkin_village) usability.  One could say that its goal was to convince granting agencies that the project is useful, rather than to actually produce useful software for users. \r\n\r\nFortunately, my experience of CS researchers is that they are overwhelmingly honest, practical, and well-intentioned.  The structure of the political system they have to work within cannot be blamed on them in any way, shape or form, and the problems it causes do not, I think, reflect on their personal characters.  I don't want to encourage the anti-CS attitudes found in many segments of industry, which often feature stereotypes whose connection to reality strikes me as dubious at best.","link_id":"t3_uuzg","stickied":false,"subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473808648,"distinguished":null,"author":"[deleted]","author_flair_text":null,"edited":false,"id":"cuych","parent_id":"t1_cuy45","timestamp_epoch":1566236769,"message_id":"31255-9f7a6b72-893c-4dfc-b3e2-ceda1c4a27eb-1566236769"}