{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165060568,"score":9,"ups":9,"controversiality":0,"body":"I was pretty much with you until this statement was made.  I found your experiment charming - maybe a little naive - but earnest  and heartfelt.  \r\n\r\nAfter graduating from college, I choose to live at the poverty level for a few years whilst I pursued my profession of choice. Fortunately, my parents were 2nd generation Americans who grew up during the Great Depression. As a result, just by observing my mother, I knew how to feed an entire family for about $3 a day. Many of the great suggestions above from different cultures give a clue.  \r\n\r\nInterestingly enough - even though my family of origin was upper middle class - there where \"traditional\" favourites that my Mom used to cook on holidays like Oxtail Soup, Pigs Feet, Tripe, Greens and Black Eyed Peas and Rice. My brother and I found these particularily disgusting, but, my Dad was always excited for these special meals.  \r\n\r\nMany of the foods - we as Americans - find exciting from other cultures have been developped after centuries of poverty or making do with what is available.  In actuality it is peasent food.  Just because a person is poor, doesn't mean they haven't got clue about nutrition. If more us cooked like our grandmothers did, we'd all be a lot healthier (Although sometimes adapting traditional recipes is needed, such as using margerine rather than lard.) \r\n\r\nEven though we eat everyday - dinner time often seems to come as a surprise to many people.  So - we have a strong industry which provides crap to people who don't seem to remember that they eat everyday and forget to plan for that eventuality\r\n\r\nCooking healthy food in advance like soups, stews or casseroles and then freezing them allows busy people to have \"convienence food.\" (It's how my mother was able to work over 10 hours a days as a corporate executive and still manage her household and our health economically.)  \r\n\r\nI'd like to see you redo your experiment with a bit of research, planning, bulk purchases and a slew of recipes from traditional cultures.  Or better yet, try this one.  Cook all of your meals for an entire month in one day. http://members.aol.com/oamcloop/articles.html\r\n\r\n","link_id":"t3_t9us","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473807553,"distinguished":null,"author_flair_text":null,"author":"svaha","id":"ctbyb","parent_id":"t1_ctau1","edited":false,"timestamp_epoch":1566236759,"message_id":"3146-d9f7e188-3ebd-4330-b77e-8e95eed0ec6a-1566236759"}