{"author":"harryf","author_flair_text":null,"parent_id":"t1_cuyey","edited":false,"id":"cuyt7","gilded":0,"distinguished":null,"retrieved_on":1473808657,"controversiality":0,"body":"Basically agreed with your counter points. Author is basically saying he doesn't like PHP because it's not Python.\r\n\r\n&gt; \"Functions cannot be redefined.\"\r\n\r\nActually then can [like this](http://www.php.net/manual/en/function.runkit-function-rename.php) or [this](http://www.php.net/manual/en/function.rename-function.php), not that I'd recommend using either in anything live, unless you're looking for segfaults.\r\n\r\n&gt; \"Not thread safe.\"\r\n\r\n&gt; PHP is thread safe. The problem is third party libraries that you can use with PHP are thread safe. The default libraries are now all thread safe. Any language that can use third party C libraries is going to have this issue.\r\n\r\nExactly: $ man perlthrtut - see Thread-Safe Modules - using [this](http://www.boutell.com/gd/) (in [any](http://cpan.uwinnipeg.ca/dist/GD) [language](http://newcenturycomputers.net/projects/gdmodule.html))? Thread safe?\r\n\r\nAnd Rasmus made a very good point [here](http://www.zend.com/lists/php-dev/200306/msg00812.html);\r\n\r\n&gt;&gt; Is there a short list of some common extensions that do work reliably with Apache 2?  (eg MySQL, GD etc...)\r\n\r\n&gt; Nope.  Make one.  It's not all that easy to create such a list.  Just take a single library and go through it and tell me if it is threadsafe.  Can you do that?  Do you know what to look for?  If it is threadsafe on one platform, do you think it is threadsafe on another?  Does it depend on which version of libc is on a platform?  Does it depend on how it was compiled?\r\n\r\n&gt; We could of course mutex every call to every external function.  Then we could be reasonably sure it would work, and at the same time we could be sure that it was much slower than running it non-threaded.\r\n\r\n","subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_uvma","subreddit":"programming","ups":-2,"score":-2,"created_utc":1166219865,"author_flair_css_class":null,"timestamp_epoch":1566236770,"message_id":"31506-83d1044d-43a3-491a-aa32-252f42e02de8-1566236770"}