{"score":5,"ups":5,"author_flair_css_class":null,"created_utc":1166249352,"subreddit":"programming","subreddit_id":"t5_2fwo","link_id":"t3_uvma","stickied":false,"controversiality":0,"body":"&gt; The good points he does have are pretty well known already.\r\n\r\nSo . . . because it's well known, it's no longer a problem.  Got it.  Whew.  I guess we can ignore cancer now.\r\n\r\n&gt; It's object model actually more powerful than in some other common languages.\r\n\r\nGive me some examples.  I'm having trouble coming up with a single example that fits those requirements: common language, less powerful object model.\r\n\r\n&gt; True namespaces in PHP aren't needed.\r\n\r\nTrue namespaces aren't needed in any programming language, the same way cars aren't needed.  We could always just walk everywhere.\r\n\r\n&gt; Sometimes it's nice that PHP has every possible function under the sun.\r\n\r\nToo bad the functionality of most of them is just slightly left of center mass.\r\n\r\n&gt; This guy is on crack. If functions could be redefined this guy would put it on this list! \"Oh my god PHP sucks because you can redefine functions causing all kinds of hard to find bugs\"\r\n\r\nIncorrect.  He uses a number of languages in which functions *can* be redefined, and likes them.  So do I (except Python -- I'm not a fan of that one).\r\n\r\n&gt; Anonymous (first class) functions would be nice but hardly a reason that PHP sucks.\r\n\r\nThe title of the page isn't \"PHP sucks\", it's \"Problems with PHP\".\r\n\r\n&gt; Case-sensitivity rules in PHP are pretty bizzare. But it's essentially a non-issue because you should never have two functions named the same but with a different case.\r\n\r\n. . . and yet, it's still a potential source of programming issues.\r\n\r\n&gt; \"No \"doc strings\".\"\r\n&gt; I guess C++ sucks too. This a real stretch. I use phpdoc style comments and generate my documentation using phpDocumentator. It's a good system, I don't see the problem.\r\n\r\nI think you missed some important explanation there, when he said \"Documentation must either be maintained separately from the code, or by (rather finicky) 3rd-party code-level documentation interpreters.\"\r\n\r\n&gt; \"... is (as of PHP 5.1.2) not included with the source, nor typically installed along with the binary packages.\"\r\n&gt; Err.. so?\r\n\r\nI take it you're a Windows user.\r\n\r\n&gt; \"You can't just point an introspection tool at a PHP module and get usage information from it.\"\r\n&gt; I thought this was a list about what sucks about PHP -- this guy is going way out to find issues. Most languages don't do this.\r\n\r\nMany languages do -- and the fact that it's a common problem doesn't mean it's not a problem at all.\r\n\r\n&gt; \"Default to pass-by-value.\"\r\n&gt; Fixed in PHP5 -- That's almost the sole reason that PHP5 exists!\r\n\r\nYou're discarding context/explanation again: \"php5 now defaults to reference, for objects, though I'm not sure if it's \"real\" references or reference-by-name\"\r\n\r\n&gt; \"The combination list/hash type causes problems by oversimplifying, often resulting in unexpected/unintuitive behavior.\"\r\n&gt; Bullshit.\r\n\r\nHow is that \"bullshit\"?  Please elaborate.  Uttering an expletive is not a refutation.\r\n\r\n&gt; Magic quotes are moronic, totally 100% agreed. Finally a good point after a long list of BS ones. I believe they are turned off by default but I have, even recently, come across situations where it's enabled -- boggles the mind really.\r\n\r\nI'm really glad we can all agree on that.  Holy stupid decisions, Batman.\r\n\r\n&gt; \"Bad recursion support.\"\r\n&gt; Huh?\r\n\r\nY'know, I'm not sure what that means either.  I've never done recursion in PHP (it seems like a bad idea in general to do common functional paradigm stuff in PHP) aside from demonstrating a Fibonacci number generator, and haven't really read up on it, so I just wouldn't know.  I should ask him about that some time.\r\n\r\n&gt; PHP is thread safe. The problem is third party libraries that you can use with PHP are thread safe. The default libraries are now all thread safe. Any language that can use third party C libraries is going to have this issue.\r\n\r\nThe idea of trying to do programming with threads in PHP is enough to give me nightmares, regardless of how thread safe it may or may not be.\r\n\r\n. . . which is to say, I have no idea whether it's thread safe.\r\n\r\n&gt; \"Vague and unintuitive automatic coercion; \"==\" is unpredictable\"\r\n&gt; He's got some good examples but I've never encountered them in real life. For the most part, the coercion does what it should do given that you're dealing with the web and most of your data comes in as strings.\r\n\r\nSo . . . it's okay for doing certain simple numeric operations to cause your code to fall flat on its face in unexpected ways sometimes?\r\n\r\n&gt; \"Poor security, and poor response to security issues.\"\r\n&gt; I blame the user.\r\n\r\nWow, you're like a caricature of the very problems with the PHP community that are most cited when people complain.  Are you serious?","distinguished":null,"retrieved_on":1473808681,"gilded":0,"parent_id":"t1_cuyey","edited":false,"id":"cv02v","author_flair_text":null,"author":"apotheon","timestamp_epoch":1566236770,"message_id":"32096-81074e78-b05e-4cad-9dff-0031c86451ca-1566236770"}