{"gilded":0,"retrieved_on":1473807558,"distinguished":null,"author_flair_text":null,"author":"poxy1","edited":false,"id":"ctc6o","parent_id":"t3_tbkz","subreddit":"reddit.com","created_utc":1165067366,"author_flair_css_class":null,"score":-2,"ups":-2,"controversiality":0,"body":"The author exhibits a grave misunderstanding of what a democratic government is all about. There are certain obligations that citizens must perform in exchange for securing the greater good of the citizenry as a whole. Jesus fucking christ, I can't believe some of you think that represents stealing from your neighbor with the help of the government, and if that is what the government represents to the majority of you here then that is fucked up. That means you have lost faith in your government. How could the view of government have become so cynical and so twisted in our age? The idea of empowerment of the individual through a democratic government has come to us from a direct link from the days of Socrates in Athens.  In a complex society such as the United States, do any of you honestly believe in the myth of self-sufficiency that is spouted off by talking heads from conservative think-tanks? It is a sham argument. We have formed a complex society that without a government through which the individual can assert her legitimacy we will relinquish that legitimacy to other sources. Don't kid yourself, you as an individual alone cannot fight these forces away from their natural ascent to legitimacy to power over the individual in such a highly advanced society as ours. A Dictatorship of the Interest Groups or the Corporations will quickly fill the vacuum. The government is the ONLY tool of the individual, as it is the only one powerful enough to put the individual above God, a King, or the Corporation.  Don't shoot yourself in the foot by destroying the fabric of our society. I can see this is a trend on the rise, this hate towards the institutions of government, consequently followed by its  vilification. So hold on  here, if you pay taxes, you are being robbed blind? Ok then, let us go back to every man for himself, without an idea of the public good, and let's just do that and fuck everyone else. This is a state of pure egoism of the mind and soul, and will lead to nothing good.","stickied":false,"link_id":"t3_tbkz","subreddit_id":"t5_6","timestamp_epoch":1566236759,"message_id":"3210-684c4292-b16a-47fd-8a9d-2867c985caa0-1566236759"}