{"distinguished":null,"retrieved_on":1473808705,"gilded":0,"parent_id":"t1_cv0ur","id":"cv1cv","edited":false,"author":"carpeliam","author_flair_text":null,"score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166290233,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_uz4h","stickied":false,"body":"erm, *all* of their history is in the past, some of it further than others. i think it's pretty clear that i was pointing out that this all happened a long time ago, and this isn't at all the way the current Church does business. are you actually disputing that, or just violently agreeing with me?\r\n\r\nthe notion that believing that contraception is immoral can be considered a \"crime\" is sensationalist. even more sensationalist is putting these crimes on the same level with the Catholic crimes of old.\r\n\r\nyou don't spread disease by believing in something- you're essentially blaming the Catholic Church for committing the \"crime\" of OTHER people having sex. It's the equivalent of blaming a condom for breaking instead of assuming responsibility for having sex in the first place. Unwanted pregnancy? If you really don't want to be pregnant, there's a simple solution- don't have sex. Every other option has less than 100% odds, and you take those odds into your own hands, not put them in someone else's. The mainstream Catholic view was that we shouldn't unnaturally stop a pregnancy from happening. That's not a crime! I understand that \"the rhythm method\" isn't a popular method of contraception anymore, and that the modern world has shifted gears, but please don't be so arrogant as to assume that *this* generation corners the market on what is moral and what isn't, any more than the last generation, or the next. Just because you have a different moral heirarchy (preserving human life &gt; interfering with God's plan) doesn't mean that you can so blatantly disregard those who believe something different than yourself.\r\n\r\n&gt; Low standards don't excuse bad behavior -- they just explain it.\r\n\r\nLow standards? Please, what low standards are you talking about? Suddenly, saying that mankind is imperfect is a low standard? Nobody is trying to excuse or explain away bad behavior. In fact, they have very high standards, so high that they can't possibly meet them. You're taking my point out of context, I was responding to \"pious face\". When I say they don't presume to be different, I mean they don't presume to carry on a holier than thou attitude. Priests don't believe they are above sin. But sin (as in the \"original sin\" context) here is the inability to be perfect, to be godly. Nobody is trying to excuse behavior, that's not at all what the Christian concept of sin is designed to do.","controversiality":1,"timestamp_epoch":1566236770,"message_id":"32535-5b24b820-fbc4-47ae-9c5e-770bec1d9470-1566236770"}