{"controversiality":0,"body":"I think it depends where you look. As a writer, I frequently notice that people completely miss the larger point of what I'm saying. This could be because my writing sucks, but it seems like this happens to other people a lot too. Take Paul Tough's NYT Magazine article \"What It Takes to Make a Student\" from the other day:\r\n\r\nhttp://www.nytimes.com/2006/11/26/magazine/26tough.html?ex=1322197200&amp;en=365daca642ddcb2f&amp;ei=5088&amp;partner=rssnyt&amp;emc=rss\r\n\r\nIt basically asks the question do poor parents and black parents still have the right to autonomy in raising their children? Or, due to bad scholastic performance, does the government now have the right to step in and change the \"culture of child-rearing\" in these groups?\r\n\r\nI was really shocked to see that the NYT asked this, so I thought for sure there would be a huge amount of discussion about this on the Internet. And sure enough there were 125 blogs written about this article, and I read through every single one of them to see what they said. And the funny thing was, not a single one of them mentioned this, even though it was sort of the punchline of the whole article. Everyone else just talked about NCLB and charter schools, even though these were subordinate issues to the main theme.\r\n\r\nFor the curious, here is what the NYT article actually said:\r\n\r\n*The issue was complicated by the fact that there are really two overlapping test-score gaps: the one between black children and white children, and the one between poor children and better-off children. Given that those categories tend to overlap — black children are three times as likely to grow up in poverty as white children — many people wondered whether focusing on race was in fact a useful approach. Why not just concentrate on correcting the academic disadvantages of poor people? Solve those, and the black-white gap will solve itself.*\r\n\r\nThat is, because poor children are much more likely to be black, eliminating the achievement gap between rich and poor should greatly reduce the black-white achievement gap.\r\n\r\n*The disadvantages that poverty imposes on children aren’t primarily about material goods. True, every poor child would benefit from having more books in his home and more nutritious food to eat (and money certainly makes it easier to carry out a program of concerted cultivation). But the real advantages that middle-class children gain come from more elusive processes: the language that their parents use, the attitudes toward life that they convey.*\r\n\r\nThis is pretty self-explanatory, and there are a bunch of studies to back this up. So if we believe the NY Times explanation here, bad parenting is responsible for the fact that only 12% of black kids and 39% of white kids are able to read at grade level. Presumably this comes from ignorance, and not malice, but still...\r\n\r\nAnd finally:\r\n\r\n*Can the culture of child-rearing be changed in poor neighborhoods, and if so, is that a project that government or community organizations have the ability, or the right, to take on?*\r\n\r\nDoes the government have the right to change the way parents in poor neighborhoods raise their children? And since, as stated above, the way to fix the black-white achievement gap is to fix the poor-rich achievement gap, does the government have the right to change the way many black parents raise their children? Let's call it compulsory affirmative action.\r\n\r\nThe fact that the NYT raised this question was HUGE, and the fact that out of 125 blog posts no one even mentioned it leads to believe that while many people may be literate to the level of being able to read the individual words, they may not be fully functionally literate if they were able to miss the central argument.\r\n","link_id":"t3_v1a2","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166305646,"score":5,"ups":5,"author_flair_text":null,"author":"Alex3917","edited":false,"id":"cv1ys","parent_id":"t1_cv1xn","gilded":0,"retrieved_on":1473808716,"distinguished":null,"timestamp_epoch":1566236770,"message_id":"32820-9962385c-9aa4-4386-829e-8ba7efb9e80d-1566236770"}