{"controversiality":0,"body":"I agree with foxyvixen.  The scenario seems very unlikely.\r\n\r\nOnce again, the media glosses over the facts to shoot for sensationalism.  [Here](http://pogo.org/p/homeland/hl-061201-bodman.html) is the full letter from the Project on Government Oversight (POGO) on the issue.  The letter describes several safety issues at the Pantex plant, but they are more mundane than near-explosions, like long hours, fatigue, and production goals.  \r\n\r\nOf note, the letter describes the warhead in question as a 1965 model, so it's not exactly modern, and therfore more prone to an accidental detonation.\r\n\r\nThat being said, it's much more likely that had an accident occurred, it would have been some sort of partial nuclear detonation or a radiological incident, just considering the geometry considerations of nuclear weapons.\r\n\r\n[Supermike's statement](http://science.reddit.com/info/v1wz/comments/cv2av) below about an overworked employee seems to be pretty close to the mark.  The POGO letter was prompted by an [internal Pantex letter](http://pogo.org/m/hsp/hsp-LetterToPantex-11072006.pdf) from an anonymous group of workers to the Pantex Board of Managers.  It raises many serious saftey concerns, but again, most of them are more mundane (leaking roofs, slick surfaces, long work hours, safety department reorganizations, etc.) than the headline grabber \"near-miss.\"\r\n\r\nSafety at nuclear weapons plants is of paramount importance.  I'm certain that many, if not all, of the concerns in the employees' letter have merit and deserve serious attention.  If the conditions are half as bad as what the letter describes I'm very worried.\r\n\r\nBut in this case the media missed the real story in pursuit of the attention getting headline.","stickied":false,"link_id":"t3_v1wz","subreddit_id":"t5_mouw","subreddit":"science","created_utc":1166352187,"author_flair_css_class":null,"score":3,"ups":3,"author":"emiller40","author_flair_text":null,"id":"cv3li","parent_id":"t1_cv299","edited":false,"gilded":0,"retrieved_on":1473808748,"distinguished":null,"timestamp_epoch":1566236771,"message_id":"33687-2d37ecb9-1e94-406e-93e1-3df1329a56fc-1566236771"}