{"subreddit_id":"t5_6","link_id":"t3_taej","stickied":false,"body":"How would the society function? Would it be owned by the corporation that built it, or maybe the corporation that built it would sell ownership rights to settlers, creating a kind of universal capitalist/communist democracy? Would a government build it (doubtful, given the evidence from, say, the Big Dig)? Going back to the corporate model, would the entire structure be run by the same toroid management company? Or would each individual, or block of individuals, be free to hire their own management company? \r\n\r\nWhat's the economic justification for such a costly structure? I can think of two: land is at such a premium that it's profitable to build such a thing or we discover some industry that is highly profitable and can only be done in space. The first I consider highly unlikely, given the predicted stabilization in the growth of the human population on earth. So we are left with specialized space industry as its reason for being. \r\n\r\n\"The fun of being in space\" or \"species insurance\" will only become viable reasons for building such things if the cost of building comes down by several orders of magnitude from where it is now. Still, it might not be substantially more expensive than, say, the war in Iraq. $1 trillion under the control of a single group of people is pretty much like magic, but our unimaginitive politicians can't think of anything better than a war to use it on. \r\n\r\nIn either case I imagine a two-tier society would exist: the highly skilled technical people required to run the structure and a vast underclass of hair-stylists, menial laborers, and etc. that provide the kinds of services that there is always demand for and a large supply of less-skilled people to provide at a low price. Barring that, the society might revert to a \"cottage-industry\" economic model where people are much less specialized, although I consider this much less likely as the population size increases.","controversiality":0,"score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165078923,"subreddit":"reddit.com","edited":false,"id":"ctcpu","parent_id":"t3_taej","author":"[deleted]","author_flair_text":null,"distinguished":null,"retrieved_on":1473807568,"gilded":0,"timestamp_epoch":1566236759,"message_id":"3375-4f9188ba-7cec-4645-9916-14f9b574bd10-1566236759"}