{"author_flair_text":null,"author":"lifeofliberty","edited":false,"id":"ctcq6","parent_id":"t3_tbyh","gilded":0,"retrieved_on":1473807568,"distinguished":null,"controversiality":0,"body":"Having used to be a Christian evangelist for twenty years, I can tell you that I never once met anyone who was *truly* concerned about \"saving others\", in the same way, as you would be if you had come acrossed a potential suicide victim.\r\n\r\nHaving experienced both situations, the **urgent immediacy** that you feel, and overwhelming concern for a imminent suicide is far, far different.  You're quite literally bowled over with concern and even willing to endanger your own self to stop it, somehow.\r\n\r\nChristian \"soul saving\" however, isn't based upon selfless concern.  It's based on *selfishness*. When you wipe away all the dross and phony arguments, the concern the Christians feel is actually for **themselves.** While they claim they are **not** trying to earn points with their desert sky-god by their actions, they in fact *are*, but they won't admit it.\r\n\r\nNow, I'm talking about the \"stranger that we all pass by\", like in the atheist story above.  The selfish-concern Christians have for strangers is expressed in everything they do, including soup-kitchens, evangelism, missions, and even oveseas work in third world countries.  People that we do not know *concern* us, as Christian, *simply because they are \"unsaved\"*.  Otherwise, \"we\" really don't care.\r\n\r\nThe proof of this isn't (as always) in the words that Christians speak, but in their actions.  The soup-kitchens, for example, are a joke. If you really want to help the destitute, invite them **home** and help them for far more then a single meal.  Give them a job, teach them how to help themselves.  **Buy** them a car, drive them to work, stand with them as they struggle to get back up on their feet.  But don't treat them like cattle to be branded, \"saved\" after they've listened to your sermons and \"accepted\" Jesus.\r\n\r\nThey will also discard \"one of their own\" from their own midst when they \"break ranks\" (question doctrine, fail to come to church, become \"worldly\", etc).  Just like any clique found anywhere else, Christians have pecking orders in their churches too, there's always \"lower class\" members that aren't \"well thought of\" or invited to functions or considered really \"saved\" or \"shunned\" because of the favoritism and even private envy that goes on.\r\n\r\nOf course, the hypocrisy is astounding, but it's true, nonetheless.  Christian \"concern\" really revolves around a secret sin - **pride**.  *\"See God, aren't I doing good works?\"*  But you will rarely get them to admit it.  \r\n\r\nSo don't bother, just watch their \"good works\" and their favoritism and their actions in action.  Like the Pharasee's of old, they wear their faith on their sleeves and only concern themselves with what can be seen by others.  Everything from church functions, church services, public tithing and \"soul saving\" is done for the public viewing and \"praise\".\r\n\r\nThere are others, who are not so visible to the public eye (and importantly, to each other), concern themselves by use of double-standards and the secret sin of pride.  Their acts of charity are based not on real concern for the *actual welfare* of others, but on racking up points with their sky-god.\r\n\r\nIf Christians were truly concerned about the welfare of others, like you really are when you are thrust upon a suicide, then your own safety and well-being (and status) isn't even in your own mind.  You will do anything at all to prevent a tragedy.  Nor do you play favorites, or grandstand, or draw any attention to yourself, or act like your \"faith\" is in \"competition\" with others (go examine these ridiculously gaudy churches if you don't think that this is a competition or how people dress).\r\n\r\nThe Christian hypocrisy of their faith, their actions, and even in their belief system is appalling to behold. It one of the reasons I quit and abandoned Christianity (there are more).\r\n\r\nI have found more **faith** outside of the Christian world, then within. I have found far more honesty and integrity outside of the Christian world then within.  And I have found far more real, sincere compassion and concern outside of the Christian world then within.  And none of these people attempted to **browbeat** me into submission to their capricious demands with a dusty book full of contradictions and errors.  What then, did I, or **anybody else** need the Church for?\r\n\r\nI do not believe in a desert sky-god anymore, but that's beside the point.  I do believe in compassion and concern, but I'm no longer frightened (or frightening) people into \"obeying God\" as dictated by a distorted, contradicting set of \"interprative instructions.\"\r\n\r\nAm I an atheist?  Who the fuck cares?  It's a brand I don't need and it just pisses these fools off.  That can be fun, but frankly, it's tiring.  You cannot convince those that *want* to believe ancient lies and fables what is provably false, because common sense and reasoning have escaped them.  I don't even bother anymore.\r\n\r\nNow downmod the living hell out of this post!  Show your bias, your superficial understanding of how it really works in the Christian world and your utter failure to perceive the hidden \"sins\" of your own human heart.\r\n","stickied":false,"link_id":"t3_tbyh","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165079161,"author_flair_css_class":null,"score":15,"ups":15,"timestamp_epoch":1566236759,"message_id":"3381-4cd05609-156a-4f3a-a987-35d9066d0119-1566236759"}