{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v1el","controversiality":0,"body":"It was worked out after the war that the UK was safe from invasion, the germans would have failed before they even got to Englands first inland line of defense.\r\n\r\nHowever you're right, if the German navy hadn't been contained by the Royal Navy and the RAF hadn't got air superiority even Stalin couldn't have succeeded against Hitler, but it is a well unknown fact that Japan surrendered in response to Russia taking several of its islands in days when it took the Americans months and they knew they would be treated better by the Americans than by the Russians. The nukes had nothing to do with it, that only helped unite the Japanese into fighting harder.\r\n\r\nFinally his point 3 is complete bull crap. First: The Russians won over the Germans because they used nature against them, they were all prepaired to fight in sub-zero temperatures but the Germans weren't so when the Russians finally faught back the Germans was having to put up with frost bite just to fire their guns.\r\n\r\nSecond: Military superiority is still the biggest part, the UK had a failed economy and propoganda wasn't the one that got the Brits united it was just being British that did it. As far back as history goes the four cultures in the UK faught back against every invasion and gave the Romans a repeated run for their money despite being far inferior. As Sun Tzu taught, and this is the lesson, valour is worth more than training. Also another lesson is, don't try to invade someones homeland as they'll fight with tooth and nail, when your troops will only fight with a bayonette.\r\n\r\nThird: Heroes. In WWII the Allies and Russians had men who went way beyond the call of duty and despite if they win or lose, as long as the people get to hear about it back home this is a major boost to a peoples valour. When one person gives their life for others it makes people look at the situation differently, and Germany didn't have many of these because they got discouraged from doing it not rewarded so eventually a discontented public (most didn't support the Nazi's, just didn't care) gave in.","score":-1,"ups":-1,"created_utc":1166364905,"author_flair_css_class":null,"subreddit":"reddit.com","edited":false,"parent_id":"t1_cv30e","id":"cv3y1","author_flair_text":null,"author":"electromagnetic","distinguished":null,"retrieved_on":1473808755,"gilded":0,"timestamp_epoch":1566236771,"message_id":"33825-ec3a86ba-b1b1-4fa7-bc6c-dd6aa35bb123-1566236771"}