{"distinguished":null,"retrieved_on":1473808758,"gilded":0,"id":"cv44s","edited":false,"parent_id":"t1_cv41z","author_flair_text":null,"author":"adrian","score":1,"ups":1,"created_utc":1166370190,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_v38q","controversiality":1,"body":"Pica, for all your claims of intellectual independence, you are woefully content to absorb Duke's garbage without question.\r\n\r\nYou point to Duke's article claiming that people are \"smearing him\", in other words.  His article says:\r\n\r\n&gt;Here is proof of the lies of the Zionist-influenced media.\r\n\r\n&gt;It is being reported around the world that in my speech in Tehran that I stated that the “gas chambers did not exist.” You can read and even listen to my speech right here on www.davidduke.com.\r\n\r\nI searched on Google News for 'David Duke \"gas chambers did not exist\"' and I did not find a single source claiming he said that at the conference.  I searched for 'David Duke gas chambers' and was similarly unsuccessful, managing to find only the headline for an article that appears not to exist any more.\r\n\r\nSo Duke is creating a false controversy.  That, of course, is the smallest of all the things that are wrong with him, a man that is the worst kind of racist:\r\n\r\n&gt;The differences between Black and White go far deeper than simply the color of skin. They include differences in the most important part of the anatomy, the part that makes us human: the very brain itself. Any forensic investigator can differentiate between a White or Black brain. Among the human races the differences go right down to the soul.\r\n\r\nThis is the man you're defending: someone who thinks white people and black people have different souls.  That kind of thinking is the basis for the genocide that displayed itself most horrifically in the Holocaust.\r\n\r\nHolocaust denial - or revisionism, as Duke likes to call it - is an assault against truth and memory, the two most important weapons against genocide.  By seeking to dull or take away these weapons, people like Duke contribute to the chances of it happening again even as they denigrate the victims.\r\n\r\nIf that's the company you want to keep, I'm glad I don't know you.","timestamp_epoch":1566236771,"message_id":"33903-2f083f9b-881a-4510-9010-e81d55de9544-1566236771"}