{"gilded":0,"retrieved_on":1473808768,"distinguished":null,"author_flair_text":null,"author":"[deleted]","id":"cv4og","edited":false,"parent_id":"t1_cv46g","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166381447,"ups":0,"score":0,"controversiality":0,"body":"Good for you, you're an atheist. Are you honestly telling me that if you had the opportunity to ask Richard Dawkins one question, it would be \"what if you're wrong?\" If not, then whether your believe in god and whether you think his response was appropriate is irrelevant to my statement that it's silly for one atheist to challenge another with that statement.\r\n\r\nHers was a stupid question. His was not a stupid answer. It's not really an \"answer,\" at all, since, as you yourself have pointed out, it's not really an answerable question. What it is is a reasonable response from a reasonable man. With a bit of rhetorical flair that apparently has your panties in a bunch, he pointed out what a stupid question she was asking, for reasons not limited to the fact that it's a question equally applicable to herself, the consequences of which do not bother her in the slightest, since her faith is so unflappable. Granted, he is equally unbothered by the consequences of his potential wrongness, but he doesn't go around trying to play the boogyman about it like this girl does.  \r\n\r\nHe does, as a matter of fact, acknowledge that he could be wrong. \"Anybody could be wrong. We could all be wrong about the flying spaghetti monster and the pink unicorn and the flying teapot.\" \r\n\r\nYou bring up the truth of the situation, which is pretty applicable to people on either sides; as a general rule, one only preaches to the choir, and is not going to sway very many people one way or the other. (Although I suspect, and I admit I am biased and have no empirical evidence for this, that the atheists are winning more converts than the theists)","link_id":"t3_uzof","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236771,"message_id":"34209-73ec59b9-5e85-4b25-ac87-89115e5bdecd-1566236771"}