{"parent_id":"t3_v4ik","id":"cv4x8","edited":false,"author":"ricercar","author_flair_text":null,"retrieved_on":1473808772,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_v4ik","subreddit_id":"t5_2fwo","body":"He says that \"concentrating on programming languages [use of] is a red herring.\"  And that the most important facet of software development is design.\r\n\r\nWell perhaps, but tell me, what language do you design software in?  It needs to be a formal, specified language which expresses computational concepts on a high level.\r\n\r\nIn other words, a high-level programming language.  How can that be a \"red herring\" then?\r\n\r\nObviously, this article is written 10 years ago and many things have changed.  Java, the quintessential \"dull knife,\" is one of, if not the, most popular programming languages in use.  The other, C++, makes it difficult NOT to cut your hands.  Neither of them are anything approaching a jewel-like system, as they have both evolved into their current situations.\r\n\r\nGood design is important, but there is a fundamental difference between software engineering and mechanical engineering: in software, design and implementation are both performed via formal systems.  \r\n\r\nMore concretely, the job of a compiler is to take some high-level design and automatically render it into \"machine code.\"  He argues for an additional step, which invokes the human programmers as such a compiler.\r\n\r\nThe author is clearly a fan of Wirth and his clean and simple imperative style of programming.  It is this line of thinking which requires the separation of design and implementation, because said imperative style cannot express design on a high level.\r\n\r\nTherefore, this article, in that light, seems to be a condemnation of the [in]capabilities of imperative languages; though it was probably not intended to be such.\r\n","controversiality":0,"created_utc":1166386128,"author_flair_css_class":null,"score":4,"ups":4,"subreddit":"programming","timestamp_epoch":1566236771,"message_id":"34357-c2a8b5df-c90d-4f1b-a26d-bfaadc87f211-1566236771"}