{"distinguished":null,"retrieved_on":1473808775,"gilded":0,"id":"cv52a","edited":false,"parent_id":"t1_cv4v3","author_flair_text":null,"author":"cbtf","score":26,"ups":26,"author_flair_css_class":null,"created_utc":1166389789,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_v4ak","stickied":false,"controversiality":0,"body":"Maybe this will help you understand, though I doubt it.\r\n\r\n\"Same-sex marriage would start us down a \"slippery slope\" towards legalized incest, bestial marriage, polygamy and all kinds of other horrible consequences.\" A classic example of the reductio ad absurdum fallacy, it is calculated to create fear in the mind of anyone hearing the argument. It is, of course, absolutely without any merit based on experience. If the argument were true, wouldn't that have already happened in countries where forms of legalized gay marriage already exist? Wouldn't they have 'slid' towards legalized incest and bestial marriage? The reality is that a form of gay marriage has been legal in Scandinavian countries for over many years, and no such legalization has happened, nor has there been a clamor for it. It's a classic scare tactic - making the end scenario so scary and so horrible that the first step should never be taken. Such are the tactics of the fear and hatemongers.\r\n\r\nIf concern over the \"slippery slope\" were the real motive behind this argument, the advocate of this line of reasoning would be equally vocal about the fact that today, even as you read this, convicted murderers, child molesters, known pedophiles, drug pushers, pimps, black market arms dealers, etc., are quite free to marry, and are doing so. Where's the outrage? Of course there isn't any, and that lack of outrage betrays their real motives. This is an anti-gay issue and not a pro marriage issue.\r\n\r\n\r\n\r\n\r\nfrom: http://www.bidstrup.com/marriage.htm (which is a great resource that offers counter arguements that make sense to those that the homophobes usually throw up :) )","timestamp_epoch":1566236771,"message_id":"34429-436fe5d5-0ad6-4b0d-85e7-e10eccb6128c-1566236771"}