{"parent_id":"t1_cv2nr","edited":false,"id":"cv56h","author":"lemmikins","author_flair_text":null,"retrieved_on":1473808778,"distinguished":null,"gilded":0,"link_id":"t3_uvjp","stickied":false,"subreddit_id":"t5_6","body":"&gt; People are sentient, animals are not.\r\n\r\nI think you need to look up what [sentient](http://dictionary.reference.com/browse/sentient) means.  As Inigo Montoya says, ...\r\n\r\n&gt; Thanks for just trivializing past human rights offenses.\r\n\r\nYou completely misunderstand the entire idea.  If you think animals are worthless, then the comparison may seem trivializing to you -- but I value animals very highly, hence the comparison is not trivializing from my viewpoint.  Let me simplify it for you:\r\n\r\n\r\nYou think: billions_of_animals_killed.importance=0; \r\nThen hear: slavery.importance=animals.importance\r\n\r\nI think: slavery.importance=10; \r\nThen say: billions_of_animals_killed.importance=slavery.importance\r\n\r\n\r\n&gt; Meat is not the cause of heart disease.\r\n\r\nThe \"American Diet\" is typically meant to include a large proportion of animal products, with high levels of cholesterol and saturated fat.  This not only includes meat, but milk, eggs, cheese, and so forth.\r\n\r\nBut that's not really the point, any more than cannibalism is wrong because of high cholesterol.\r\n\r\n\r\n&gt; but I respect a person's decision not to eat meat because of them. I'm not debating their religion, I'm debating your misguided reasons for not eating meat.\r\n\r\nSo you're saying you're inconsistent.  You accept what you say are irrational religious reasons, without saying why -- so, presumably, because you uncritically accept irrational religious beliefs due to being accustomed to living an unexamined existence.\r\n\r\nI wouldn't beat, kill, and eat YOUR dog any more than I would do that to MY dog, and I extend the same feeling toward cats, and pet birds, and potbellied pigs, and pink pigs, and farm birds, and cows, and so on.\r\n\r\nYour dog isn't important just because he's \"yours\"; he has basic rights like the right to live and the right not to be abused because he's a sentient animal.\r\n\r\nThe same goes for chimpanzees, dolphins, elephants, etc.\r\n","controversiality":0,"author_flair_css_class":null,"created_utc":1166392025,"score":3,"ups":3,"subreddit":"reddit.com","timestamp_epoch":1566236771,"message_id":"34499-c46d4194-f4fc-486f-80a0-7ee9d37f724c-1566236771"}