{"distinguished":null,"retrieved_on":1473808782,"gilded":0,"id":"cv5ef","edited":false,"parent_id":"t1_cv5cd","author_flair_text":null,"author":"lemmikins","score":5,"ups":5,"created_utc":1166396393,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_uvjp","controversiality":0,"body":"&gt; but killing an animal humainly is not. It is the natural process. \r\n\r\nFirst off, factory farming is anything but humane.  The majority of meat is not raised on idyllic farms with green pastures; it comes from gigantic, polluting, cruel cattle, hog, and chicken operations.\r\n\r\nJust a few examples:\r\nhttp://www.cok.net/investigations/\r\n\r\nAs for \"the natural process\", that phrase is intellectually vapid.  You might as well say that eyeglasses are not the natural process.  Getting pregnant at 13 and dying at 30 was the natural process for humans for a long time.  Antibiotics, emergency rooms, and flush toilets all argue against the \"natural process\".\r\n\r\n&gt; and I agree I believe that an injustice against a human is far greater than any multitude of injustices against animals. \r\n\r\nSo the most minor injustice against a human is far greater than the most horrible thing that could happen to your pets?\r\n\r\n&gt; There are both good and bad cholesterols. For example my doctor suggested for me to eat a lot more fish because it is high in good cholesterol.\r\n\r\nI'm aware of HDL and LDL.  That your doctor would suggest that implies that you have high LDL levels.  The point of fish is the action of fish oil, not the amount of cholesterol in the fish itself.  So you have high cholesterol and are ignorant of the effects of your diet and even the mechanism of a proposed change in your diet, yet you presume to tell ME about what's healthy and what's not?\r\n\r\nI'll tell you something else.  Fish in general contains the highest concentrations of environmental contaminants of any food.  You're exposing yourself to more mercury, PCB/Dioxin,  and pesticides from run-off plus banned pesticides that linger in the aquatic foodchain like DDT, for starters.\r\n\r\n&gt; That arguement is an ad hominem\r\n\r\nLook who's talking!  But I didn't say your other reasons are invalid because some of your arguments are flawed, I said your flawed arguments were flawed.  You don't really understand what \"ad hominem\" means in the context of fallacies in argumentation.\r\n\r\n&gt; Rights are institutionalized by a society.\r\n\r\nThe Constitution recognizes that we have inalienable rights which exist INDEPENDENTLY of government.\r\n\r\n&gt; but currently under both national and international laws animals don't have rights.\r\n\r\nThat one is easy to disprove.  In fact, pets DO have certain basic rights, which is the basis for animal cruelty statutes.  You might have heard of such a concept.\r\n\r\n&gt; It hasn't been resolved in millennium and I don't expect it to be resolved in my lifetime.\r\n\r\nThat's what people thought with slavery too.  Heavier-than-air flying machines.  Moving pictures.  Women's rights.  You're basically saying that society can move ahead after you die -- which is always true of people who stand in the way of progress.\r\n\r\nIn fact, science mostly moves ahead not because people change their minds, but because the old people, the institutions, who stubbornly stuck to the old paradigm, died off and thus ended opposition for ideas like Quantum Mechanics (same is true for medicine).\r\n","timestamp_epoch":1566236771,"message_id":"34628-fe67f23e-ba66-4fb2-9b30-ec28932ad585-1566236771"}