{"edited":false,"id":"cv5ep","parent_id":"t1_cv5aj","author":"nostrademons","author_flair_text":null,"retrieved_on":1473808782,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_v4ak","subreddit_id":"t5_6","body":"*Reductio ad absurdum* means different things when used in mathematics and in this context.  In mathematics, you're comparing two *positive* statements.  For example, [one proof](http://en.wikipedia.org/wiki/Irrational_number#The_square_root_of_2) that the square root of 2 is irrational goes like this:\r\n\r\n1. Assume that \\sqrt{2} is a rational number. This would mean that there exist integers a and b such that a / b = \\sqrt{2}.\r\n2. Then \\sqrt{2} can be written as an irreducible fraction (the fraction is shortened as much as possible) a / b such that a and b are coprime integers and (a / b)2 = 2.\r\n3. It follows that a2 / b2 = 2 and a2 = 2 b2.\r\n4. Therefore a2 is even because it is equal to 2 b2 which is also even.\r\n5. It follows that a must be even (odd square numbers have odd square roots and even square numbers have even square roots).\r\n6. Because a is even, there exists an integer k that fulfills: a = 2k.\r\n7. We insert the last equation of (3) in (6): (2k)2 = 2b2 is equivalent to 4k2 = 2b2 is equivalent to 2k2 = b2.\r\n8. Because 2k2 is even it follows that b2 is also even which means that b is even because only even numbers have even squares.\r\n9. By (5) and (8) a and b are both even, which contradicts that a / b is irreducible as stated in (2).\r\n\r\nThe contradiction comes from comparing two *facts* that are logical consequences of our premise; since they are incompatible, the premise itself must be flawed.\r\n\r\nCompare that with the statement that sparked the grandparent:\r\n\r\n&gt; So, seriously, how long until we can marry family members, multiple wives/husbands, and animals?\r\n\r\n&gt; Oh, and have sex with 14 years olds. If you can marry them when they're 14, you should certainly be able to have sex with them.\r\n\r\nThe argument here runs like this:\r\n\r\n1. If gays can marry, siblings, polygamists, bestialists, and pedophiles will want to too.\r\n2. This would be undesirable\r\n3. Therefore, gays should not be allowed to marry\r\n\r\nI'd actually consider this to be an [appeal to consequences](http://en.wikipedia.org/wiki/Appeal_to_consequences) fallacy, but it's fallacious just the same.  For one, you're comparing positive and normative statements, yet it's notoriously difficult (some would say [impossible](http://en.wikipedia.org/wiki/Naturalistic_fallacy)) to go from a statement of value to a statement of fact.  For two, your premise hasn't been proved at all!  There's no evidence for statement #1 other than it having been asserted.","controversiality":0,"created_utc":1166396480,"author_flair_css_class":null,"score":11,"ups":11,"subreddit":"reddit.com","timestamp_epoch":1566236771,"message_id":"34630-4b18ed8b-34c2-4aa5-b1c3-4e8ab1339a07-1566236771"}