{"controversiality":0,"body":"&gt;No but you are a part of a powerful lobby that influences US policies in palestine.\r\n\r\nNo, no I am not.  My only lobbys are the ACLU, the Democratic party, and the Nature Conservancy (are they a lobby really?), they are the only political organizations that have ever gotten a red cent from me.\r\n\r\n&gt;It's due to you and your (most likely) unquestioning support for everything israel does that prevents the US from acting like an honest broker for peace in the middle east.\r\n\r\nI think Israel's behavior is reprehensible, and the U.S. certainly needs to grow a pair when dealing with them.  Certain extremist Zionists have far too much sway in Washington.  But even without them the Christian fundie loons have far more sway and ensure that nothing will be done, since they really want those end times to come.  \r\n\r\nMany Jews think Israel's behavior is reprehensible.  Going around painting all Jews with a broad brush and saying that there are \"excellent reasons to hate Jews,\" is reminiscent of past anti-Jewish rhetoric that wound up causing some well known horrible effects, and sorry, Godwin's law doesn't apply when you start rationalizing hating Jews.  Using that kind of rhetoric and lumping all Jews together with Israeli policies is extremely counter-productive since it alienates Jews who might otherwise be more sympathetic and actually tends to drive them to be defensive of Israel.  A disturbing number of my older relatives used to be party line Democratic voters with general liberal sympathies have gotten so freaked out by some of the left's conflation of Israel with the Jews and their attacks that they have moved politically to the right.  Which is seriously twisted and depresses me to no end.  Many of the more crazy neo-Cons were far leftist Jews who hitched their wagon with the Republicans due to alienation from the left and open arms of the Right.  But I can understand their motivations (even if I disagree) when I look at the horrible rhetoric that you and some (though thankfully not all) on the left are spouting.  I thought that leftists were supposed to recognize that stereotypes were inherently wrong and counter to any positive political movement.\r\n\r\n[edit - added]\r\n\r\nIt's bad enough that the Jewish hardliners dishonestly conflate criticism of Israel as anti-semitism, but it's worse to me to see folks on the left conflate being a Jew with being a Zionist hardliner.  I expect conservatives to be dishonest and crude, I am still hopeful that leftists can be more thoughtful.\r\n\r\n[edit - added again]  \r\n\r\nOne other thing to keep in mind is that Jews still vote overwhelmingly Democratic.  The numbers I saw from the 2006 elections for Jewish voters from exit polls were roughly 85% Dem. to 15% Rep.\r\n\r\nThere are far more op eds that I have seen in prominent  Israeli papers vilifying the policies of the Likud and Kadima than in the U.S., and if you look at the results of elections in Israel it's clear that not all Jews in Israel are hardliners.  In fact most polls I have seen show that many (though not enough) Israelis want to see an end to the occupation.","link_id":"t3_v1y6","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166399211,"score":6,"ups":6,"author_flair_text":null,"author":"[deleted]","edited":false,"id":"cv5k2","parent_id":"t1_cv5gn","gilded":0,"retrieved_on":1473808785,"distinguished":null,"timestamp_epoch":1566236771,"message_id":"34714-e8eaa3db-d4f4-492b-8aec-b2f871493517-1566236771"}