{"created_utc":1164931859,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_svae","subreddit_id":"t5_6","body":"God\r\n\r\nThe possibility of intelligent design is the most convincing reason I know of to at least not think questions about God's existence to be pointless.  It seems strange that we have no problem assuming intelligent design if we think something could have been made by a human, but then throw intelligent design as an option out the window when it comes to things that could not have been made by a human.  This approach just begs the question about naturalism.  \r\n\r\nHowever, I would accept methodological naturalism if intelligent design was either prima facie incapable of providing useful knowledge, or was very unlikely to.  Yet, this is blatantly wrong.  If we did not use the assumption of intelligent design in our everyday lives then society would completely fall apart.  So, if it can provide useful information in everyday life, just as looking for naturalistic explanations for everyday events does, then I see no reason why this can't be true on a greater scale.  \r\n\r\nIn fact, it could be more useful than naturalism.  For example, see this excellent article explaining the intelligent design underpinnings of the \"Wealth of Nations.\"\r\nhttp://www.acton.org/publicat/m_and_m/new/article.php?article=8\r\nI am not especially well read in economics.  However, from what I understand, \"Wealth of Nations\" is the ideological basis for our modern capitalistic system that seems to work much better than more recent secular systems, such as communism.  If you take a brief look at the very long article, you'll notice a striking difference between the assumptions Smith makes about human nature and those Marx makes, and that Smith's assumptions are firmly rooted in the assumption of intelligent design whereas Marx assumes there are only mechanical causes at work in nature. \r\n\r\n--------\r\nMorality\r\n\r\nMorality is essentially rational self interest.  Thus, it takes into account both avoiding what is bad and getting what is good.  However, bad and good change depending on whether you believe people have eternal souls or are just another type of animal.  Believing people have souls affects morality in two ways.  First, and most importantly, the extent to which you truly believe this impacts how inherently valuable you think people really are.  Second, if these souls are created, then their creator will punish those who abuse the souls.\r\n\r\nHowever, morality that is merely a human construct and is contrary to people's inherent value deserves to be broken.  Neither you nor I should ever let anyone rule over us for their own benefit.","controversiality":0,"retrieved_on":1473807441,"distinguished":null,"gilded":0,"id":"ct5x8","edited":false,"parent_id":"t3_svae","author_flair_text":null,"author":"yters","timestamp_epoch":1566236758,"message_id":"35-263aa3ff-8b8b-4435-9465-68736f89bd97-1566236758"}