{"author_flair_text":null,"author":"crake","parent_id":"t1_cv3y1","id":"cv643","edited":false,"gilded":0,"retrieved_on":1473808795,"distinguished":null,"controversiality":0,"body":"First point: mostly correct.  In truth, the Germans should have defeated the Russians before the fall of winter but they invaded in June of 1941 instead of in April--even so, they were within 30 miles of Moscow by the fall of winter (this was because Germany was distracted by a spring campaign in the Balkans to secure Greece).  \r\n\r\nSecond point:  The better part of England was successfully conquored by the Romans.  Then most of the island was successfully conquored by the Norsemen.  Then the entire island was successfully conquored by the Normans in 1066.  The English successfully defeated the Spanish Armada in 1588, but only because the Spanish never actually invaded and thus this was a sea battle without a land invasion.  So if history is any guide, every land invasion of England has, to date, been successful.\r\n\r\nThird point:  Completely false.  The Russians had to put machine guns behind their advancing lines to keep them advancing.  Arguably the greatest general of the war was a German (Erwin Rommel).  Berlin was fanatically defended even while Germany was completely defeated in April-May 1945.  The real truth is that history is written by the victors, and when you watch \"Pearl Harbor\" or \"Saving Private Ryan\" fifty-thousand times, you begin to believe that one side was made up of heros like Tom Hanks and the other was made up of fodder for the heroic acts of the heros.  The real truth is that the color of a mans uniform has nothing to do with his fighting ability; the Germans of World War II were both better armed and better trained than their counterparts on the side of the Allies.  In the end, superiority in numbers of men available and materials won the war for the Allies, and only then just barely.","stickied":false,"link_id":"t3_v1el","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166412103,"author_flair_css_class":null,"score":0,"ups":0,"timestamp_epoch":1566236771,"message_id":"35017-a9eae070-761c-483e-8b7e-37468751c81f-1566236771"}