{"author":"dfranke","author_flair_text":null,"parent_id":"t1_cv5b4","id":"cv67p","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808797,"controversiality":0,"body":"Muslims didn't invent astronomy.  Not even close.  The Greeks, the Babylonians, and the Chinese had thriving scientific communities studying astronomy long before Islam existed.  The Arab world kept a lot of astronomical knowledge alive during the Middle Ages, and created the most accurate star catalog to date (the Toledo tables), but contributed virtually nothing to the advancement of theoretical understanding.\r\n\r\nEdit: ok, after some research on alcohol and chemistry, I can now conclude that you are full of shit on those counts as well.  From Wikipedia:\r\n\r\n&gt; Although the archives of chemical research draw upon work from ancient Babylon, Egypt, and especially Persia after Islam, modern chemistry flourished from the time of Antoine Lavoisier's discovery of the law of conservation of mass, and his refutation of the phlogiston theory of combustion in 1783. (Phlogiston was supposed to be an imponderable substance liberated by flammable materials in burning.) Mikhail Lomonosov independently established a tradition of chemistry in Russia in the 18th century. Lomonosov also rejected the phlogiston theory, and anticipated the kinetic theory of gases. He regarded heat as a form of motion, and stated the idea of conservation of matter.\r\n\r\nand:\r\n\r\n&gt; Chemical analysis of organics absorbed and preserved in pottery jars from the Neolithic village of Jiahu, in Henan province, Northern China, have revealed that a mixed fermented beverage of rice, honey, and fruit was being produced as early as 9,000 years ago. This is approximately the same time that barley beer and grape wine were beginning to be made in the Middle East. Recipes have been found on clay tablets and art in Mesopotamia that show individuals using straws to drink beer from large vats and pots.\r\n\r\n(While alcohol may have been first brewed in the Middle East, it was 8000 years before Islam.)","subreddit_id":"t5_6","link_id":"t3_v50i","stickied":false,"subreddit":"reddit.com","ups":6,"score":6,"author_flair_css_class":null,"created_utc":1166414483,"timestamp_epoch":1566236771,"message_id":"35082-40c29eef-ea51-47ee-a1a8-d5f5dd683e7a-1566236771"}