{"subreddit":"reddit.com","score":15,"ups":15,"author_flair_css_class":null,"created_utc":1166435156,"controversiality":0,"body":"60 Minutes writes: \r\n\r\n'\"What was the stated reason for keeping these documents out of the public eye for more than 60 years?\" Pelley asks.\r\n\r\n\"A respect for privacy of individuals was the most-often cited reason,\" Shapiro says. \"On the one hand, you had governments stating 'We’re protecting people’s privacy.' And on the other hand, you had those very people saying 'No, no, we want the material to be open.'”\r\nWhen Germany, last spring, became the last of 11 countries to agree, they began the process of opening the archive. It will take about a year.' (...)\r\n\r\nThis lets readers falsely believe that there were no real privacy issues and countries just stalled the opening of the archives for no good reason, or that there was some significance to Germany being the last to sign the accord.\r\n\r\nThe BBC writes:\r\n\r\n'\"Or take a case of a Catholic priest who denounces the deportations of Jews from the pulpit,\" Mr Jost said.\r\n\r\n\"He could be arrested by the Gestapo, and they could put in his file that he was molesting the choir boys.\"\r\n\r\nMany of the advocates of opening the files recognise these dangers.\r\n\r\n\"It's important to have regulations controlling access to this information,\" said Deidre Berger, head of the American Jewish Committee's Berlin office.\r\nThe agreement in Luxembourg promises adequate protection of personal data will be considered. Details of how this will work will be released later.'\r\n\r\nWhich tells us a lot more.\r\n\r\nThe BBC article also goes into more detail about the prisoner shootings on Hitler's birthday and explains that the records were slightly disguised.\r\n","subreddit_id":"t5_6","link_id":"t3_v6fl","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473808812,"author":"[deleted]","author_flair_text":null,"id":"cv71m","parent_id":"t1_cv6up","edited":false,"timestamp_epoch":1566236771,"message_id":"35492-838bd9c6-4c91-44b6-bb19-384bd380799b-1566236771"}