{"edited":false,"parent_id":"t3_v6h2","id":"cv7ff","author_flair_text":null,"author":"crake","retrieved_on":1473808819,"distinguished":null,"gilded":0,"link_id":"t3_v6h2","stickied":false,"subreddit_id":"t5_6","body":"The First Amendment doesn't protect any one person's right to be free from religion, it protects any one person's right to be free from a law, an act of Congress, respecting an establishment of religion, or or restricting the free exercise thereof.  The First Amendment protects this teacher's freedom of speech, which would be abridged by a law requiring him to remain silent under penalty of civil litigation.\r\n\r\nThat said, free speech does not mean speach without consequence.  In this case, the teacher was exercising his freedom to express himself in an inappropriate forum.  His conduct was clearly inappropriate and unbecoming of someone in his position. If this had been a discussion outside of class, he would have been absolutely within legal bounds, but because he was speaking on tax-payer time, he has neglected to do the job which he was hired for (teach history) and should be terminated.  \r\n\r\nIn my opinion, he should return his salary received for the class that he spent not teaching history to the district school board (or whatever authority signs his checks) because he didn't do the job that he was hired for.  Firing him for not doing his job is not an abridgement of free speech, it is a rightful consequence for failing to do the job for which one is hired.  \r\n\r\nI think this kid is courageous for coming forward, but he's not entitled to any money from anyone.  He is merely a whilstleblower, calling attention to a missuse of taxpayer money.  He should be rightfully commended for doing so, but he's not entitled to a payout for doing it.  The idea that his civil rights were violated is plain ludicrous.\r\n\r\nAlso, this teacher raises the \"have you ever witnessed evolution?\" question, supposedly to \"prove\" that evolution is only a \"belief.\"  Well, in truth, highschool students have witnessed evolution.  There is a reason Grandma needs a new flu shot every year--and it's not because God keeps sending new flu viruses.  Microorganisms perfectly demonstrate evolution in the lab, and those students that go on to study Microbiology in college (as I did) will discover in their first class that you can observe evolution in a petri dish in a single day, thus dispelling that tired argument.","controversiality":0,"author_flair_css_class":null,"created_utc":1166446567,"ups":23,"score":23,"subreddit":"reddit.com","timestamp_epoch":1566236771,"message_id":"35643-b79057cf-b3f6-4aa7-aa63-b3683cdd41d7-1566236771"}