{"id":"ctd5c","parent_id":"t1_ct9lw","edited":false,"author_flair_text":null,"author":"ApochPiQ","retrieved_on":1473807575,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_t9kv","subreddit_id":"t5_2fwo","body":"Professional; been programming for close to 15 years now. Started out as a freelance contractor and did the business/webdev circuit for a while until I got fed up with contracting. Did one \"real job\" full-time gig in shrinkwrap applications, but it was a pretty bad job, so most recently I've moved into game development.\r\n\r\nI started discovering the \"academic\" languages in that shrinkwrap gig. (I'm an unedumacationed high-school dropout, so I never got to see them in academia like everyone else.) It was partly the impossibility of using good tools at that job that prompted me to move on (C-with-classes/MFC in VC6.0 was the soup du jour at that company, which should say everything that needs to be said).\r\n\r\nFrankly, game development isn't much better. C++ is the dominator, with C still representing a huge block of legacy code. Transitions between _language_ technologies are very slow in this business. Since the majority of the market is on consoles, which basically only support C/C++, using one of the two languages is pretty much unavoidable. Often there's a Frankensteinian mixture of the two where legacy libraries are involved.\r\n\r\nFortunately, game development also tends to look quite favorably on multi-lingual software; using scripting languages for high-level logic is a technique mastered in the gamedev business. The closest thing to a nice functional language that I personally get to work with is Lua, but there's some potential to introduce a Lisp dialect or possibly even an ML dialect to the mix in the relatively near future.\r\n\r\nIf I had my wishes, we'd all be using OCaml, on some kind of spiritual-descendent of the Lisp machine. I don't really see that happening any time soon, though; I think it'll probably be at least a decade before we see FP becoming truly commonplace in mainstream development. I'm also rather worried that FP will get mangled and turn into mounds of crap code, the way OO morphed into that ever-damnable beast \"enterprise software\".","controversiality":0,"created_utc":1165087585,"author_flair_css_class":null,"score":4,"ups":4,"subreddit":"programming","timestamp_epoch":1566236759,"message_id":"3573-47855b8f-68b4-496e-8087-6a52df3ba778-1566236759"}