{"controversiality":0,"body":"Also \"My Cephei\" I assume refers to \"Mu Cephei\":\r\n\r\nhttp://en.wikipedia.org/wiki/Mu_Cephei\r\n\r\nAs far as the Betelgeuse question:\r\n\r\nhttp://en.wikipedia.org/wiki/Betelgeuse\r\n\r\n&gt; The name is a corruption of the Arabic يد الجوزا yad al-jawzā, or \"hand of the central one\". Jauza, the central one, initially referred to Gemini among the Arabs, but later referred to Orion instead. During the Middle Ages the first character of the name, y (ﻴ, with two dots under it), was misread as a b (ﺒ, with one dot under it) when transliterating into Latin, and Yad al-Jauza became Bedalgeuze. Then, during the Renaissance, it was theorized that the name was originally written as Bait al-Jauza, thought to mean \"armpit of the central one\" in Arabic, which led to the modern rendering as \"Betelgeuse\"; however, the actual translation of \"armpit\" would be ابط (\"Ibţ\").\r\n&gt;\r\n&gt; Because of its rich reddish color the star has frequently been referred to as the \"martial one\", and in astrology portends military or civic honors. Other names are:\r\n&gt;\r\n&gt;    * Al Dhira (the Arm),\r\n&gt;    * Al Mankib (the Shoulder)\r\n&gt;    * Al Yad al Yamma (the Right Hand)\r\n&gt;    * Ardra (Hindi, and name of Hindu Nakshatra),\r\n&gt;    * Bahu (Sanskrit),\r\n&gt;    * Besn (Persian) (the Arm),\r\n&gt;    * Gula (Euphratean),\r\n&gt;    * Ied Algeuze (Orion's Hand),\r\n&gt;    * Klaria (Coptic) (an Armlet)\r\n&gt;    * Yedelgeuse\r\n&gt;\r\n&gt; It is known as Shēnsùsì, the Fourth Star of the Constellation of Three Stars, in Chinese. The confusing name is due to the fact that the Constellation of Three Stars was originally composed of just three stars, all of them in the girdle of the Orion. Later, four more stars were added to this constellation, but the name remained unchanged.\r\n\r\nLastly, the final star is VV Cephei -- the resolution on the video almost makes it look like \"W\" instead of the two V's:\r\n\r\nhttp://en.wikipedia.org/wiki/VV_Cephei\r\n\r\nFurther, since VV Cephei is a binary system, the star represented on the video is actually VV Cephei A.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_v5xa","subreddit":"reddit.com","score":8,"ups":8,"created_utc":1166457135,"author_flair_css_class":null,"author":"sblinn","author_flair_text":null,"edited":false,"id":"cv82s","parent_id":"t1_cv80h","gilded":0,"distinguished":null,"retrieved_on":1473808832,"timestamp_epoch":1566236772,"message_id":"35949-9ad88172-83b2-4b70-b17f-407e5135aa58-1566236772"}