{"edited":false,"id":"cv84l","parent_id":"t1_cv7st","author":"hopeseekr","author_flair_text":null,"distinguished":null,"retrieved_on":1473808833,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v69d","body":"Per the law, all you *technically* have to do is write down *once* in a publication (such as reddit) that you renounce your american citizenship and then have this -- either by accident or intent -- brought to the attention of any one working at an consul or embassy.  Traditionally, one would take out a classified ad in a newspaper to state this (no, seriously).\r\n\r\nActually, so much as shouting in public within the ear (or have it recorded) of a U.S. federal employee that you renounce your citizenship is actually, per the law, liable to having your citizenship revoked.\r\n\r\nThe problem is if you do not have a secondary citizenship.  Then you become \"stateless\" and have intrinsically no rights *any*where* *except* the United Nations.  You could be sent to Gitmo, disappeared, whatever, *legally*...by any level of most governments.\r\n\r\nThis is how the guy who in Iraq burned his passport and said he renounced his citizenship on CNN actually lost his.  It's really fucking easy to lose, there are no appeals, no do-overs, and once you become stateless, it is harder than being an illegal alien, becuase no country will come to bat for you.\r\n\r\n(btw there was a man who revoked his U.S. citizenship due to the Vietnam Conflict in the 60s, only to be denied citizenship by France (due to U.S. political posturing).  Becoming stateless, he realized that he could be \"disappeared\" with impunity, so he started literally living inside the United Nations' lobby in New York.  He stayed there so long that after ~5 years, they actually bought a nearby office building (thus making it international land) and gave it to him.  He now helps other stateless individuals and is trying to get it recognized as an independent microstate... i wish I remembered his name).","controversiality":0,"score":7,"ups":7,"created_utc":1166457863,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236772,"message_id":"35977-dcdaa2ff-1122-40a1-ae5d-cb520620e7b6-1566236772"}