{"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166463995,"body":"In response to all the comments here that state religion is the root of all evil, etc, ad infinitum - I'm not exactly opposed to this point of view, but I did hear an interesting interview on NPR with Dr. Katharine Jefferts Schori, presiding Bishop of the Episcopalian church in the US, in which she states her vision of the church as being to benefit those less fortunate than ourselves.  She quotes the Archbishop of Canterbury from the 1940s in saying that (paraphrased) the Church is one of the only organizations to exist for the betterment of those who are NOT it's members.  \r\nI see this as kind of a revolutionary (for these times) point of view coming from Church leadership.  Not once in her vision for the mission statement did she mention God.  She sees the Church as a humanitarian/service organisation.  The comments were made in the context of whether or not the Church's decision to ordain an openly gay minister was schism-worthy, but my point is (and I know I took a long time getting here): if Church's really do turn their mission to be one of helping the less fortunate (the examples the Rev. used were getting clean, running water to those who don't have it; medical care to those that need it etc) WITHOUT making that help conditional on you hearing the help-giver's beliefs, let alone converting to it - that Church's would be a much more useful organization in this world; and further, much closer to the purposes I can imagine a Loving God (should it exist) would want.  \r\nTherefore, I don't credit religion with doing a whole lot of good in this world recently, but maybe if it actually could inspire large groups of people to channel their activities into something WORTHWHILE (instead of mentally tallying up who is and isn't going to heaven), it COULD do some good.  Or maybe, those of us who consider ourselves Atheists should start forming local humanist organizations to do this work ourselves and put the religious nuts to shame.  :)","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_v6h2","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473808845,"author_flair_text":null,"author":"rraaarr","parent_id":"t3_v6h2","id":"cv8qj","edited":false,"timestamp_epoch":1566236772,"message_id":"36250-bc65d324-6fce-4f6a-b607-476bbb20440a-1566236772"}