{"retrieved_on":1473808845,"distinguished":null,"gilded":0,"parent_id":"t1_cv7oe","edited":false,"id":"cv8sg","author_flair_text":null,"author":"lifeofliberty","author_flair_css_class":null,"created_utc":1166464766,"score":1,"ups":1,"subreddit":"reddit.com","link_id":"t3_v69d","stickied":false,"subreddit_id":"t5_6","body":"You cannot \"adequately\" defend yourself in this country anymore.  Do so, and you stand a high chance of going to prison. You will suffer mighily at the hands of the lawyers, judges, cops and civil lawsuits that will befall you.  How can anyone call this \"defense\"?\r\n\r\nThe concept of gun-ownership and freedom is a serious disconnect in reality. In the United States, so-called \"patriots\" believe that gun ownership means they are \"free\", when every single right in the Bill of Rights has been long trampled to smithereens.  \r\n\r\nWhat we have in America are patriots who are *afraid* to use their guns in defense of their freedoms - and *especially* in the restoration of their freedoms.  This has been a long standing **joke** of the so-called patriots for decades now, but most patriot-types aren't bright enough to admit it.\r\n\r\nSelf-defense is an inherent right in any country in the world.  But what most people mean by self defense (in America) is \"gun ownership\", which isn't permitted in every country in the world.  But here, gun ownership must come at the permission of the State, who has been very hard at work to make sure you can't own any firearms.\r\n\r\nBut what's even worse is how gun ownership here has supplanted real, true freedom. While it's become illegal to publically protest and dissent (First Ammendment), it's also illegal for millions of Americans to own firearms.  Those that do, are required to submit to a barrage of qualifications, the least violation of which bans you from legal firearm ownership.  Meanwhile, your 4th Ammenment Rights and your 5th Ammendment rights have been stolen from you.\r\n\r\nI pity the poor, ignorant \"patriots\" who claim that they are \"free\" because they \"own guns\".  So fucking what?  They've neither the balls nor the courage to use them to restore their rights.  Gun ownership has become the panacea to all these morons who think they're free in one of the most repressive countries in the world.\r\n\r\nNow go ahead and downmod (it must makes people read the comments more, so please do it) - I challenge everyone to go look up the \"state of freedom\" in the United States and the mythical \"line in the sand\" arguments posed by the patriot communities.  *It does not exist* in the real world. They will watch the Republic burn to the ground (like they are doing now) as long as they've got the beer and bullets.\r\n\r\nThe only people who need guns are those who don't know how to live free *without them*.  A gun doesn't make you free - what makes you free is your attitude to the world around you.  And if a lot of people had this same attitude, then a whole nation would be truly free.\r\n\r\nThe American government is **not** afraid of American gun owners, because gun owners have become soft and bamboozled into believing they are free.  The idea that they would actually *fight* for their freedom is quite laughable.  They're too married to the idiot box and the idea that this is a \"democracy\" to bother worrying about their lost rights.\r\n\r\nThe crowds that post right here on Reddit are the same crowd I'm talking about - their basically clueless how far down the road to a fascist police state the United States actually has become.","controversiality":1,"timestamp_epoch":1566236772,"message_id":"36285-493c8275-29de-448b-bd77-802321e15249-1566236772"}