{"gilded":0,"distinguished":null,"retrieved_on":1473808848,"author_flair_text":null,"author":"[deleted]","edited":false,"id":"cv8ww","parent_id":"t1_cv8ti","subreddit":"reddit.com","score":4,"ups":4,"created_utc":1166466362,"author_flair_css_class":null,"body":"No, that would not be the best either.  Society should fund college based on the aggregate demand for the services provided by those students that the students *won't* capture themselves.  If the students are capturing the value of their education in its entirety, there's no need to subsidize it.\r\n\r\nThe situations where we subsidize education should align with those situations where there are positive externalities.  For instance, subsidizing college for poor folks is good, because it causes a dilution of poverty.  Poor folks who come to college and make successes out of themselves positively influence others they know to do the same.  However, the person who graduates college in this position does not capture all of those benefits himself, so we should subsidize his education.\r\n\r\nAgain, if we had a general dearth of theater majors, but theater majors were still getting paid less than they were worth *to society*, we would want to subsidize their college education.  This subsidy would help us reach a point of economic efficiency (the proper purpose of government subsidies).  The disagreement then is not over whether the government should give subsidies for education, but over the extent of the positive externality and the question of whether the subsidies are already too high.\r\n\r\nIn the case of theater majors, I think we already have plenty.  On top of that, my understanding is that the best actors are apprenticed, not college-educated.  This is true in many artistic professions.\r\n\r\n*Edit: Oh, yes, I also support some correction for inequity that exists from past oppression.  For the time being, some amount of affirmative action should remain in place to help disproportionately poor populations reach an equitable level of education.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v7vw","timestamp_epoch":1566236772,"message_id":"36346-e82e933d-c6ec-4b80-be37-31a44768f087-1566236772"}