{"subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166469991,"author_flair_css_class":null,"controversiality":0,"body":"There IS taste; but also, there's no such thing as taste!\r\nHere's a different standard for what is Good in Art: Good art has lots and lots of logical, textual, emotional and cultural interconnections, enabling it to resonate with multiples of meaning while it's enjoyed. Good Taste in the viewer is mostly the ability to perceive and experience many of these connections. The reason there is also \"no such thing as taste\" is that anyone who falls in love with something and experiences it over and over eventually finds an enormous amount of interconnection in it, and deeply enjoys, let's say,  a simple woven basket as well as I can appreciate Mahler's 9th symphony.\r\n\r\nIf I spent hundreds of hours viewing a single painting, say, Christina’s World, always finding new things in it and always able to find new ways to relate it to my moods, current events, and a philosophy of life, you would have to say I’m having a subjective experience. But an experienced reader of James Joyce is unlikely to have a more complex or more satisfying artistic experience, it’s just that the person who experiences art HAS to bring the connection-making ability to it; Joyce provides much more to work with, the viewer of Christina’s World may provide more connection-making. Since the list of possible connections is likely infinite, no artwork can claim to offer a greater maximum possible art experience than another.\r\n\r\nPG writes about people's ability to respond more to certain aspects of art, such as anything utilizing the human face. For me this is a different issue: Many artists have an innate ability to create art that enormous numbers of people can easily appreciate in depth. But artists whose works are relatively inscrutable can still be discovered and enjoyed just as deeply. My favorite example of an artist innately appreciating what people will enjoy is Mozart’s use of quick, short repetition in his music. He seems to know how to repeat and repeat without ever overstaying his welcome. Another composer, Berwald, enjoys repetition just as much, but any experienced listener of classical music will know that Berwald overdoes it. \r\n- Tobias Robison, http://precision-blogging.blogspot.com, \r\nPrinceton, NJ USA\r\n","subreddit_id":"t5_6","stickied":false,"link_id":"t3_ufsk","gilded":0,"distinguished":null,"retrieved_on":1473808854,"author":"TOBYR21","author_flair_text":null,"edited":false,"parent_id":"t3_ufsk","id":"cv971","timestamp_epoch":1566236772,"message_id":"36480-8fdbe5d0-2ea5-413f-b670-e34773ca1901-1566236772"}