{"body":"You didn't fix, or undestand anything, apparently.\r\n\r\nChristians are terrorist *because* of their *faith*.  Examine the basic tenents of their faith and you will have to agree that it is based upon exclusionistic ideals that paints the rest of the entire world as both evil, corrupt and worthy of eternal damnation and hellfire.  Yet the hyporcrisy of Christian's is such that even this is lost to them.\r\n\r\nSo yes, the alleged 70% of the UK are terrorists too.  It doesn't matter what the country is, so I'm not going to quibble over the numbers.\r\n\r\nIt has been the Christian faith itself that has decimated nations, invaded countries and laid waste to mankind all over the world.  They are not alone, of course.  Religion in general has this black mark against it.  And I'm not speaking of the ancient wars of yesteryear either, I'm also speaking of the very wars we have today in Africa, Iraq and Afghanistan.\r\n\r\nThe real terrorists are those that demonize other people, which at it's root, is a hatred for their belief systems (and color, oftentimes). Religion, in particular, the Christian religion is at fault.  So is the Moslem religion. This religious xenophobia is covered up with alleged \"patriotism\" and extremist hyperbole, but at it's core, the wars are usually fought to gain dominance (or extermination) over others that do not share their religous views.\r\n\r\nOf course, having valuable resources is also a worthy excuse, but the supporters of these wars are by and large, religious extremists.\r\n\r\nI stand by my comments, as always. Christians are terrorists, pure and simple.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_v6h2","stickied":false,"subreddit":"reddit.com","score":0,"ups":0,"author_flair_css_class":null,"created_utc":1166480057,"author_flair_text":null,"author":"lifeofliberty","id":"cva05","edited":false,"parent_id":"t1_cv7gf","gilded":0,"distinguished":null,"retrieved_on":1473808868,"timestamp_epoch":1566236772,"message_id":"36917-bc9db53b-d924-4d38-9207-c8cc82fcc5f3-1566236772"}