{"retrieved_on":1473808871,"distinguished":null,"gilded":0,"id":"cva3t","parent_id":"t1_cv9bs","edited":false,"author_flair_text":null,"author":"lifeofliberty","created_utc":1166481613,"author_flair_css_class":null,"ups":2,"score":2,"subreddit":"reddit.com","stickied":false,"link_id":"t3_v6h2","subreddit_id":"t5_6","controversiality":0,"body":"This is a dumb argument that has never made any sense at all.\r\n\r\nIt presumes two things:\r\n\r\na) that beleive in God is going to offer you something of value (unsubstantiated);\r\n\r\nb) that if God exists, that he will somehow punish those that don't believe in this \"fact\" (also unsubstantiated)\r\n\r\nThe basic premises is that the \"right belief\" (because that's what the poster meant, it can't be just *any* belief, it must be the right belief, such as the Christian belief, but not the Muslim belief), which offers you \"something\" of value (for the Christian, it is assumed, quite wrongly, that this means \"salvation\").\r\n \r\nSo the \"right belief\" saves us, but nobody ever asks what that actually **is**, or why we need it.  The Christian believes that they have an answer though, because they believe their bible tells them what that is.  They believe that they are saved from sin and the wages of sin being death, therefore \"salvation\" from sin and death is theirs - **if** of course, they believe in the \"right God\".\r\n\r\nThis is a circular argument, which is why it never makes any sense.  First off, there is nothing whatsoever to substantiate any of this.  Nor is there any way to actually \"prove\" which belief is \"right\" or even which \"God\" is right.  Even among Christians, there is a wide dissension on which way to \"believe\".\r\n\r\nEven worse, the simple act of \"belief\" is somehow supposed to coverup all of the believers own wrongdoings - their \"sin\", which they (along with the rest of the world) goes on committing, but it doesn't matter anymore, because they have the \"right\" belief and all will be forgiven (remember now, we are talking about a *lifetime* of sins here).\r\n\r\nThe logical fallacy of this is that **any** belief can be \"justified\" as being the \"right\" belief, and worse, any behavior can be forgiven (except blaspheme of the Holy Ghost of course, but murder, rape, torture, lying, stealing, robbery, you name it, all else can be forgiven if you have the \"right\" belief).\r\n\r\nSo when someone say's that you \"lose\" if you don't believe in God, what they are really saying is \"I get to keep on sinning because I have the **right belief** in God\". This is supposed to excuse their bad behavior.  Worse, they then take **no personal responsibility** for their actions - nor do they **expect anyone else to do so either**.  This is why Christians make absolutely the **worst** citizens (and Muslims) that a country can possess.\r\n\r\nAnd the rest of the world is supposed to \"excuse\" these transgressions from here on out, because this person has the \"right belief\" in the \"right God\".  In fact, they demand that we \"respect\" this bizarre belief as the only qualification of their citizenship!\r\n\r\nIf you did even further, Christians don't even claim citizenship - to anywhere on planet Earth!  This is why their \"home is not of this world\" and their eyes are upon the skies and their heads are in the clouds!  To say that they are seriously disconnected from reality is a gross understatement.\r\n\r\nThis is yet another reason why Christians are dangerous deluded people.  They seek to excuse their own actions and responsbilities because \"God\" has \"forgiven\" them and no longer remembers their sins or transgressions.  And you know what?  That is **exactly** what they want the rest of us to do too - we are suppose to \"forgive\" them when they transgress against **us** (like blowing our houses to smithereens if we were to live in say, Iraq).\r\n\r\nSo, the truth is, if God really existed, he would **hate** these Christians who fail to understand these basic principles, because unless he's a distorted fuck that likes killing people (and there is quite some debate on that), then he would despise Christians for trying to excuse their terrible and atrocious behavior and hide behind the cloaks of the Almighty as if that were a true covering for their sins.\r\n\r\nOn the other hand, if God does **not** exist, then you don't go around deluding yourself that you are not responsible for your own actions and behaviour. In fact, you start demanding that of other people too, since it's clearly the root problem with society today.  Being responsible to each other is far better then being \"responsible to God\" or any other ethereal and unseen being, and having to be responsible for the \"right belief\" that let's you cause so much harm as if it were a license to kill (which it is, by the way).\r\n\r\nSo if God does **not exist** then you are far better off and far more of a humane human then being one of the deluded that believes that God does exist because you no longer have a covering for your sins.\r\n\r\nThe real, true \"salvation\" that comes is when you understand that you alone are responsible for every act and action you commit in your entire life and you must hold yourself (and others) accountable for these actions and that religious extremism cannot be tolerated anymore as an excuse to commit unspeakable acts of violence and depravity.\r\n\r\nOr you can be a Christian and keep on deluding yourself that you will receive your \"just reward\" only **after** your dead, paving the way in the \"afterlife\" with the corpses of those you kill in this life (even if you do nothing, which is one of the greatest sins of all).\r\n\r\nTake your pick.  It's plain as day which one will really \"save\" you.","timestamp_epoch":1566236772,"message_id":"36988-3dd49ed8-6e6a-4830-83d0-3f81beef0885-1566236772"}