{"subreddit_id":"t5_6","link_id":"t3_v8ov","stickied":false,"body":"Not sure why the parent is so down-modded.  I agree with him/her.  I've been married for 2 years, but been with her for almost 11.  I met her when I was 16, she was 14.  I'm 27 now.  We fell in love, and have \"made it work\" even through college and her living away for 2 years during her doctorate program while I stayed back to finish my own degree.\r\n\r\nMaybe we are a special case because we started off so young, but honestly I just can't help but think if you are asking each other these questions then something is already wrong.  Marriage is just a old ceremony preserved by time and the gov't to publically (and financially) acknowledge what two people should already know.  Yeah, I might be totally oversimplifying things, but maybe not.\r\n\r\nWhen you have a deep emotional connection with another human (perhaps their soul if you believe in that stuff), marriage doesn't mean anything at all.  It isn't about marriage.  Marriage is fluff, and as some people have noted, often confuses things and places artificial rigidity on an otherwise perfect relationship.  For us however, it didn't.  We got married and nothing changed.  Sure we share a bank account now, and get a better deal on taxes and car insurance for the time being...but come on!  We still love each other so much it's ridiculous.\r\n\r\nI'm not saying we are a picture perfect couple...nobody is.  If you want to be with someone for the _rest of your natural life on this planet_, you will find solutions to the \"issues\" that come up.  Honestly, you will.\r\n\r\nIf you read the article and are considering asking your partner some of these questions, instead ask yourself why these things haven't been discussed yet in the first place.  Your partner should already know these things about you.\r\n","controversiality":0,"score":7,"ups":7,"author_flair_css_class":null,"created_utc":1166487731,"subreddit":"reddit.com","parent_id":"t1_cv9jd","edited":false,"id":"cvaej","author":"demoneyes","author_flair_text":null,"distinguished":null,"retrieved_on":1473808877,"gilded":0,"timestamp_epoch":1566236772,"message_id":"37167-8d31288a-65ce-4ed9-bb96-bafbad59da5c-1566236772"}