{"edited":false,"parent_id":"t1_cv87e","id":"cvafi","author_flair_text":null,"author":"bbklyn","retrieved_on":1473808877,"distinguished":null,"gilded":0,"link_id":"t3_v6fl","stickied":false,"subreddit_id":"t5_6","body":"Wow... it seems you have good reason for not sourcing anything. I have a grandmother with those damn numbers still in her forearm who told me about the ovens and gas chambers.\r\n\r\nAccording to Germans themselves only 1.4million German POWs were killed, a half a million of which were by Soviets. And this is from the GERMANS. http://en.wikipedia.org/wiki/Eisenhower_and_German_POWs\r\n\r\nAnd are you honestly saying that after being held for years by the Germans the inmates of these camps couldnt tell the difference between Germans and Russians simply because they donned a German uniform? I dont even need a source to disprove that, its plain idiotic.\r\n\r\nAnother issue i dont need a source for is that idiotic notion that the emancipated bodies of inmates could be cause by 2 weeks of having to scrounge for food. Any moron knows that kind of damage takes time, not 2 weeks which is also flatly false since the Germans waited until the last possible minute to retreat spending as much as time as they could destroying the camp infrastructure (which again is documented by simply looking at most camps and the ruins theyre in).\r\n\r\nAnd what about the camps that were liberated by the Allies? How do you explain those since the Russians didnt get to them first? Documented stories of GIs horrified by the sight of them. Letters, testimony and all the rest right after the war, before the Zionist conspiracy had a chance to buy them off and make them propogate your so-called lies.\r\n\r\nThe thing i find truly sad about this is the fact that when i was younger i was told to wait and see that there will be a direct correllation between the rate at which survivors die and the rate at which Holocaust denial rises. I looked at these people like they were overly paranoid, probably from surviving the camps. Now that we are nearing the end where Holocaust survivors are dying out at an incredible rate and you can already see it happening at a breakneck pace. It seems every damn day another conference and another expert and another group seems to rise up and spout complete nonsense in the face of overwhelming evidence. Its absolutely depressing and for first time i am inclined to agree with all the survivors ive talked to that said it could easily happen again.\r\n\r\nThere is only one area i agree with you on. Its a damn shame some European countries have outlawed denying the Holocaust especially Germany. You should all be free to raise your voice triumphantly in the town square so we could all ridicule you in public.","controversiality":0,"author_flair_css_class":null,"created_utc":1166488156,"score":13,"ups":13,"subreddit":"reddit.com","timestamp_epoch":1566236772,"message_id":"37181-cd71aff9-8c90-459a-878d-4d0dfc1722e0-1566236772"}