{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v95u","controversiality":0,"body":"In these 10 peoples context I would say broken window here is the concert they didn't go to, the movie they didn't see or that $60 bottle of wine they left alone for the cheaper $30 brand. The broken window is what happens when you only look at the gross figures, everyone profits but as soon as the deductions are factored in that window cost $400 to replace, imagine having to do that at christmas, \"Sorry kids, daddy couldn't get you what you wanted because someone put a rock through my shop window.\" Where's the damage there?\r\n\r\nThese people are going to see movies, made in the US. Concerts in the US and the majority will be by US bands. The wine, depending on where they buy it, could come from a US vineyard instead of one using near-slave labour to get their harvests.\r\n\r\nConsider the effect on the economy if they buy a new HD-TV, their money has just gone to Japan or China. A HD-DVD player, Japan and China again. Maybe a new Apple MacBook, a nice healthy US company, right? Except they're made in China and a lot of the money will be going back there for work or written off as costs on parts, that are likely manufactured in China or other asian countries.\r\n\r\nIf an economist can seriously say these people are damaging the economy, they should invent a time machine because they cannot fire that moron fast enough. What these people are doing is a fucking miracle to the economy, the US has a potential Great Depression MK2 on its way and buying US keeps money in the US and supports the economy, it also preempts the disaster, that could be, by them actually being able to save.","score":5,"ups":5,"created_utc":1166491722,"author_flair_css_class":null,"subreddit":"reddit.com","id":"cvamo","edited":false,"parent_id":"t1_cvaeb","author":"electromagnetic","author_flair_text":null,"distinguished":null,"retrieved_on":1473808882,"gilded":0,"timestamp_epoch":1566236772,"message_id":"37284-cbb289df-a666-4e56-b023-883ecdd21bee-1566236772"}