{"controversiality":1,"body":"I don't like AI, they're too high and mighty. They claim to protect peoples human rights, but what the hell does the UN have to do with human rights it's an attempt at a peace keeping force and should stay as such. AI shouldn't comment on a single thing about the UN except it's policy on Human rights, by their own admission they want no authority over anything else so why the hell are they taking it? Same with the arms trade, they should butt the hell out because some of those guns will be going to people defending their human rights.\r\n\r\n&gt; Governments have a duty to cooperate with international organizations, to admit international observers to their political trials and/or prisons, and to respond to complaints raised at the United Nations.\r\n\r\nActually they don't, there's no law or rule or anything even de facto that states they have to have any communication with the outside world 1mm across their territory lines or a million miles across it. The UN only has a right to intefere when it affects things across that territory line, that's why there's Peacekeeper forces not invasion forces run by the UN.\r\n\r\nA soverign nation has no responsibility to anything outside its territory except its citizens. The people in Estonia formerly from Russia should have been taken care of by Russia or their respective country, Estonia had the right to shoot them if they didn't leave their country but they did an amazingly kind deed when no one else was. They didn't deport people, they supported them and get criticised for it by AI. It's a joke.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_v7fq","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166493043,"author_flair_css_class":null,"author":"electromagnetic","author_flair_text":null,"parent_id":"t1_cvabx","id":"cvapn","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808883,"timestamp_epoch":1566236772,"message_id":"37324-9fb09b18-260e-4819-83b4-1d8dcc1c32b1-1566236772"}