{"stickied":false,"link_id":"t3_v88c","subreddit_id":"t5_6","body":"&gt; LTCM would not have existed if they thought the market was rational, because a rational market doesn't have any arbitrage opportunities, while LTCM existed entirely to exploit those opportunities.\r\n\r\nWell, people are more worried about the second derivative of rationality.  LTCM and other money managers assume that people act irrationally (thus creating arbitrage opportunities), but then assume that people act irrationally *in predictable ways* (thus creating arbitrage opportunities that can be exploited by professional money managers).  Over short time scales, that's often the case.  However, the really big world-shaking events usually involve people behaving irrationally *in unpredictable ways* - things like the Great Depression, Russian default, Japanese asset bubble burst, etc.  Oftentimes, you'll know that *something* big is going to happen (just about anyone could've told you that stocks were overvalued in 1929, or that Japanese real estate was overvalued in 1989), but when it actually does happen, it happens in completely unpredictable ways.\r\n\r\nI think this is one of those times.  Everyone knows that *something* is wacky with our financial system: we've got asset bubbles in housing, rolling capital flows into and out of emerging markets, stocks that are still overvalued even after a major correction, a huge trade deficit run by the world's only superpower, and a reserve currency whose fundamentals are weak.  But what do you actually do about it?  Do you:\r\n \r\n* Buy gold, the traditional hedge in uncertain times?  Except that it'll become worthless if outlawed by the government, which happened in the last major financial crisis (the Great Depression)\r\n* Hold cash, so you can quickly jump into investment opportunities as other assets fall?  Except that cash itself may devalue as the dollar depreciates and the government inflates to pay off its debt\r\n* Hold foreign currencies in emerging markets?  Except that the economies of most emerging markets are heavily dependent upon exports.  If there's a major financial crisis in the U.S, you can bet that protectionist legislators will try to stem the bleeding with tariffs, which at least give their constituents the impression that *something* is being done.  China's economy will sink much further than America's if all trade between both countries stops.\r\n* Hold foreign currencies in developed nations?  Except that many of these are fairly or overvalued too, and they will be similarly hurt by a breakdown in international trade.  Perhaps not as much as the U.S. and emerging markets, but Europe and Japan have their own share of demographic problems.\r\n* Hold stocks in consumer staples, whose businesses will be least affected by a recession?  Except that with an average P/E of about 20, consumer staple stocks have a long way to fall if growth expectations drop off.\r\n* Hold stocks in international companies, thus profiting from any decline in the dollar while still holding productive assets?  Except that these depend on consumers having disposable cash, which depends on them having jobs, which depend on their home countries having trade.\r\n* Hold bonds?  These are highly sensitive to currency fluctuations: dollar-denominated bonds risk losing much of their principle on a dollar crash.  International bonds should do well if the dollar depreciates, but they've already been bid-up significantly in expectations of a dollar devaluation.  And all bonds are sensitive to a rise in interest rates, or to inflation.  Rates are still quite low, in historical terms, and if they go up the value of current bonds will drop.\r\n","controversiality":0,"created_utc":1166502042,"author_flair_css_class":null,"score":2,"ups":2,"subreddit":"reddit.com","edited":false,"parent_id":"t1_cva7e","id":"cvb6c","author_flair_text":null,"author":"nostrademons","retrieved_on":1473808891,"distinguished":null,"gilded":0,"timestamp_epoch":1566236772,"message_id":"37529-42089d4a-a219-4f04-abe4-b26fe1a08842-1566236772"}