{"controversiality":0,"body":"Feminists aren't the problem, it's the hard liners. Feminism worked, I rarely see any male who's actually sexist under the age of 30. However there's the major problem that feminism screwed up, very badly. Female&gt;Male sexism is practically the only sexism present I've never ever in my entire life heard a man say \"I hate women\" and not laugh whatever caused them to say it off, however I see plenty of women who ardantly say they hate men for no justifiable reason other than that miracle word 'because'.\r\n\r\nFemale&gt;Male abuse is almost equal to Male&gt;Female abuse, however in the age group it occurs in I've seen estimates of it being 2 or 3 times worse. Women now assume they can match men in drinking, well yeah they can get the same number of drinks down but like hell should they - it's damaging to the body as it is and a womans body physically is incapable of handling the same amount and that's a medical fact.\r\n\r\nThe list goes on where you now have female chauvenism, only worse. I've had women have a go at me for holding a door open for them, it doesn't even register in my mind to do it because they're female I do it because it's hard coded into me, yet somehow a woman gets the right to have a go at me for a kind gesture.\r\n\r\nNow look at it from the male point of view, if you grew up and you hear constant spoon fed rhetoric about how men can't be trusted blah blah blah. From my opinion, and even the leading feminists are agreeing, feminism went too far. It was supposed to give women a choice, but they fucked up and chose to be men. The mistakes they were supposed to right are being repeated and statistics are saying worse.\r\n\r\nI like feminists, the majority of my friends are female yet I hate feminism as it stands today, it's a hinderance. It's *equal* rights, but feminism is keeping it split between two camps and are the sole problem to things advancing. It's humanism people should be now, and I'd urge you to act as one because wanting equal rights is irrelevant when you don't first show equal support for both males and females.\r\n\r\nEdit: Forgot to say, I put in a downmod because she automatically assumed anyone criticising feminism is male.","link_id":"t3_tcpy","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165092228,"score":19,"ups":19,"author_flair_text":null,"author":"electromagnetic","id":"ctdg9","edited":false,"parent_id":"t1_ctd9y","gilded":0,"retrieved_on":1473807580,"distinguished":null,"timestamp_epoch":1566236759,"message_id":"3753-26e5dfb7-2763-4a6a-a168-4fee6bf74a27-1566236759"}