{"subreddit":"reddit.com","created_utc":1166504544,"author_flair_css_class":null,"ups":16,"score":16,"body":"I agree. This article is wrong, and the reason that it's wrong is simple. In general, managers who are trying to use positive incentives aren't doing it in a meaningful manner. Obviously it's the case that pizza parties and mere statements of recognition aren't going to cause people to work harder. What's going to make them work harder is paying them more based on exceptional performance.\r\n\r\nI will give an example based on two environments from my own life. At a typical Kinko's branch, young people don't care about their work, by and large, despite management using all of the tactics mentioned in the article to try to incentivize work. At an investment bank, you will find that the analysts, who are the same age as the aforementioned Kinko's employees (fresh out of college), are working much much harder than the Kinko's employees. Typically, they work 70 hours per week outside of NY, and up to 100 hours per week during crunch times on Wall Street, despite the fact that they probably don't enjoy their jobs all that much more or less. Given the difficulty of staying awake those long hours, they are probably working several times as hard as a Kinko's employee. How is this miracle possible? Kinko's employees make 19,000/yr after 2 years of work, investment bankers make 100,000-150,000+/yr after two years of work, and much of this is a bonus based on performance of the firm.\r\n\r\nMost managers realize that the reason their employees suck is because employees that don't suck cost a lot more, but they don't think that hiring better employees will increase the bottom line. There is no silver bullet, worthwhile employees know their value, and will leave.\r\n\r\nIf incentives didn't work, the entire economy and especially all of our labor markets would collapse into utter chaos.\r\n\r\nWhy do people distrust car salesmen? Because car salesmen care a lot about making sales, due to meaningful incentives. Why do people distrust lawyers? Because the financial incentives are for increased litigation. Why is drug dealing so violent? Because the financial incentives are so strong.","controversiality":0,"stickied":false,"link_id":"t3_va3v","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808894,"distinguished":null,"author_flair_text":null,"author":"[deleted]","id":"cvbba","edited":false,"parent_id":"t1_cvatx","timestamp_epoch":1566236772,"message_id":"37591-97acd5ba-9e14-4354-8c67-297631981a6b-1566236772"}