{"author":"[deleted]","author_flair_text":null,"parent_id":"t1_cvb6c","edited":false,"id":"cvbcg","gilded":0,"distinguished":null,"retrieved_on":1473808894,"controversiality":0,"body":"&gt;...but then assume that people act irrationally in predictable ways (thus creating arbitrage opportunities that can be exploited by professional money managers).\r\n\r\nI don't think that was their assumption at all. They just assumed that reversion to the mean was more likely than further deviations -- that, all else being equal, a correction from a bubble is more likely than a bubble-within-a-bubble. Their mistake was in rounding very low risks down to nothing and in being a huge part of the market; the first mistake led them to overpay for third-world debt, and the second meant that when they overpaid, they had enough of an impact on the market that third-world countries borrowed more than they were really capable of repaying. Which made the defaut inevitable.\r\n\r\nLTCM was reasonably-capitalized and really well-respected, whcih turned the usual perfect-competition situation into an oligopoly. As many observers realized at the time, a collapse became more likely the longer LTCM operated.\r\n\r\n&gt;I think this is one of those times. Everyone knows that something is wacky with our financial system:\r\n\r\nIt's *always* one of those times. Seriously. The only time we feel safe, we overpay for stocks (the 50's, the 90's), and even then we don't feel completely safe. History and economics are too dynamic for the situation to ever feel normal.\r\n\r\n&gt;Except that it'll become worthless if outlawed by the government, which happened in the last major financial crisis (the Great Depression)\r\n\r\nI believe the government instituted price controls and required Americans to sell to the government. They didn't devalue it.\r\n\r\n&gt;Hold stocks in consumer staples, whose businesses will be least affected by a recession? Except that with an average P/E of about 20, consumer staple stocks have a long way to fall if growth expectations drop off.\r\n\r\nJust buy more leveraged consumer products companies, so theire depreciating debt burden is an effective inflation hedge, if you're really that worried.\r\n\r\n&gt;Hold bonds? These are highly sensitive to currency fluctuations: dollar-denominated bonds risk losing much of their principle on a dollar crash.\r\n\r\nTIPS! And by the way, if the market is really as crazy as you're portraying it, shouldn't TIPS be way more popular and way lower-yielding?\r\n\r\n*Edit: And high-yield bonds are a decent way to combine bond-y security with low interest-rate sensitivity, since they're shorter-term and their interest payments are a higher proportion of the expected value.*","subreddit_id":"t5_6","stickied":false,"link_id":"t3_v88c","subreddit":"reddit.com","score":2,"ups":2,"created_utc":1166505334,"author_flair_css_class":null,"timestamp_epoch":1566236772,"message_id":"37607-1f6d0fa8-2d92-4c7c-af11-1a45a9652267-1566236772"}