{"gilded":0,"distinguished":null,"retrieved_on":1473808896,"author":"nostrademons","author_flair_text":null,"id":"cvbdl","edited":false,"parent_id":"t1_cvbcg","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166506015,"author_flair_css_class":null,"body":"&gt; hey just assumed that reversion to the mean was more likely than further deviations -- that, all else being equal, a correction from a bubble is more likely than a bubble-within-a-bubble.\r\n\r\nReversion to the mean is an assumption that markets behave irrationally in predictable ways. :-P\r\n\r\n&gt; Just buy more leveraged consumer products companies, so theire depreciating debt burden is an effective inflation hedge, if you're really that worried.\r\n\r\nWhat happens if you get deflation instead of inflation?  Then their core business is hurt by falling prices, consumer prices likely will drop before supplier prices (this is the problem with deflation; if they all dropped at once, it would just be a change in the measuring stick and wouldn't have any real effects), and their debt burden will sink them.\r\n\r\n&gt; TIPS! And by the way, if the market is really as crazy as you're portraying it, shouldn't TIPS be way more popular and way lower-yielding?\r\n\r\nTIPS are neat in that they guarantee a certain real return, completely independent of anything that goes on in the market (short of the U.S. government collapsing).  They're annoying in that that real return is only about 2%.  Also, the spread between TIPS and normal Treasury bonds should reflect the expected inflation rate over the life of the bond.  Right now, spreads are about 2.5%, so TIPS are a good deal only if you expect inflation to average more than 2.5%.  This may actually be a good bet - IIRC, historical norms are a bit higher than that.  There's still a lot that could go wrong though - deflation instead of inflation, or even this goldilocks economy continuing.\r\n\r\nBut yeah, I'm definitely looking into TIPS.  Right now, I think my portfolio's most vulnerable to 1970s-style stagflation, and TIPS would do very well in that environment.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v88c","timestamp_epoch":1566236772,"message_id":"37626-30991cc7-587f-43b4-8acc-dc781c162c34-1566236772"}