{"subreddit":"reddit.com","created_utc":1166506983,"author_flair_css_class":null,"score":3,"ups":3,"controversiality":0,"body":"Au contraire - dollars were devalued in terms of gold (from $20 to $35).  See [Garet Garrett](http://www.mises.org/books/pottage.pdf) for the whole sad story.\r\n\r\nTIPS are a crazy investment, because they are defined in terms of a number (CPI) that the issuer itself controls.  Janszen at iTulip has a [nice graph](http://www.itulip.com/forums/showthread.php?t=680) which shows the latitude in the CPI.  See also [Goodhart's law](http://en.wikipedia.org/wiki/Goodhart's_law).\r\n\r\nAs for LTCM, the real threat was not the failure of LTCM but the impact of that failure on its counterparties.  The problem as a whole is [counterparty risk](http://www.crmpolicygroup.org/).  \r\n\r\nNote that the CRMPG view assumes conventional banking economics.  As an [Austrian](http://www.mises.org), my perspective is slightly different, which is that systemic derivative risk - which is definitely a real problem, acknowledged by even [Geithner](http://www.newyorkfed.org/newsevents/speeches/2006/gei060228.html) - is just a new flavor of the classic corrupt nexus between banks and states known as [fractional-reserve banking](http://www.mises.org/mysteryofbanking/mysteryofbanking.pdf).  \r\n\r\nIn fractional-reserve banking, the state, by artificially protecting the bank which has mismatched its maturities and cannot meet all its current obligations, effectively misprices the risk that the deposit will not be returned.  \r\n\r\nFast forward to our good friend the [credit default swap](http://en.wikipedia.org/wiki/Credit_default_swap) - which can be used to insure the against the risk that a bond will default.  But who insures against the risk that your CDS will default?  What would this be, a CDDS?  There is no market for this and no way to measure the probability.  You just try to spread your counterparties around enough that the only way you can go tits up is if everyone else goes tits up.  \r\n\r\nIn other words, the ultimate insurance is provided by the Fed, which will inject liquidity to prevent any systemic collapse.  Moral hazard in a nutshell.\r\n\r\nIn general, the problem with derivatives is that the value of a derivative needs to include the risk that the counterparty will default.  And it just doesn't.  You haven't eliminated the variable, you've just pushed it out a step.  The result is a massive and unprecedented explosion of credit which will end very, very badly.\r\n\r\nSo remember - [don't be high, when you're buyin' and sellin'](http://wallstreetexaminer.com/blogs/winter/?p=200).\r\n\r\n[edit: paragraphs!  paragraphs are a good thing...]","stickied":false,"link_id":"t3_v88c","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808896,"distinguished":null,"author":"[deleted]","author_flair_text":null,"edited":false,"id":"cvbf3","parent_id":"t1_cvbcg","timestamp_epoch":1566236772,"message_id":"37647-5ede0bb8-c8e1-4399-afee-4cc72640e9d5-1566236772"}