{"edited":false,"id":"cvbfc","parent_id":"t1_cv9xq","author":"nostrademons","author_flair_text":null,"distinguished":null,"retrieved_on":1473808896,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v88c","controversiality":0,"body":"Honestly, you're nearly as wrong as he is...\r\n\r\n&gt; inflation impact all assets. it either reduces or increases values relatively\r\n\r\nWell, yeah.  But I think he meant \"impacts\" as in \"you have to worry about this\".  People don't generally worry when inflation makes their assets worth more.\r\n\r\n&gt; no, as the supply of dollars increases, the value of other fixed assets rises\r\n\r\nOr you could look at it as their value remains constant (intrinsic value, remember?) and the value of a dollar decreases.  Or if you really want to get pedantic, you'd realize that there's no such thing as \"intrinsic value\", but the rising supply of dollars vs. fixed supply of tangible assets means you can exchange more dollars for a given tangible asset.\r\n\r\nAll semantics, really.  The important thing is that the *price* of an asset, measured in dollars, will rise as dollars become more plentiful.  If the price of an asset is *defined* in dollars (like bonds, for example), then its price will fall relative to others with intrinsic value and floating prices.\r\n\r\n&gt; bonds and stocks are both paper assets impacted adversely by inflation. stocks because firms have to pay more to borrow, impeding growth.\r\n\r\nMost financially-sound public firms do not have to borrow to grow.  GM and Ford are obvious counterexamples, but I did qualify with \"financially sound\".  Also, in real terms inflation *benefits* borrowers.  The inflation rate is factored into the interest rate of any new loans, but all their *old* loans keep the same terms, which means they pay them off with dollars that are worth less than the dollars they borrowed.\r\n\r\nThe performance of a stock under inflation varies significantly depending on which market it's in.  Inflation does not impact all producers equally: businesses with strong franchises and weak competition can raise prices more than businesses of commodity products and strong competition.  For example, a strong brand name like Coca-Cola or Microsoft can raise prices at close to the inflation rate, while their suppliers and complements will have to keep their prices under the competition.  The increase all goes to the big brand name's bottom line, so their stocks should do even better in times of inflation.\r\n\r\nThere's an additional phenomenom in that investor psychology often does not properly account for inflation in product prices, leading to low stock prices even though earnings remain high.  This is one reason why P/Es were so low during the 1970s.  It tends to keep stocks low, but since cash payouts (in the form of dividends) are just as strong regardless, and the market bounces back after the inflation ends, it's actually good for stock investors in the long run.\r\n\r\nWarren Buffett made a significant portion of his fortune by buying stocks with strong franchises during the inflationary period of the 1970s.\r\n\r\nNow, I'm likely wrong in some of the details above too.  Unfortunately, real economists don't generally frequent Reddit (usually...anyone wanna speak up?)  But honestly...I cannot imagine how one could escape a 1-level economics course and write what you wrote. :-P","score":1,"ups":1,"created_utc":1166507144,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236772,"message_id":"37654-46a26715-f04e-44ad-8414-8fbf3a8ac20a-1566236772"}