{"subreddit":"programming","ups":2,"score":2,"created_utc":1166512931,"author_flair_css_class":null,"body":"You can too have a reference to NULL.  In C++ you do EVERYTHING!\r\n\r\nI've been a C++ programmer for years.  My biggest complaints?\r\n\r\n1) It parses so messy, the compiler barely understands it.  That's why compiler errors are often located on the line after the mistake, it's as if almost any combination of symbols is valid.  That's why you don't see more code analysis tools or refactoring IDEs or what not for C++, though plenty of people try anyway.  It's also one reason why C++ doesn't really optimize as much as theoretically could be possible with compiler that could optimize further. I swear templates were introduced merely to antagonize the compiler.\r\n\r\n2) Write: Constructor, Copy Constructor, Assignment Operator, Destructor... REPEAT!  Wait... when do I stop worrying about managing my heap memory and exception safety and thread safety and temporaries and const correctness and v-table size and start getting real work done?\r\n\r\n3) How many different things can static mean, anyway?\r\n\r\n4) I'd like to test out this little math function I just wrote, can I test a few values run through it?  Oh I just need to have a testing framework in parallel with the program, ok, that's fair, right?  This other code I need to test needs this object with big complicated setup and input of user settings. Put all that in the framework... screw that, I'll add this button to the app and then remember to move it.  Oh hey, I've got an idea... I'll put a breakpoint at this point in the code and then I'll type in the function calls and see what the results are in the debugger.  What do you mean I can't do that?\r\n\r\nSo change languages you say?  I so quickly get put off when I try.  All languages seem to be full of bad ideas, such as:\r\n\r\n1) Everything is a list.  Sorry, you're talking to a guy who sees a linked list as an instant sign that you are looking at bad code.  Is there a worse data structure in the universe?  I know these lists are more conceptual, everything internally is not a linked list.  But to me it is like construction based on the concept of sandy mud.  Why?\r\n\r\n2) If you write functions with no side effects, programs can be proven to be true mathematically.  OK, it's not the concept that sucks, it's that it never seems to have done anyone any good!  Who here has proved a program?\r\n\r\nBut there is hope for me.  I hear Haskel has a feature with 'lazy' in the name!  Sounds great!  Sign me up! ;)","controversiality":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_v6rx","gilded":0,"distinguished":null,"retrieved_on":1473808900,"author":"Wriiight","author_flair_text":null,"id":"cvbnk","parent_id":"t3_v6rx","edited":false,"timestamp_epoch":1566236772,"message_id":"37758-b88450d2-82b2-4ee1-ad18-7457362877f2-1566236772"}