{"retrieved_on":1473808901,"distinguished":null,"gilded":0,"edited":false,"id":"cvbq9","parent_id":"t3_vbjl","author":"marudump","author_flair_text":null,"author_flair_css_class":null,"created_utc":1166515150,"score":2,"ups":2,"subreddit":"reddit.com","link_id":"t3_vbjl","stickied":false,"subreddit_id":"t5_6","body":"This list reads like the worst nights during the year I spent as a sound guy in a club in L.A.  I would add a few items for all the dear bands that I've had the pleasure of mixing for:\r\n\r\n40.  Yes, I'm aware your marshall half stack goes up to 11.  It might have worked for Nigel Tufnel in an arena, but trust me, when I ask you to turn the master volume no louder than 4, I really didn't mean 8 would be okay.  I'm really trying to help you, because I care about good sound, and the owner of the club who pays me cares about good sound (even money grubbing owners understand that a reputation for good sound is good for business; okay, not all, but the ones that stay in business do).  So you like to run around on stage out of the direct line of your amp, no problem, that's what those 3 wedge shaped monitors pointing at you from the front of the stage are for.  See? I got your back.  Have a great show!\r\n\r\n41.  1 hour from setup to teardown (onstage) does not equal 1 hour set time.  There's a reason we have a $2k backline drum kit and bass amp.  It's so YOU, the band, can play longer.  If you absolutely must play your own kit, I will happily do that after I try and talk you out of it.  But the 15 minutes it takes to set up, re-mic &amp; EQ is 15 minutes you are losing from your set.  Guitar/bass players, it's always a great idea to tune up and plug in all your pedals before you get on stage.  You get the idea, walk on that stage ready to rock.\r\n\r\n42.  Yes, dear lead singer, I am sorry the microphone stinks.  I wash the grill and pop filter every night in anti-bacterial soap, and even soak the foam in mouthwash before I rinse and dry it.  But I can't help that the guy who played before you hasn't brushed his teeth in a week slobbered all over the mic.  I know this may be a stretch, but unless this is your first gig, this has happened to you more than once.  Look around at all the money your band has invested in their equipment.  I'm sure you can scrounge up the $90 for an shiny new Shure SM-58.  It's that grey and silver microphone that +80% of clubs use for vocals.  From what I've seen, I may be an exception.  Most clubs rarely if ever wash their germ, food, and saliva infested microphones.\r\n\r\nThanks for your time, my precious bands.\r\nYours truly, a retired sound guy.","controversiality":0,"timestamp_epoch":1566236772,"message_id":"37792-36796574-a754-4a8f-a0c7-7eef9161dcc8-1566236772"}