{"author":"lessofthat","author_flair_text":null,"parent_id":"t1_cvarn","id":"cvbtb","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808903,"body":"&gt;Also, you must take into account the feelings of native Estonians - our land was brutally occupied for 50 years and the language and culture was basically set to be made extinct by forced mass migration.\r\n\r\nI hear you. And I'm reluctant to argue strongly about this without at least doing a little more reading first. My main intention here is to show that the Economist article is explicitly untrue in at least some respects (eg: AI rightly gives much more attention to Belarus and Russia than Estonia, but the Economist denies this.)\r\n\r\n&gt;Requiring knowledge of native language to gain citizenship is not discrimination, it's a vital necessity to preserve the unique culture and language of Estonia\r\n\r\nUnderstood. But Amnesty isn't proposing that the Estonian government removes that requirement (although in a non-headlined recommendation, it does point out that this requirement is not law until 2007, and suggests the government publicise that). \r\n\r\n&gt;I believe that the state subsidises language lessons for non-citizens to some extent here.\r\n\r\nYes - I oversimplified for space, my bad. The Amnesty recommendation is \r\n\r\n'Make all fees for all Estonian language courses reimbursable, also those taken by persons belonging to the Russian-speaking linguistic minority in order to improve their Estonian language skills and to acquire language certificates for employment.'\r\n\r\nI can't think of a humane policy better-suited to preserving Estonian culture than this - to pump resources into teaching Estonian to non-native speakers resident in the country.\r\n\r\nAmnesty _isn't_ proposing that (eg) all non-citizens be given citizenship; that the Russian language be given any non-minority status; that the language requirement be waived for citizens - none of that. After reading the Economist article, you could be forgiven for assuming that they did.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v7fq","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166517533,"author_flair_css_class":null,"timestamp_epoch":1566236772,"message_id":"37833-f14a20fb-49fb-4109-9854-8c9e07b5e328-1566236772"}