{"author":"berberine","author_flair_text":null,"parent_id":"t3_va3v","id":"cvbtl","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808903,"body":"&gt;My store manager implemented an embarrassing (and happily short-lived) safety incentive: Employees caught violating safety procedure were immediately given a two-foot rubber chicken on a string to wear around their necks–in front of customers. To get rid of the chicken, an employee needed to catch another employee behaving “unsafely.”\r\n\r\nWhen I worked in retail my boss tried a similar tactic.  It wasn't a rubber chicken but a little sign he'd made advertising the store to wear around the neck.  If you did anything not within store policy, you'd get the sign.  This policy didn't last a day as the employees fell into one of two groups.  They either didn't care enough to find someone else screwing up and just walked around with the sign in their hands or they threatened a lawsuit against the company for willful harrassment and making the workplace unbearable.\r\n\r\nThe store manager was quite shocked when many people said that this was not a way to instill positive reinforcement.  He too thought some free food would help.  He was also confused when several people said a simple, \"you're doing a good job\" type praise would actually go a long way in motivating people.\r\n\r\nIn the end, most of the people quit working there within two years because the negative reinforcement (do this or lose your job) was quite unbearable.  When I walk into that particular store today, most of the employees are nowhere to be found and, those that are, are milling about counting the hours until they can go home.  Apparently, 8 years later and they still haven't figured out how to motivate their employees.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_va3v","stickied":false,"subreddit":"reddit.com","score":0,"ups":0,"author_flair_css_class":null,"created_utc":1166517796,"timestamp_epoch":1566236772,"message_id":"37839-8db5396f-06f9-4986-b340-a9b4c8a26686-1566236772"}