{"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166524972,"body":"&gt;Life after death and the nature of consciousness are both very closely related, and are at their root inevitably philosophical questions and not scientific ones\r\n\r\nThis is the non-overlapping magisteria fallacy again. Science and philosophy are not hermetically distinct areas of investigation. Philosophers attend to evidence from neuroscience and biology. Psychologists and medical researchers attend to arguments from philosophy.\r\n\r\n&gt;Anyone who wants to both believe that their views are based not on speculation but scientific understanding, and wants to be honest with themselves would not hold a determinate position on the question of life after death as there is no scientific answer at this time.\r\n\r\nYou're moving here between 'have a belief based on evidence' and 'understand scientifically'. You don't need to understand something to be able to make correct statements about it (though it helps). Galileo didn't understand why objects of the same mass fell at the same speed, but he was right to say they did. I don't understand human consciousness, but I have overwhelming evidence that it exists only in association with a living human brain.\r\n\r\nConversely, 'a naturalistic worldview doesn't explain consciousness, so I have a supernatural worldview' just swaps the labels on the mystery. You are correct when you say that science doesn't explain consciousness, but nor does 'I have a soul' explain it - in that respect, there's nothing to choose between the two. Science does, however, have persuasive explanatory power when it comes to other stuff previously held to be supernatural (weather, marsh-lights, table-knocking) - which suggests it may ultimately help here, too.\r\n\r\n&gt;Any position one holds either for or against that view requires some kind of faith and is speculative. \r\n\r\nI believe there is no life after death, and that there is no God, in the same way that I believe that there are and were no WMDs in Iraq. I don't have 'faith' in the absence of WMDs, I'm proceeding from the lack of evidence from them and the strong circumstantial evidence against: which are both a great deal weaker than the lack of evidence for, and circumstantial evidence against, God and life after death.\r\n\r\nEqually, if a convincing nuclear facility was unearthed somewhere in the desert, then I'd change my opinion. Given sufficient evidence for reincarnation (eg, consistent, accounts of previous lives that couldn't be accounted for any other way) I'd change my opinion on that, too. Is there any evidence you could imagine that would change *your* opinion on reincarnation?\r\n\r\n&gt;I have had a number of experiences that are outside the scope of a naturalistic explanation\r\n\r\nYour snake could - for example - have been trained, or be mistaking something near the altar for a threat. That may be a stretch, but much less so than 'we have souls (we don't know what those are) - they came from somewhere we haven't explained - they go somewhere else in between their time in bodies - they interact with bodies in a way we can't describe - they only have any effect on animal behaviour in a few, non-reproducible circumstances' (unless you see snakes bowing daily?).\r\n\r\nA much bigger problem is that if I take your snake account at face value, I have to do the same for Christians and Muslims who see angels, and for classical accounts of descents to the underworld. How do I reconcile all these? Which do I pick? One elegant explanation that reconciles them all is that they're likely to be wishful thinking, confabulation, fiction and/or honest mistakes. By all means suggest a better, equally consistent one.\r\n\r\nYour clairvoyant flashes - given that you are, after all, 'just some guy on the Internet' and I don't know how reliable you are  :) - my first reaction is to assume that you've memorised some other things which didn't come true, and probably forgotten or de-emphasised some inconsistent details. If this isn't the case, then congratulations, you are unique among all the soi-disants clairvoyants or prophets I've read about or met, every one of whom had a lower than 100% success rate. :)\r\n\r\nLet's assume for the sake of argument that you really have clairvoyant experiences - I don't deny the possibility. It still says nothing about life after death. It doesn't poke holes in 'the naturalistic worldview' because brightism doesn't claim that everything has been explained - only that some alternative explanations ('God did it') are, on balance, on the available evidence, worse than others ('Just happened'). It's not an all-or-nothing proposition. If string theory turns out to be wrong, it doesn't mean that werewolves and astral projection exist.\r\n\r\nI mean, you *might* be right. There *might* be oxymoronic life after death. I'd bloody love there to be. It *might* also be true that the Nazca lines were made by aliens, and that God really talks to William Boykin. Right now, the evidence suggests otherwise. And to return to my original point - that Jesus and Lazarus either got up after death and walked around, or didn't, and if we *seriously* believe they did - not believe, vaguely, in some sense they might linger unreliably on as spirits - we should make researching it a serious priority.\r\n","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_v6h2","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473808910,"author_flair_text":null,"author":"lessofthat","id":"cvc62","parent_id":"t1_cvag7","edited":false,"timestamp_epoch":1566236772,"message_id":"37981-315effda-f557-40f3-b947-0085f25f4e05-1566236772"}