{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v7ee","controversiality":0,"body":"I don't think I really got the whole \"talking points\" thing until I started looking into this.  I read everything in the police report that ObviousTroll linked to and mapped out the seat locations on an Airbus a330 chart (which the police report says was the aircraft).  Then I started digging through the Washington Times articles and the PajamasMedia articles and the Power Line articles and Michelle Malkin and... Holy Crap!  It really is just one big echo chamber.  The same unsubstantiated crap bounces from one to another to another, with no congruency with reality at all.\r\n\r\nThe imams \"fanned out in a 9/11 pattern.\"  WTF?  Nobody has bothered to pin down their actual seating assignments.  It's not like US Air doesn't have that on record.  The police report has where they were actually sitting, and a) it's fucking random, and b) it doesn't match the PowerWashingtonPajamasTimesMediaLine concocted story of two at the front exit, two at the middle exits, and two at the rear exits.\r\n\r\n\"They refused to sit in their assigned seats.\"  WTF?  It doesn't say that in the police report.  The best I can figure is US Air assigned them their seats and then panicked when they saw where they were sitting.  I mean seriously - swapping occupied seats without permission?  Who does that without getting pummeled?  And why didn't any newspaper fact-check the seating assignments?  Maybe because that would show the Imams were sitting in their assigned seats?\r\n\r\nI'd like to blame this on journalistic stupidity and laziness, but this sure looks like fax-blasted talking points.","score":2,"ups":2,"created_utc":1166531454,"author_flair_css_class":null,"subreddit":"reddit.com","edited":false,"id":"cvce3","parent_id":"t1_cvaqy","author_flair_text":null,"author":"jvance","distinguished":null,"retrieved_on":1473808914,"gilded":0,"timestamp_epoch":1566236772,"message_id":"38069-8d69e48b-fa23-461a-b955-1d3e0fd6a7ae-1566236772"}