{"controversiality":0,"body":"&gt; If there was no C++, there would be no buffer overflows. It sounds like simplistic hyperbole, but it's not: the memory model of most other languages simply doesn't allow it.\r\n\r\nI agree with you there. C/C++ is probably the worst thing to happen to the field of Software Engineering and by the way things look, we will be paying the price for decades to come.\r\n\r\n&gt; Then I look at the code I write. As a quick &amp; dirty estimate, 70% of my bugs are due to mismanaged mutable state - the system does not currently hold the data I expect. Another 20% are type errors of some sort. Only about 10% of defects are logical errors, cases where I didn't actually understand the problem enough. \r\n\r\nI don't have hard numbers, but I'm pretty sure most of my errors come from the boundries. UI bugs and database access seem to be the areas I have the most trouble.\r\n\r\nThat and time zone issues. Time zones are hard to get right and .NET doesn't make it any easier. What's worse is that many of my company's partners failed to get it right, so we have to mangle the times on our end to talk to them.\r\n\r\nThings like closures are neat, but they are not solving the problems I'm having in my day to day programming. That's why I like the idea of Ruby on Rails. They picked a specific problem and tried to solve it. \r\n\r\n&gt; Languages matter. There are huge classes of problems that can be eliminated - completely - with some of these newfangled languages. The problem is, they usually introduce new classes of problems, and they require that you solve the old ones again.\r\n\r\nI agree with you there, I cannot imagine trying to do my job with something like C++. But when languages like SBCL don't play nice with Windows, they simply are not available to me. It sucks, but what can I do? Rewriting every application for Linux is not an option.\r\n","link_id":"t3_t1cf","stickied":false,"subreddit_id":"t5_2fwo","subreddit":"programming","author_flair_css_class":null,"created_utc":1165094168,"score":0,"ups":0,"author_flair_text":null,"author":"grauenwolf","id":"ctdjg","edited":false,"parent_id":"t1_ct764","gilded":0,"retrieved_on":1473807582,"distinguished":null,"timestamp_epoch":1566236759,"message_id":"3809-af1a9735-8f05-4179-bb39-7611401df18b-1566236759"}