{"score":48,"ups":48,"author_flair_css_class":null,"created_utc":1166532969,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vc4j","stickied":false,"controversiality":0,"body":"No. What can be done is less new artificial hips and knees, normal toothbrush instead of electric one. Cheaper car, TV, computer etc. Boomers will not get what they expect of course. But this has been the standard condition across the history. \r\n\r\nWhat is interesting to see is the impact of pension funds have to stock markets after baby boomer's start to retire. Really big part of stocks in and out of USA is held by  American and European pension funds. When boomer's start to retire (In America and Europe at the same time + Japan),  those funds turn from net byers to net sellers overnight (within 1-3 years from now). It does not matter how well companies do, if the major investors need cash every month. When stocks go down, funds must sell more to get the same amount of money. \r\n\r\nStock market capitalization 2003 (compared with GDP converted to € through estimated purchasing power parity (PPP) exchange rates)\r\n\r\n    * EU: €6.0 trillion (59% of PPP GDP)\r\n    * Japan: €2.4 trillion (75% of PPP GDP)\r\n    * United States: €10.7 trillion (108% of PPP GDP)\r\n\r\nOne way to measure the \"madness\" is to measure the value of the stock market's overall capitalization to the size of the national Gross Domestic Product. Historically the stock market value has been about 58% of GDP. Lows were in the range of 37% in the early 1950s, and 25% at the bottom of the Great Depression. Highs in this measurement were around 75% and occurred at all the important market turning points in the last 80 years including 1929 and 1966. As recently as 1991, the market was at the historic 58% level of GDP.\r\n\r\nSince 1991, all semblance to reality began to be lost in this particular measurement. By the 4th quarter of 1999 stock market capitalization had increased to stratospheric and unprecedented 185% of total GDP. Even today the rate is still 104%.","distinguished":null,"retrieved_on":1473808915,"gilded":0,"id":"cvchq","edited":false,"parent_id":"t1_cvcd5","author_flair_text":null,"author":"[deleted]","timestamp_epoch":1566236772,"message_id":"38104-101251bb-f361-4955-8135-d766ec1694f9-1566236772"}