{"subreddit":"reddit.com","created_utc":1166537062,"author_flair_css_class":null,"score":3,"ups":3,"body":"There are three problems with thinking torture would work in this hypothetical situation.\r\n\r\n1)  The scenario is a lie.\r\n You will never see the scenario because if they ever got into a position to capture a terrorist that had planted a bomb, they had to have gotten enough other information that the scenario is not true.  \r\n\r\nWhat do terrorists that plant bombs suddenly get sucked up by tornadoes and deposited in front of CIA operatives in this hypothetical world?  Cause I can't think of a single other way it could ever work like that.\r\n\r\n2) The morality of it is a lie as well. \r\nTorture is reprehensible.  It is causing another human being to be subjected to treatment that on several levels turns them into less than human.  You cannot justify that, ever.  The moment you reduce another human being to a sobbing mass of pain,  confusion, and fear you have done something horrible.  You have used terror as a weapon.  Torture is done to degrade and control, it is not about gaining information.\r\n  Take the high road and interrogate the guy with good interrogators and you will have the info.\r\n\r\n3) The scenario is STILL a lie.\r\nHow come none of these hypothetical situations have the folks that are good interrogators in them?  If you need torture to get info and you are in the FBI, you suck.  Seriously.  Detectives are good at picking up clues, why do we always think they suck at it?  Hell, even in the Hollywood scenario they have to fudge it.  If they hade the guy from Criminal Intent in the room, he'd have your bomb location in about 5 minutes and he'd tell you what the guy ate for lunch too.","controversiality":0,"stickied":false,"link_id":"t3_v9pw","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473808921,"distinguished":null,"author_flair_text":null,"author":"crazyjoe","edited":false,"id":"cvcqx","parent_id":"t1_cvbk3","timestamp_epoch":1566236772,"message_id":"38201-f49cd22e-0f52-4369-822b-fd1350d5d957-1566236772"}