{"edited":false,"id":"cvdbt","parent_id":"t1_cvbkq","author_flair_text":null,"author":"nostrademons","retrieved_on":1473808931,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_v88c","subreddit_id":"t5_6","controversiality":0,"body":"&gt; wrong! wrong! three times wrong! i can assure you that most firms in the SP500 are holding debt.\r\n\r\nHolding debt != borrowing.  Firms take on debt when the resulting investment can grow earnings at greater rates than the cost of capital.  They pay down debt when the cost of capital exceeds the expected return to that capital.  Right now, capital is cheap and demand is rising, so rational companies borrow and use that money to increase capacity.  That does not mean they cannot grow without outside capital: it means they grow faster *with* outside capital, and the cost of capital is currently low enough to make that profitable.\r\n\r\nYou still have not addressed my point that holding debt is *beneficial* in times of inflation, since companies pay back loans with cheaper dollars than they borrowed.  That *is* Introductory Economics material (literally; it was in my Introductory Economics course).  \r\n\r\nNor have you given any indication that you understand the difference between real interest rates and nominal interest rates.  Nominal interest rates shoot up in periods of inflation, because lenders need to be compensated for being paid back in cheaper dollars than they lend out.  Real interest rates often *drop*, because lenders takes time to adjust their terms to the new inflation rates.  Assuming that a company has the ability to raise prices in line with inflation, its cost of capital is the *real* interest rates.  So if you phone Microsoft's CFO and ask if they'll be affected adversely by high interest rates, of *course* he'll say yes.  If you phone him and ask him if they'll be affected adversely by inflation, he'll say \"Depends.  Probably not so much.\"","created_utc":1166545365,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","timestamp_epoch":1566236773,"message_id":"38513-b2afffa7-cbd2-422a-a37e-2013378fdc6e-1566236773"}