{"retrieved_on":1473808936,"distinguished":null,"gilded":0,"edited":false,"parent_id":"t1_cvde1","id":"cvdij","author_flair_text":null,"author":"sblinn","created_utc":1166547571,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vcqz","subreddit_id":"t5_6","controversiality":0,"body":"&gt; **Its** a form of abuse.\r\n\r\nIts --&gt; It's.\r\n\r\nAnyway, to your points: this is what *any* overly protective upbringing that doesn't correspond with reality can do, whether it's Catholic, pagan, or Pastafarian. But maybe I do not understand UK school years correctly -- here in the States, \"Year 11\" might be interpreted as \"11th grade\", meaning one year before graduating high school -- meaning 17 years old. At 17, my guess is you have some capability of understanding that your baby is kicking you in the spleen, etc. From reading the article, though, the girl was 15, but even then it really makes you wonder how you really might not know you were pregnant.\r\n\r\nBut to the \"abuse\" claim: I think we have to be careful here. Obviously there is undenyable abuse that goes on between parents and their children -- sexual, physical, emotional, etc. Is not teaching the concepts of sex and pregnancy to your daughter by the age of 17 fairly stupid parenting? Yes. Is it abuse? I don't think we can go that far.\r\n\r\nHere in the States, Catholic churches have pamphlets outlining various things to do when you're pregnant, talking about adoption through the church, and if applicable to the particular state listing local safe havens to leave your child, etc. Also: \"no understanding of what pregnancy might be?\" This is the religion that practically deifies the story of the virgin birth, right? Presumably when studying this story, one might come acros concepts like birth, pregnancy, and virginity. Much of the Bible is filled with sex, rape, marriage, children, etc, etc, ad nauseum.\r\n\r\n*disclaimer*: I am a non-theist.","timestamp_epoch":1566236773,"message_id":"38615-92fe2593-64ed-4d0b-8093-a950df60e6e4-1566236773"}