{"stickied":false,"link_id":"t3_vc4j","subreddit_id":"t5_6","body":"Lowered entitlements would be a good thing.  Since when is anyone \"entitled\" to the product of my labor or my brain?  The fact that baby boomers \"paid into\" the system just makes them suckers.  They were sold a bill of goods and did not have enough children to keep up the charade.  What if I just stop working or work only as much as I need to survive?  I'll take care of my parents but what if I don't feel like supporting anyone elses?  It's easy enough to cut back and survive if you just turn off the TV and stop buying useless junk.\r\n\r\nOne thing I never hear mentioned by pessimists is the almost boundless depths of ingenuity in the US.  Since when do we all have to be corporate worker bees?  The information is all over the place in books and on the internet which will help you to free yourself from this dependancy.  If you don't like your living standards, fix it!  Don't be dependant on the corporate job and don't depend on the government for \"retirement.\"\r\n\r\nAnother thing I never hear mentioned when considering the solvency of the government is the vast land holdings in the Western US.  With a little thought and some controlled selling, the government could put most of this land into productive private use over the course of a couple decades.\r\n\r\nWe might have a rough ride ahead but then we might not.  Who knows what Atlases our generation will produce?  Who knows what entirely new industries (space?), sources of energy (fusion?), health and quality of life advances may be brought about by these intrepid souls?  Just because you can't imagine a richer, better future, doesn't mean someone else can't.","controversiality":0,"created_utc":1166553506,"author_flair_css_class":null,"ups":1,"score":1,"subreddit":"reddit.com","id":"cve14","parent_id":"t3_vc4j","edited":false,"author_flair_text":null,"author":"stalcottsmith","retrieved_on":1473808946,"distinguished":null,"gilded":0,"timestamp_epoch":1566236773,"message_id":"38914-3cc3b3ec-5596-497e-945d-77f8cfd394f0-1566236773"}