{"body":"&gt;You are welcome to the $130k we spent on your public school education.\r\n\r\nEducation is an investment. The fruits are worth far more (even in a financial sense) than the cost of cultivating the tree. So don't break your arm patting yourself on the back there; public education is hardly charity. It more than pays for itself.\r\n\r\n&gt;...you better stay off the damn roads and bridges we built...\r\n\r\nIf you're taking credit for the roads, don't you have to take the blame as well? Even after the last Boomer is dead and gone, we'll still be paying intrest on the debt incurred to build those expensive interstates, we'll still be wasting our lives sitting in the ridiculous traffic jams we negotiate each day on our way to work, we'll still be working extra hours to pay for the damn car in the first place, and we'll still be converting countless tons of precious petroleum into greenhouse gasses every day. The interstates are at best a decidedly mixed bag, and at worst they're a cursed enabler of our reviled endless modern suburban sprawl and arguably of the shallow material culture that goes with it.\r\n\r\n&gt;...throw away the cellphone and the computer - some boomers made those happen.\r\n\r\nUh-huh. What happened after you \"made those happen?\" Was that ball just too slippery to hold on to?\r\n\r\nHow come you can get 100Mb fiber-to-the-premises in Japan for what a pathetic 3Mb connection costs in the US? How come cell airtime costs 5x-10x as much in the US as it does in Israel? How come what passes for a \"broadband\" connection here in the US doesn't even legally qualify for that title under Canadian law? How come the biggest retailler of MP3 music is in *Russia*, of all places?\r\n\r\nThe Boomer business generation has arguably done everything it could to *hold back* America's progress in high tech, by doing everything it could to monopolize every inch of progress that came along.","controversiality":0,"link_id":"t3_vc4j","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166555512,"score":23,"ups":23,"author_flair_text":null,"author":"Lagged2Death","edited":false,"id":"cve6x","parent_id":"t1_cvd2r","gilded":0,"retrieved_on":1473808949,"distinguished":null,"timestamp_epoch":1566236773,"message_id":"38997-81fa07fe-3dc3-4233-bed8-db2e588a6c21-1566236773"}