{"retrieved_on":1473808953,"distinguished":null,"gilded":0,"id":"cvegw","edited":false,"parent_id":"t3_ve60","author_flair_text":null,"author":"setuid_w00t","created_utc":1166559299,"author_flair_css_class":null,"score":32,"ups":32,"subreddit":"reddit.com","stickied":false,"link_id":"t3_ve60","subreddit_id":"t5_6","controversiality":0,"body":"**1. Filtered water bottle:**  Buy a regular water bottle for $3 and drink tap water.  Don't be such a pussy.  Water in North America is fine.\r\n\r\n**7. High End Solar Calculator:** Learn how to do simple math in your head - $0.\r\n\r\n**11. Fuel-Efficient Scooter:** Unless you cover a lot of distance on a scooter or can use it as your primary vehicle, the cost of the scooter + accessories  + insurance is unlikely to save you much money.  Public transit + bike is cheaper.  Biking will make you sweaty and it's slower than a scooter, but it will actually save you time because you won't have to go for a workout at the end of your day.\r\n\r\n**17. Coin Sorter:** I don't think I have rolled coins in years and I don't have a stockpile at home either.  I use coins to buy stuff.  $95 for a sorting machine is a huge waste.  Where am I supposed to store all these useless gadgets too?\r\n\r\n**22. A Laptop:** Laptops are more expensive than desktops for equal performance.  If you require a very high performance machine, a laptop isn't even an option.  Laptops use less power than desktops, but they are highly integrated, so they won't last as long.  Consider the cost of replacing a laptop keyboard vs a desktop keyboard.  Laptop batteries only last a few years and they are expensive to replace.  When a desktop is too slow, it can usually be upgraded, laptops are not usually upgradeable.\r\n\r\n**24. A Hybrid:** The last I heard, hybrids only make sense for very high mileage drivers (like taxi drivers).  Anyone else isn't going to make back their high initial investment.","timestamp_epoch":1566236773,"message_id":"39164-16bbc933-a20b-4156-a7d2-f034d3729e70-1566236773"}