{"subreddit":"reddit.com","score":2,"ups":2,"created_utc":1166562956,"author_flair_css_class":null,"body":"Well, there are a couple of things operating here.\r\n\r\n1)  Traders and investment bankers (more likely than analysts to get huge payouts) often work on commission.  A trader will get a cut of his gains over a year.  You can argue that the percentage is excessive (I can't recall, but I think something like 5%) but this is a bit different than being granted 100,000 shares for getting hired.  In fact, the head of a trading desk will get a larger cut of his gains and a cut of all of his traders' gains as well.  I have a friend working as a trading assistant and evidently the head of the desk got some $20mm payout recently.  A superstar prop trader at Goldman is going to see $100mm payout.  Likewise, investment bankers get bonuses for the deals they close (some when the deal is agreed upon and some when the deal closes) which is why there's such a rush of i-banking deals at the end of the year (so the bankers get their cash this year instead of next).  Yes, these payouts are ridiculous (and part of the billions), but have a pretty fundamental difference from executive compensation.\r\n\r\n2) Additionally, a number of the Board members usually aren't shareholders in the company (by design) and make (exorbitant) consultancy fees.  While they don't have an interest in overpaying traders, they aren't necessarily against it.\r\n\r\n3) This all tragically (to me at least!) draws from an attribution error.  Namely that revenue employees seem to be *de facto* more valuable than expense employees.  IT employees at these banks are highly skilled and do (I'd imagine) very valuable work, while I hear (because of things like volume, spreads, access, ...) many traders would have to *try* to lose money (or screw up uniquely horribly, a la Amaranth) ... granted, the trader won't be a star, but it's still not incredibly tough to turn a profit.  So it ends up going disproportionately to some segments of the company and not others.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vd09","gilded":0,"distinguished":null,"retrieved_on":1473808960,"author":"duketime","author_flair_text":null,"edited":false,"parent_id":"t1_cveo2","id":"cvese","timestamp_epoch":1566236773,"message_id":"39310-05184207-2a93-495d-8ac5-52688a43ec83-1566236773"}