{"author":"asokoloski","author_flair_text":null,"parent_id":"t1_cvdgh","id":"cvexe","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808962,"body":"Actually, anarcho-capitalism solves a public goods problem with government; that is, the creation of law.  The end of [this article](http://www.dianahsieh.com/internet/1997.12.11.html) goes into detail.\r\n\r\nDavid Friedman's argument is basically that with government, a good law benefits everyone slightly, but costs a lot for any one person to create.  Good laws are therefore a private good.  Bad laws (like the drug war laws), on the other hand, benefit a very small group of people, such as a lawmaker or the police or a particular company or industry, and thus bad laws are a private good (but obviously a public bad).  The reason this is the case is that a very small number of lawmakers have exclusive control over all the laws of everyone in the country.\r\n\r\nNow, with anarcho-capitalism, it would be more similar to lots of tiny states, where anyone can leave or join a state or start their own at will.  In this situation, if create or work for a good law, the benefit is much greater to you relative to the amount of work you have to put in.  On the other hand, if you want to make a bad law that benefits you at the expense of others, you're going to have a huge amount of work to do -- you need to essentially finance your own entire brand-new government (with a military), which is no small feat.  Compare this to the ease of simply paying for a few nice trips for a few lawmakers, which is all it takes to pass bad laws when a government is already in place.\r\n\r\nAs far as free-riding goes, that's essentially a market inefficiency.  The great thing about the market though, is that given enough time, someone will figure out a way to make money off the inefficiency.  For example, broadcast television is a public good, but it wasn't long before somebody figured out that advertising solves the free-rider problem.  Now, since Tivo has created another free-rider issue, it's likely that advertisers will gradually shift to product placement to solve it.\r\n\r\nThe great thing is that this all happens gradually and without the heavy-handedness of typical government regulation.  The problem is that because market solutions are sometimes very subtle, people call for government intervention anyway.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vcvm","subreddit":"reddit.com","score":7,"ups":7,"created_utc":1166564274,"author_flair_css_class":null,"timestamp_epoch":1566236773,"message_id":"39386-7518f9b4-3566-4a9a-a701-129388b993e0-1566236773"}