{"body":"Abbotsford, BC – Making Homelessness a \"Stitch in Time\". The recent cold snap spurred one local resident into action to help Fraser Valley's homeless. Tammy Murray, a single mother of two, has designed a unique blanket to provide warmth and comfort for Fraser Valley’s homeless this winter. \"When the shelters are full the homeless literally have no where to go. Emotional stress, dampness and cold manifests as physical stress and dramatically reduces life expectancy.\" says Murray.\r\n\r\n \r\n\r\nWith the help of a textile professional, Tammy created a durable mold and mildew resistant rip-stop nylon blanket lined with a non-wicking fleece for maximum warmth. It is remarkably light and packs up into its own small casing. The straps allow the Homeless recipient to attach it to their waist, suspend it from their shoulder or stow it away easily.  Tammy quickly discovered that her desire to help one at-risk population could benefit another. Tammy's unique design is being manufactured by prison inmates taking part in the CORCAN rehabilitation program offered by the Correctional Service of Canada. CORCAN participants gain employment skills and experience while contributing to their own incarceration costs.\r\n\r\n \r\n\r\nTammy stated that “The realization that my doing nothing impacts others more so than my involvement really inspired me to choose an area I want to affect and begin making a difference. Although my intent is to assist the Fraser Valley homeless residents, I would like to include other areas and have as many of these blankets out there as possible.” These blankets are exceptionally durable, portable and provide maximum warmth. Tammy's goal is to raise the $5,000 necessary to produce 100 blankets and purchase 100 flashlights, but she needs your help.  You can reach Tammy at 604 612 8444 or e-mail her at astitchintime@telus.net.\r\n\r\n \r\n\r\nThe money raised will provide the homeless with a blanket and flashlight that does not require batteries. There is no cost to operate the flashlights and no toxic batteries discarded into our environment. The LED bulbs have an amazing life span and eliminate the need for candles to provide light, reducing the risk of fire from open flames.\r\n \r\n   \r\n \r\n","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_vf3b","stickied":false,"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166566550,"author":"astitchintime","author_flair_text":null,"parent_id":"t3_vf3b","edited":false,"id":"cvf3t","gilded":0,"distinguished":null,"retrieved_on":1473808966,"timestamp_epoch":1566236773,"message_id":"39493-6545ef69-e233-4875-8e93-18487fffc727-1566236773"}