{"body":"Not even close. \r\n\r\nAnti-matter is a kind of charge flipped version of normal particles. Ex. a positron is like an electron except its charge is +1 instead of -1; an anti-proton is -1 instead of +1. An anti-neutron is, like a regular neutron, charge neutral. But if you look at the sub-structure of an anti-neutrino, you'll find that their charges are the reverse of normal. Anti-neutrinos are neutral, like regular neutrinos. Unlike neutrons, neutrinos don't have any substructure, so there's no big difference between normal and anti- neutrinos except the second notable fact about anti-matter: when normal matter touches its anti-matter counterpart, both annihilate and become the E=MC2 energy equivalent of their masses. Since (to our knowledge) the universe is mostly made of normal matter, anti-matter tends to hit some normal matter before long and disappear in a burst of gamma radiation. \r\n\r\nDark matter is just a generic term for \"stuff that has mass but we can't been see with our telescopes.\" The reason scientists think that dark matter exists is that gravitation theory predicts that certain sizes and shapes of galaxies should move in certain ways, but the galaxies break our predictions. Now, we can either assume gravity is different than we expect on a galaxy wide scale or there are objects that are too dim to be seen by telescopes but which nevertheless have a lot of gravitation force. Candidates for this include Jupiter-like balls of non-burning gas and a variety of sub-atomic particles. I'm not sure which is the leading candidate these days. They found that neutrinos do have mass, so I guess they're in the running, but Jupiter-like bodies also had some evidence a couple years back as I recall. Anyway, it's still an open question for astronomy/cosmology.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_urqc","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166567775,"author_flair_css_class":null,"author":"earthboundkid","author_flair_text":null,"id":"cvf6v","edited":false,"parent_id":"t1_cuu9d","gilded":0,"distinguished":null,"retrieved_on":1473808968,"timestamp_epoch":1566236773,"message_id":"39550-18332d65-0d7f-40a7-8363-d469a81d007f-1566236773"}