{"body":"What good do points do you? I have no idea, so why would I go for something that isn't worth anything?\r\n\r\nAnd, here goes a pitiful attempt at humour, I did follow your advice:\r\n\r\n`douche bag`: `n`; see [staunch](http://reddit.com/user/staunch).\r\n\r\nAnyway, you originally wrote:\r\n\r\n&gt; Are you sure it's correct that millions of Indians were exterminated at the hands of Americans due to racism?\r\n\r\nThen I wrote:\r\n\r\n&gt; Look up \"manifest destiny\" sometime. Basically: \"We will kill the natives and take their land, because God himself wills it for the white American people.\"\r\n\r\nThen you, and the mind boggles here, wrote:\r\n\r\n&gt; You didn't even address what I said.\r\n\r\nhttp://en.wikipedia.org/wiki/Manifest_Destiny#Native_Americans\r\n\r\n&gt; Advocates of \"civilization\" programs believed that the process would greatly reduce the amount of land needed by the Indians, thereby making more land available for purchase by white Americans.\r\n&gt;\r\n&gt; ...\r\n&gt;\r\n&gt; In the age of Manifest Destiny, this idea, which came to be known as \"Indian Removal\", gained ground. Although some humanitarian advocates of removal believed that American Indians would be better off moving away from whites, an increasing number of Americans regarded the natives as nothing more than \"savages\" who stood in the way of American expansion. As historian Reginald Horsman argued in his influential study Race and Manifest Destiny, racial rhetoric increased during the era of Manifest Destiny. Americans increasingly believed that Native Americans would fade away as the United States expanded. As an example, this idea was reflected in the work of one of America's first great historians, Francis Parkman, whose landmark book The Conspiracy of Pontiac was published in 1851. Parkman wrote that Indians were \"destined to melt and vanish before the advancing waves of Anglo-American power, which now rolled westward unchecked and unopposed\".","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_vat3","stickied":false,"subreddit":"reddit.com","score":-1,"ups":-1,"author_flair_css_class":null,"created_utc":1166574709,"author":"sblinn","author_flair_text":null,"parent_id":"t1_cvfjv","id":"cvfmg","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473808977,"timestamp_epoch":1566236773,"message_id":"39800-226d25c1-309a-478c-b68e-f7adcac169bb-1566236773"}