{"author":"lessofthat","author_flair_text":null,"id":"cvfr5","edited":false,"parent_id":"t1_cvf8t","gilded":0,"distinguished":null,"retrieved_on":1473808978,"body":"&gt;What constitutes adequate reason in philosophy is very different than what constitutes evidence in science. \r\n\r\nYes, and you do us both a disservice by assuming I'm not aware of that.\r\n\r\n&gt;There are plenty of philosophical arguments postulated for centuries from Plato on to today for the existence, nature, and immortality of the soul,\r\n\r\n 'There are arguments' is not in question. There are also philosophical arguments that 'the yellow race' must be destroyed, and that everything is made of fire. You do not refute my argument by name-checking Plato, you do so by presenting evidence; which, by all means, need not be 'scientific' evidence.\r\n\r\n&gt;Do you notice that you keep taking scientism as true by default? It's really a poor philosophical model. As has been mentioned, you can't have experiential evidence unless you die,\r\n\r\nI'd consider _consistent, repeatable and convincing_ evidence of any of the following to be relevant: (eg) memories in reincarnated individuals, communion with animistic spirits, communication with discorporate humans (living or dead). None of these require my own death. Unfortunately all the evidence I'm aware of is inconsistent, more convincingly explained by other means, or both.\r\n\r\n&gt;so too do partisan atheists tend to forgive the excesses of their favorite extremists.\r\n\r\nI am not a 'partisan atheist', I am an atheist, who, for the record (see a number of my comments here and elsewhere) considers several of Dawkins' opinions excessive (and, as above, his sarcasm heavy-handed). Please do not generalise about me. He cannot, however, match the excesses of religious extremists.\r\n\r\n&gt;\"The God of the Old Testament is arguably the most unpleasant character in all fiction: A misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully.\"\r\n\r\n'Arguably the most unpleasant character in all fiction' is hyperbole. Each of those adjectives, however (with the arguable exception of 'sadomasochistic') is demonstrably true from the primary source. It's provocative, but patently not as 'divisive and hate filled' as urging the assassination of a head of state or the nuclear destruction of Foggy Bottom. \r\n\r\n&gt;He has argued that parents who teach their children to believe in God are guilty of child abuse. \r\n\r\nThis is, as far as I know, a distortion. He has argued that religious indoctrination with the explicit threat of damnation is 'a form of psychological child abuse'. He has not, as far as I'm aware, argued that simply teaching a belief in God, without any of the all too common sinister baggage, is abuse. Can you cite anything otherwise?\r\n\r\n&gt;He named his show about religion \"The Root of All Evil.\"\r\n\r\nDawkins  on the documentary (p.1 of the preface of 'God Delusion'): 'From the start, I didn't like the title. Religion is not the root of all evil, for no one thing is the root of all anything.'\r\n\r\nElsewhere - no references to hand, I'm afraid - he's said that Channel 4 insisted on the name to promote controversy, and that he managed to get them to put a question mark at the end of the title as a compromise (you omit the question mark above).\r\n\r\nDawkins is the most extreme atheist with any public influence (I discount Student Union bores) that I've ever come across: and even the distorted version of his views you provide above does not remotely promote violence of any kind. Either of us could easily name a dozen religious extremists who enthusiastically urge violence and intolerance, without stopping to draw breath. The fact that Pat Robertson and Dawkins express opposite views does not mean that the reasonable middle ground lies exactly between them.\r\n\r\n&gt;pompous...shallow...devoid of empathy...divisive...venomous...wilfully blind...zealous\r\n\r\nI can't meaningfully answer that kind of *ad hominem* without responding in kind. I'll pass.\r\n\r\nedit: noticed you'd responded to a point of mine that I'd missed. Long posts.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_v6h2","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166576884,"author_flair_css_class":null,"timestamp_epoch":1566236773,"message_id":"39874-ed15a4ad-294d-47de-a132-f4e70d8168cd-1566236773"}