{"controversiality":0,"body":"There is a one-liner:\r\n\r\n    if(newValue != null &amp;&amp; !newValue.equals(isRecordLocked) || isRecordLocked != null) setDirty(true);\r\n\r\nAnd yeah, I had to write out the three-way truth tables to come up with it.  Basically, there are nine possible combinations of (true, false, null) with itself.  The original code is setting the dirty bit on the diagonal, every case where both variables are equal.  That includes isRecordLocked == newValue == null, isRecordLocked == newValue == true, and isRecordLocked == newValue == false.  \r\n\r\nWe can't actually perform the equality test until we're sure that the left argument is non-null, because it'll throw an NPE.  So the first clause checks newValue for null, removing the null column from our truth table.  Then we want the the dirty bit set only if they're not the same, so we throw in `&amp;&amp; !newValue.equals(isRecordLocked)`.  Java's `equals()` method just returns false if the right-side is null, so we don't need to worry about NPEs there.\r\n\r\nThat leaves out two cases, where newValue == null and isRecordLocked is not.  So we add them back in with `|| isRecordLocked != null`.  Same truth table as the original code; I just replaced the ifs with boolean short-circuiting.\r\n\r\nIncidentally, I've had to write code essentially identical to this.  I ended up with the solution above, but then decided to change it *back* to the code in TheDailyWTF for readability purposes.  It's somewhat opaque why you need the || isRecordLocked != null, and conditionals look better with comments.","stickied":false,"link_id":"t3_tdls","subreddit_id":"t5_2fwo","subreddit":"programming","created_utc":1165102338,"author_flair_css_class":null,"score":4,"ups":4,"author_flair_text":null,"author":"nostrademons","id":"ctdzw","edited":false,"parent_id":"t1_ctdop","gilded":0,"retrieved_on":1473807592,"distinguished":null,"timestamp_epoch":1566236759,"message_id":"4026-4d4f8534-0cce-4346-897c-4d0c4d55e505-1566236759"}