{"body":"Much has been written on said topic, some with anger, some with desire to cause anger for self entertainment, and some neutral and/or without anger.\r\n\r\nDisclaiming myself from saying that I am stating many of you are trying to prove a point, win, shut someone down, or perhaps another reason, I am not. I am 'just saying'.\r\n\r\nYour own opinions do not determine what the facts are. Your perception does not define truth and non-truth accept for you alone. It is possible that your perception is in common with the perceptions of others, but general consensus still does not define facts. Facts are unchangeable. You may question, the definition of the word Fact, but is that not your opinion? It is not what the 'dictionary defines' it is what is.\r\n\r\nSo take this as fact or opinion however you please. Their is much disrespect for ones point of views, who are you to say someone is wrong. Who are you to say your source is the reliable source, you have no authority in this but according to yourself and perhaps by the respecters of you views, yet that does not mean fact is shown, this does not mean your perception of a way of life is the true and right perception, who is to even say their is only one right way.\r\n\r\nWhen you ask someone for advice do you want people to trash your style of life? And don't say she was asking for it, that is close minded as I would see it. \r\n\r\nRespectably I would say, we all have our own trials in life, you can give in to them, or you can work to reach a new and higher level of self mastery. All of those who feel she should 'give in', how many of you could honestly say you could stop your way of life of less intimate intimacy right now and live it in a way that practices a harder level of self control. I would dare say many of you think that you could easily, and if I were a betting man, I would put much money on the table against your favor.\r\n\r\nTo become a master of ones-self is a long hard journey. To maintain mastership of ones-self is a long journey with hard times. Their is a difference. I am not saying that anyone is a master over themselves, that is a life long journey, but perhaps the 'rules', as it is typically seen, of the Mormon church are to teach self mastery. If you have a high level of self-mastery then the objects of the world do not effect who you are or what you do. If you have a low level of self-mastery then the objects of the world do effect who you are and what you do. Don't you want to be in control of your life? Most humans do, but they (I am not discluding myself) become desensitized and follow the ways of the world.\r\n\r\nThis is my perception.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_u69m","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166592145,"author_flair_css_class":null,"author":"springbreeze","author_flair_text":null,"parent_id":"t3_u69m","edited":false,"id":"cvgi0","gilded":0,"distinguished":null,"retrieved_on":1473808993,"timestamp_epoch":1566236773,"message_id":"40309-22a08632-57c8-424d-b6a9-4e21362f4629-1566236773"}