{"parent_id":"t1_cvg5c","edited":false,"id":"cvh1i","author_flair_text":null,"author":"Alpha_Binary","retrieved_on":1473809004,"distinguished":null,"gilded":0,"link_id":"t3_vd9p","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"Nope, no religious basis is necessary. Just because it's two thousands five hundred years old does not mean it's not science.\r\n\r\nWhat you describe is more like a sign of high concentration, which is also a part of meditation. **I wouldn't pretend to be an expert because I'm not.** Concentration is when you focus your mind on a single thing and *try* not to be distracted. When your level of concentration gets really high, weird things begin to happen. You can say it is the basis of supernatural power, though that, like everything else, is up for debate.\r\n\r\nWhen concentrating deep (and I mean *deep*), it's only natural that your senses shut off so you don't hear what you normally do. There are also other side effects that come with high concentration, like the drifting feeling you experienced. Some people hear imaginary voices and see imaginary pictures, which is totally normal. It's entirely subjective how you choose to respond to them, but basically they're plain nonsense; just a trick of mind. You should never focus on them, or become attached to them, since that will greatly hinder your progression to higher levels, if you choose to, that is.\r\n\r\nGood meditation, however, does not focus on concentration; rather: a good balance of concentration and conciousness. I may be stating the obvious here; conciousness is basically being aware of yourself, your body, your senses and your thoughts, but to take no control over them. It's totally passive. You are merely the observer. Your thoughts will run wild, surely, at least at first, but every time you regain the awareness that it's wandering it will be back in place. The same goes with environmental noises: you do not attempt to block them, just be aware that they happen; don't even try to recognize them. Soon they will cease to register in your senses. This is the same thing as the painblocking mentioned in the above thread.\r\n\r\nI hope those serves as some guidance should you decide to look up further in these matters.","author_flair_css_class":null,"created_utc":1166608662,"score":5,"ups":5,"subreddit":"reddit.com","timestamp_epoch":1566236773,"message_id":"40534-ff8d2972-5e2d-48db-96e6-36a5996ead36-1566236773"}