{"body":"I disagree wholeheartedly.  While Blackwater is somewhat creepy, it is much less wasteful in terms of real dollars spent versus results garnered. In a pure cost versus benefit analysis, Blackwater wins hands down.  I think people are afraid of them because they seem to operate outside the oversight of Congress.  Unfortunately, the US military and other government branches are pretty much uncontrolled as well. So what is the real difference?  Remember the Iran/Contra drug flights landing in Miami at US airbases?  Or more recently, the Abu Ghraib torture scandal?  \r\n\r\nAlso, go visit a US military base.  Better yet, go visit the town near one of these bases and notice all the drugs, violence, poverty, number of soldiers receiving welfare, broken families, etc.  What you call \"greed\" I call \"getting compensation commesurate with the amount of risk being assumed.\"  If you must soldier for a living, at least get paid a reasonable wage.\r\n\r\nNationalistic patriotism is bullshit--it is how states get otherwise rational people to risk dying on behalf of someone else's agenda.  Talk about padding your margins by exploiting someone!  People cheapen themselves in the name of shiny medals and fancy uniforms and get nice funerals or a lifetime of pain and misery.  What a deal!  Sign me right up!  Actually, I'd rather have the suitcase of cash or the Swiss account balance for my trouble, thanks.  Tax free?  All the better.\r\n\r\nI do agree though that we ought to call them mercenaries and stop playing games with semantics.  On the other hand, the entire US military is a quasi-mercenary army because the soldiers are not conscripts.  Getting money for college and a \"signing bonus\" (makes kids feel like rocks stars) is just spin for \"underpaid mercenary with high self-esteem.\"\r\n\r\n\r\n  \r\n\r\n\r\n\r\n","controversiality":0,"link_id":"t3_vg01","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166623571,"score":13,"ups":13,"author_flair_text":null,"author":"[deleted]","id":"cvhm5","edited":false,"parent_id":"t1_cvgpt","gilded":0,"retrieved_on":1473809016,"distinguished":null,"timestamp_epoch":1566236773,"message_id":"40765-e2ed7937-2896-471f-96f0-a89f67ffd3df-1566236773"}