{"author":"smacfarl","author_flair_text":null,"parent_id":"t1_cvgti","edited":false,"id":"cvj56","gilded":0,"retrieved_on":1473809045,"distinguished":null,"controversiality":0,"body":"Okay before I really get into this lets get an agreement on what your \"principle\" here is.\r\n\r\nIs it that\r\n\r\n\"The Vice-President should be able to withhold only his own visitor logs from the public unless there is a law that forces him to do otherwise.\"\r\n\r\nWhy you keep calling my arguments strawmen is an inaccurate use of vocabulary at best.  [A Straw Man is \r\n\r\n&gt;Function: noun\r\n1 : a weak or imaginary **opposition** (as an argument or adversary) set up only to be easily confuted\r\n2 : a person set up to serve as a cover for a usually questionable transaction](http://www.webster.com/cgi-bin/dictionary)\r\n\r\nMy intention and the clarity of the writing up to this point indicates rather than setting up something to be knocked down I am bolstering my argument. My argument is that\r\n\r\n\"The Vice-President has no actions that should be unexamined by the public, particularly this vice-president who has demonstrated criminal negligence and misuse of the powers of his office. Further in the role of a publicly elected official, rather than say an employee of a spy agency or intelligence service, the Vice-President and every other publicly elected official should be meticulously examined by the public to maintain his honesty and effectiveness. The controversy over the visitor logs are just a small symptom of a larger problem, which is the unwarranted power grab of the executive of recent years which has been solely instigated by the office of the Vice-President and his staffers.\"\r\n\r\nTherefore the point against which I am arguing, by its construction, is over the much larger principle, being the limit of executive power in the US, of which this latest skirmish is but a footnote.\r\n\r\nNow as for loop hole. Loop hole in what? I think that avenue alone will take us to the central point of your \"principle\".","stickied":false,"link_id":"t3_uuhf","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166642864,"author_flair_css_class":null,"ups":0,"score":0,"timestamp_epoch":1566236773,"message_id":"41538-c94e08af-8dca-4968-a617-a709188f45e9-1566236773"}