{"body":"First of all, allow me to appologize. \r\n\r\nMy comments were not meant to be directed at you or your project, rather they were the result of my overall frustration with people talking about how new-tech X is the best thing since sliced bread even though it is no where near ready. Usually it is not the people working on X doing this, but rather their rabid fans.\r\n\r\nAs for my comment, my biggest issue is the same issue I have with most documentation. You need to step back and think about the next question the programmer would ask. For example:\r\n\r\n&gt; create_app(AppName::string(), AppDir::string()) -&gt; ok | {error, Err}\r\n\r\nWhat is the AppName parameter for? It isn't mentioned in the document.\r\n\r\nIf AppDir a file system path or a url path? Is it absolute or root-relative?\r\n\r\nIt looks like this can return an error. So what are the possible errors and what conditions trigger them?\r\n\r\n&gt; Create a new ErlyWeb application in the directory AppDir. This function creates the standard directory structure as well as a few basic files for a rudimantary application. \r\n\r\nWhat is the \"standard directory structure\" and where is it documented? And what exactly are the \"few basic files\" that it creates?\r\n\r\nOnce you have listed the files, the next question is what are those files for? Here you can provide links to the documentation for said files.\r\n\r\nA serious problem for a lot of Microsoft documention is that it is heavily focused on classes and methods. If you want to learn about specific method, it isn't too hard. But if you want to learn about certain files, say the format of web.config, you can be searching for hours. \r\n","controversiality":0,"subreddit_id":"t5_2fwo","link_id":"t3_vgrj","stickied":false,"subreddit":"programming","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166646265,"author_flair_text":null,"author":"grauenwolf","id":"cvjf0","edited":false,"parent_id":"t1_cvj7v","gilded":0,"distinguished":null,"retrieved_on":1473809051,"timestamp_epoch":1566236773,"message_id":"41668-bbfd4f26-497f-4a57-9a76-e80f74af5a49-1566236773"}