{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166652642,"score":5,"ups":5,"controversiality":0,"body":"ctrl-alt-del will also open task manager (unless you have domain-style login, in which case it's ctrl-alt-del, t).\r\n\r\nWin key + R opens the 'Run' dialog.\r\n\r\nAs foxyvixen below said, F5 does a refresh, but depending on program you sometimes have to do a shift-F5 or ctrl-F5 to clear cache and reload from scratch.\r\n\r\nTab moves you to next item / button / whatever (like when filling out online forms.)  Shift + Tab moves backwards.  Ctrl + Tab switches tabs in Firefox, btw, and Ctrl + T is a new tab.\r\n\r\nMore archaic:\r\n\r\nIf Explorer (as in the thing that controls windows, the Start Menu, etc., not just an individual Explorer window) spontaneously combusts, you can still restart it from a Run or cmd / command prompt by typing 'explorer'.  Internet Explorer is 'iexplore'.  You can get to the Run menu by bringing up Task Manager and picking File -&gt; New Task (Run...).  \r\n\r\nCtrl-C in a cmd / command prompt cancels whatever it's trying to do (handy if you don't want to wait for all 4 pings to fail after you see the first one did).\r\n\r\nShift + Arrow Key or Shift + Home / End / Page Up / Page Down selects (highlights) continuous text.  Shift + Click selects everything from current cursor position / selection to where ever you click (this does not always behave as expected when icons are auto-arrange + allign to grid on desktop, at least I don't think so).  Ctrl + Click selects only those items you click (say you want to delete every third file in a folder, you can Ctrl + Click each one and then only have to delete and confirm deletion once.)\r\n\r\nCtrl + Home takes your cursor to start of document.  Opposite for Ctrl + End.  Ctrl + Shift + Home selects / highlights from cursor to start of document.  Opposite for End.\r\n\r\nCtrl + A selects everything.\r\n\r\n**Added** All the above work or usually work when selecting icons on desktop / in a window or picking items in a list on website.\r\n\r\n**Added** Spacebar 'activates' selections (like checkboxes) in forms, so for instance logging in to Reddit you can type login, tab, password, tab, spacebar, enter, so you don't have to use mouse to click the 'remember me' checkbox.\r\n\r\nCan't think of any more off hand. I'll add as I do.\r\n\r\nOh, how could I forget...F1 is Help in most programs.  Ctrl+S is almost always Save.","link_id":"t3_vhwi","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809058,"distinguished":null,"author":"oditogre","author_flair_text":null,"edited":false,"parent_id":"t1_cvilm","id":"cvjtk","timestamp_epoch":1566236774,"message_id":"41922-51e028d1-bfd0-4562-9cb4-85af5274bcd3-1566236774"}