{"gilded":0,"distinguished":null,"retrieved_on":1473807599,"author_flair_text":null,"author":"[deleted]","parent_id":"t1_ctebz","id":"ctedk","edited":false,"subreddit":"reddit.com","score":0,"ups":0,"author_flair_css_class":null,"created_utc":1165109636,"body":"Not at all.\r\n\r\nThe 360 has been out for a year and isn't the 'hot' item right now. Not to mention the Wii is $50 cheaper than even the core 360. The PS3 is at the very least $250 more expensive than the Wii (double its cost) and you can't find them anywhere anyway.\r\n\r\nNintendo on the other hand has done a good job (it isn't terribly difficult) of producing large amounts of the cheap hardware and getting it out to stores.\r\n\r\nWhat I *will* be very surprised about is if Nintendo can keep this up 2 or 3 years from now. What happens when the 360 sees a price drop and you can walk into a store and buy a PS3? What happens when devs really start to take advantage of the power of the 360 and PS3 and the Wii devs are still stuck with what is essentially last-gen hardware? Will Nintendo be able to get quality third-party titles to the system that aren't just gimmicky like several of their release titles (*Red Steel* has been getting horrible reviews)? Or will the Wii end up much like the GameCube, with essentially nothing but a few third-party releases each year and first-party Nintendo products carrying all the weight?\r\n\r\nThat's what I think will be interesting. I am planning on going out and buying a Wii tomorrow if I can get one (I hear Circuit City and Targets will have them in stock), but I am pretty disappointed to hear that Nintendo is already making a profit on their hardware. That just means they really skimped on it and down the line it will likely hurt them. I didn't expect the Wii to rival the PS3 or 360 in power, but I did expect something more like double the power of the original Xbox instead of something roughly equivalent.","controversiality":1,"subreddit_id":"t5_6","link_id":"t3_tdyf","stickied":false,"timestamp_epoch":1566236759,"message_id":"4195-b23e1fc3-393b-498e-bb19-00742693b9bd-1566236759"}