{"id":"cvjzb","edited":false,"parent_id":"t1_cvjvq","author":"lifeofliberty","author_flair_text":null,"distinguished":null,"retrieved_on":1473809061,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vija","controversiality":0,"body":"You're devolving the original argument. It does not *matter* if a website (or a commenter) posts a particular point of view regarding an issue (whatever the issue may be).  Pretty much everyone hast hat right, oh wait, no, I guess that's not true.  It's *illegal* to criticize certain aspects of Israel, particularly the Holocaust.\r\n\r\nAnd that **is** the issue.  The fact that Israel has received special favored protection in the media, on websites and in various news reporting agencies around the world - criticism of Israel is a \"thought crime\", **irregardless** of Israel's real, day-to-day crimes against humanity.\r\n\r\nHowever, you're devolving the argument into something else that isn't even related, except in the sense that opinions (or even news) is being reported that can be considered bias or lopsided.  So what?  Most news is bias and lopsided, that's just the way it is.  But this hasn't anything to do with the issue of Israel and the special protection it receives among **all** the nations in the world.  That fact alone should give one reason to pause and wonder.\r\n\r\nThe parellel you seek to connect is immaterial. It doesn't mean anything of substance.  \r\n\r\nAnd I totally don't understand your comment about whether hating one group or another is worse then hating Israel.  I never used the word \"hate\", not even once.  You did.  It isn't \"hate\" that is at issue here, not at all.  It's being constrained from reporting an opinion or even the news when it comes to Israel in particular this is at issue.  You, yourself have taken extreme exception - and you need to ask yourself why?  What is your real motive here?\r\n\r\nFinally, to answer you final question in your last post, no, there is no qualitive difference between sites that report crimes by Islam or Israel.  \r\n\r\nBut there is a definite difference if one chooses to report negative news in regards to Isreal - as already noted, it is illegal is some cases and swift to bring the wrath of the pro-Israeli crowd and claims of \"anti-semitism\", which has absolutely no basis in reality or fact.\r\n\r\nIsreal is no more deserving of \"special favored status\" or \"protection\" in discourse, in thought and in real life, then the Gypsies that were murdered during the Holocaust.  But we both know that is not even true - the millions of Gypsies killed were not even mentioned in the Holocaust Memorial.\r\n\r\nReal life has taught most people to side with the victor - but unforunately, that is not the \"whole story\" which you are seemingly adamant about wanting to hear from.  If you want the whole, unadulterated and true story, you must permit the dissension from the \"ranks\" by those that do not support Israel or the pro-Israeli movement.","score":4,"ups":4,"created_utc":1166655099,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"42009-714c253e-81e1-4659-9be6-5665d9e322ec-1566236774"}