{"author":"Lucretius","author_flair_text":null,"parent_id":"t1_cvjal","id":"cvjzu","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809061,"body":"&gt; We are our desires and our desires are caused. Thus in a \r\n&gt; sense we have no free will (I view the term as incoherent)\r\n\r\nThe reason that you view the term as incoherent is that your looking at causes rather than methods.  Free-Will is not the CAUSE or SOURCE of an action, or even, as you point out, of a desire to act at all.  It is the method by which such an action is chosen from the near infinite spectrum of possible actions.  The fact that the action is not selected at random, or arbitrarily is not relevant, as long as it is not forced from the outside.\r\n\r\nTo paraphrase Michael Flynn from \"In the Country of the Blind\":\r\n\"Freedom is the opposite of compulsion, not causality.\"\r\n\r\nFurther, the article has it dead wrong when it says:\r\n\r\n&gt; Science will shrink the space in which free will can \r\n&gt; operate by slowly exposing the mechanism of decision \r\n&gt; making.\r\n\r\nFree Will is a subjective phenomenon.  Subjective means: Does not exist, as part of reality, is dependent upon the thoughts or perceptions of an individual.  Because they can only be experienced individually, subjective phenomena are unusual in that they are the only cases where relativism is actually correct.  This fact protects Free Will from Science as the scientific method is only concerned with Objective Truth.\r\n\r\nFor example, a scientist could scan my brain and say \"I don't see free will.\" and yet change nothing.  My Free Will doesn't need to be experienced by the scientist in order to be real, any more than my dislike of Eggplant need be experienced by my sister for it to be real. If we were to learn tomorrow that certain structures in my brain are associated with my dislike for Eggplant, that only makes it more or less real to OTHER PEOPLE.  Knowledge of the brain structure does not cause Eggplant to taste any better or worse.  In the subjective realms such as Taste, Free Will, Emotions, etc. one's own perspective is the only one that matters because, by the definition of subjective, these things don't exist anywhere else.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vf8l","subreddit":"reddit.com","score":2,"ups":2,"created_utc":1166655350,"author_flair_css_class":null,"timestamp_epoch":1566236774,"message_id":"42016-dbc3af70-353a-4e95-87c4-54b8d683a1fe-1566236774"}