{"link_id":"t3_vjjh","stickied":false,"subreddit_id":"t5_6","body":"Guy who wrote this has never been in real fight. What he describes are just stupid macho show off fights between kids or jerks. I have been three times in serious one to one fight when I was security guard. Every time both of us were silent, dead serious, sweating like pigs and full of adrenaline. Surprisingly you don't feel fear anymore when situation is ongoing (adrenaline I quess), thus trash talk and looking confident don't have any effect anymore (afterwards I barely could stand because my legs were shaking so much). \r\n\r\n&gt;2. Fighting Dirty is Fighting Smart\r\n\r\nMost of the bully fights end when the opponent is down and has his nose bleeding. 99% of the time your opponent don't really want to make permanent damage. It's just wrestling and weak hits that hurt. If you are pinned down and grab that rock and smash his face with it, you may die or get permanent damage if the guy sees that you want real fight. Fun is what bullies are after, not real fight. If you are not good enough to win bullies with bare knuckles, just run or take the hits two hits and call cops afterward.\r\n\r\nHere is some real advice:\r\n\r\n1) Have good situational awareness. Stay out of fights. Don't be asshole. You don't need to \"stand up\" if you have self confidence.\r\n\r\n2) Run run run.\r\n\r\n3) Go close and wrestle. When you can grasp his arms and prevent hits, you are good (Of course if you are weak, nothing expect #1 helps). Wrestling makes you both tired quite fast. Hits get weaker, motivation to fight decreases. If somebody comes to help you, he has easier job to do.\r\n\r\n4) Use weapon. Pistol (aim foot), pepper spray, car keys....\r\n","controversiality":0,"author_flair_css_class":null,"created_utc":1166656643,"score":56,"ups":56,"subreddit":"reddit.com","id":"cvk2n","edited":false,"parent_id":"t3_vjjh","author":"[deleted]","author_flair_text":null,"retrieved_on":1473809063,"distinguished":null,"gilded":0,"timestamp_epoch":1566236774,"message_id":"42052-6a0cd853-58d6-48e9-8e2f-04aa2deb0cc7-1566236774"}