{"parent_id":"t1_cvjzb","id":"cvk85","edited":false,"author":"mangleon","author_flair_text":null,"distinguished":null,"retrieved_on":1473809067,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vija","stickied":false,"controversiality":1,"body":"You didn't even address my parallel, though you did a great job at spelling it wrong. Calling something logically consistent (as my parallel is) \"immaterial\" doesn't mean much when you don't go any further.\r\n\r\n\r\n\r\nHave you ever even set foot in Israel? \r\n\r\nNo. You have not.\r\n\r\nWhy? \r\n\r\n\r\nBecause you're clearly one of those people who reads Democratic Underground and PrisonPlanet in his basement, while believing the nonsense because he has no basis for comparison.\r\n\r\nI have been to Israel, I was there for a little under a month in the summer of 2004. I am a Christian. It was a lovely place though I couldn't see myself living there.\r\n\r\nI'd be very very interested to see some *sources* for your claims that Israel has some sort of thought police and arrests people for protesting or speaking out against the nation. I was there. I saw press, protests, and the other signs of free speech. In fact, Holocaust denial by itself is *not* illegal in Israel, as you claim. You can shout all day long that the Holocaust was a lie (which you probably would), though it is a criminal offense to offer sympathy to the perpetrators. I personally think this is a silly law and worthy of ridicule (though it's actually a lenient law in comparison to the laws in Poland, Germany, and some other European nations). You, on the other hand, seem to find it as an egregious personal affront, which I do believe says something about you. \r\n\r\nAlso, I don't even know what \"Holocaust Memorial\" you speak of because there are many. There are some that specifically exist to represent the destruction of the European Jews, there are some that represent Gypsies, or homosexuals, or the handicapped, or any number of other group, and there are some that represent all of them. If you are referring to the Holocaust Memorial in Washington D.C. then you clearly haven't even *been* there, as they have documented every known victim of the Holocaust, and represented all groups, regardless of reason for being persecuted. Oops, a liar caught in the act:\r\n\r\nhttp://resources.ushmm.org/Holocaust-Names/List-Catalog/search/about_lists.php\r\n\r\nGet out of your home more, and your seething hate might subside.\r\n\r\n","score":-2,"ups":-2,"author_flair_css_class":null,"created_utc":1166658555,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"42107-95885651-eda4-4e95-bbfe-8e711818a9c0-1566236774"}