{"score":-8,"ups":-8,"author_flair_css_class":null,"created_utc":1165110563,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_tdgp","stickied":false,"controversiality":0,"body":"Actually, the fear of Muslims is not generated by ignorance, as the article states. It's a natural reaction to 9/11 and the ME debacle. As for the reference to the Imams taken off a plane for 'praying in the terminal', Yahoo news is only telling its very biased version. There was a lot more to that incident than you may have heard about. For example, they were speaking in Arabic and referring to Bin Laden. They sat in seating positions on the plane that caused a 'red alert' because the pattern matched known terrorist seating preferences. At least one of them was not sitting in his assigned seat. One even moved from 1st class to economy, which would bother anyone. And why did one of them ask for a seat belt extension? He was skinny. Unless he expected to get a humongous hard-on while flying?\r\n\r\nThe fact is, the Muslims among us could comprise a serious threat, just like Germans did in the UK during WWII. We called them 'fifth columnists'. I don't believe making Muslims wear identifying marks is the answer. But you do need to be vigilant and report ANY suspicious behaviour. Better to be safe than sorry.\r\n\r\nYour INS also needs to be much more vigilant. There are many American Muslims and I'm sure they are as American as any of you. But what about all the non-resident Muslims running around the country? Does the INS know who and where they are? Keeping a close watch on them would be a good idea.\r\n\r\nBut having said that, you should remember that not all terrorists are Muslims. You have your own home grown variety of nut cases going around bombing abortion clinics and killing doctors, nurses and workers. How often do you read about these people? Why isn't the FBI tracking them down? They are even worse than Muslim terrorists because they are traitors to their own country. Time to clean house, huh?\r\n\r\nHowever, this must be tempered with common sense. Seeing the boogie man in every shadow is not going to help. Perhaps Americans should learn the definition of a true paranoid. He's the guy who says, \"I know I am paranoid.\" Then he looks around furtively and continues, \"But am I paranoid enough?\"","distinguished":null,"retrieved_on":1473807602,"gilded":0,"edited":false,"id":"ctegf","parent_id":"t3_tdgp","author_flair_text":null,"author":"ThaiTai","timestamp_epoch":1566236759,"message_id":"4222-60976208-2c87-4606-b1b2-cccd0f04633c-1566236759"}