{"retrieved_on":1473809071,"distinguished":null,"gilded":0,"id":"cvkip","edited":false,"parent_id":"t1_cvk85","author":"lifeofliberty","author_flair_text":null,"created_utc":1166663064,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vija","subreddit_id":"t5_6","body":"Ah yes, you've been to Israel (for a month), and that makes you an *expert*.  Well, excuse me, while I excuse your obviously Christian bias (now we're getting to the real heart of the matter here and why you take exception).\r\n\r\nI **was** a Christian too, for twenty years a pentacostal evangelist. I'm proud to say I've renounced Christianity as the home of fools and tyrants.  But I **do** understand your bias, all too well, because I once held such bias too.\r\n\r\nBut then I wised up and read the history surrounding Israel and importantly, the US support for Israel. I well understand the Christian preferene for Israel and how deluded Christians really are when it comes to Israel and it's true history.  What you think you know isn't even a fraction of the truth.\r\n\r\nI never said it was illegal in Israel to criticize Israel, you did, but it is in other parts of the world.  You can attempt to add to my arguments all you like, but you are only showing your own level of ignorance.\r\n\r\nIf you're interested in learning more about the bias towards the holocaust, you should read Holocaust Denial In Context found here, http://www.zmag.org/zmag/articles/cot96church.htm.\r\n\r\nBut again, you are devolving the argument from it's main points (but we **are** indeed getting to the heart of the matter, aren't we).  And you're totally full of Christian shit regarding the Holocaust Memorial documenting every known victim of the holocaust. The real liar is you.\r\n\r\nI don't hate Israel, or Israeli's, but I despise arrogant fools who refuse to study the real history of the world and instead, foster their own private rascism and bias in their private intepretation of \"history\".\r\n\r\nSo far, your \"defense\" of Israel has included - well, not a goddamned thing, except your own Christian bias, which in itself is highly suspect because you don't even know your own history.\r\n\r\nAnd my wife is Jewish, her grandmother is a full Jew, so I suppose to your distorted thinking and stupidity, this \"proves\" my \"seeting hate\".  Now guess where I was married, you ignorant fool?","controversiality":1,"timestamp_epoch":1566236774,"message_id":"42256-e2514932-36fb-4898-a635-558d52f3f03e-1566236774"}