{"stickied":false,"link_id":"t3_vh74","subreddit_id":"t5_2fwo","controversiality":1,"body":"&gt;lub is that until you have learned and/or used languages superior to Blub, you don't know that those other languages are superior, they're just weird.\r\n\r\nTrue.  Due to a shortage of time, I didn't get a chance to thorough crank out the comment.  Anyways, using Slava's three features, take any two languages in my list earlier and compare for \"superiority\".  No language is superior in all three.  Heres some examples:\r\n\r\nJava vs Haskel:  Java is more popular, they are equal in performance (I include memory as a performance factor, which Java sucks at), and Haskel is more expressive.  Winner: neither.\r\n\r\nC# vs Lisp: C# is more popular, they are equal in performance (Lisp SBCL takes more memory), and Lisp is more expressive than C#.  Winner: neither.\r\n\r\n&gt;But I would disagree that the best language requires popularity. \r\n\r\nNo single feature is more important than another.  All are equal parts.  If you ever think one part is less important, you may have to ask yourself: is it not important or am I just thinking this because my language sucks in that department.\r\n\r\nFor example, Ruby is a nice language in that its both expressive and popular.  Despite this, Ruby is snails food (slow in other words).  A large number of Ruby programmers who looked at that very same list of features didn't complain about popularity like you did, but rather wondered why performance was a factor.\r\n\r\nWhen I get a chance, I need to expand on the three and explain why all three are so important.  Popularity, to summarize, is important for: training, books, support, libraries (commercial or otherwise), adoption, etc.  There are hundreds of languages that come out each year, and without a little bit of popularity it will become obscure.","created_utc":1166664045,"author_flair_css_class":null,"score":0,"ups":0,"subreddit":"programming","parent_id":"t1_cvkao","id":"cvkkb","edited":false,"author_flair_text":null,"author":"sbrown123","retrieved_on":1473809073,"distinguished":null,"gilded":0,"timestamp_epoch":1566236774,"message_id":"42279-de79b9a8-4d97-47b4-829d-c86f85b3a9da-1566236774"}