{"subreddit_id":"t5_6","link_id":"t3_vjjh","stickied":false,"controversiality":0,"body":"&gt;Most of the bully fights end when the opponent is down and has his nose bleeding.\r\n\r\nWith kids this is true.  Adult fights can be different.\r\n\r\n&gt;Fun is what bullies are after, not real fight.\r\n\r\nI think most do it for control.\r\n\r\n&gt;You don't need to \"stand up\" if you have self confidence.\r\n\r\nBullies want easy prey.  People who will \"go toe to toe\" are not easy targets and will usually be avoided.\r\n\r\n&gt;2) Run run run\r\n\r\nBad bad bad.  Don't run, stand your ground.  If you run, and they don't catch you, there is always another day.  And if they don't catch you the other kids who heard you ran may take a shot at you.  I've seen kids in this situation, and they got the snot kicked out of them repeatedly by about everybody.\r\n\r\n&gt;3) Go close and wrestle.\r\n\r\nFinally, good advice.  Yes: close quickly.  Hell, while your doing it you might as well charge in (see balance later).  This prevents the opponent from delivering strong, full arm blows or kicks.  Ask any boxer!\r\n\r\n&gt;Of course if you are weak, nothing expect #1 helps\r\n\r\nNot true actually.  I've seen smaller guys take out larger guys.  In all cases, the little guy grapples and takes out his opponents balance (the feet).  From there its all wrestling and jabs.  Taller people have better leverage but can not deliver blows as easily.  I can't remember his name, but that little guy from Ultimate Fighting is a good example of how this works.   To summarize: close, wrestle opponent off balance, position and jab, position and jab.  If its serious, choke and eye gouge.\r\n\r\n&gt;4) Use weapon. Pistol (aim foot), pepper spray, car keys....\r\n\r\nIf your gonna use a gun at someone, plan on killing them.  Otherwise, use it to ward off the attack.\r\n\r\n&gt;pepper spray, car keys....\r\n\r\nAnd ladies, don't forget your high heeled shoe or boot.","score":9,"ups":9,"author_flair_css_class":null,"created_utc":1166671894,"subreddit":"reddit.com","id":"cvky1","edited":false,"parent_id":"t1_cvk2n","author":"sbrown123","author_flair_text":null,"distinguished":null,"retrieved_on":1473809080,"gilded":0,"timestamp_epoch":1566236774,"message_id":"42468-2e0eac3a-1e4c-4a1b-9e70-e96b8403aa63-1566236774"}