{"id":"cvlbc","edited":false,"parent_id":"t1_cvl5j","author":"madamImadam","author_flair_text":null,"distinguished":null,"retrieved_on":1473809088,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vjjh","stickied":false,"controversiality":0,"body":"&gt;3) Yes, if confronted with no way out, don't try karate because it won't work. Use hand to hand wrestling because it's the most effective.\r\n\r\nBullshit. I've heard from jujitsu practitioners and so-called \"mixed\" martial artists that 90% of all fights end up in ground-fighting, but when I've pressed them, they qualified themselves by saying cage fights or other staged **games**.\r\n\r\nI've been attacked, three to one, with a tire iron and a broken-off broomstick to boot. Assholes surrounded me and attacked even after I gave them my money. I was delivering pizza at the time. The absolutely dumbest thing I could have possibly done is wrestle one of them to the ground. Sure, if I were really good I could have maybe pinned him or got him in the Gracie mount position...just in time to be clocked in the back of the head or stabbed.\r\n\r\nInstead I blocked the broomstick (which had a sharp point--I now sport an ugly scar on my right forearm), and backfisted the tire iron out of the other guy's hand, while absorbing the punch from the third one--he looked like Mike Tyson but didn't know how to throw a punch to save his life, luckily for me. Then I grabbed the end of the stick and lunged with a kick at the guy holding the other end. He backed off and dropped it, and that gave me an opening to get out of there.\r\n\r\nYes, you need to know enough about grappling to get out of a hold, but to suggest that the best self-defense strategy is to immobilize yourself and tie up your weapons struggling with an attacker--when other dangers are or may be in the vicinity--is sheer idiocy.","score":16,"ups":16,"author_flair_css_class":null,"created_utc":1166679795,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"42673-4aef8c79-4ee0-4a05-b5a7-8de979300c3f-1566236774"}