{"distinguished":null,"retrieved_on":1473809091,"gilded":0,"edited":false,"id":"cvlg2","parent_id":"t1_cvlda","author":"[deleted]","author_flair_text":null,"score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166682892,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vix8","stickied":false,"body":"&gt;95% of the world would like to have Japan's dysfunctional economy of the last 20 years.\r\n\r\nRight, because 90% of the world didn't start getting civilized until after Japan did, and 99% of the world didn't develop and orderly, reasonably free society as Japan did during the Meiji restoration. In addition, Japan was part of the 10% or so of the world that colonized and won wars with most of the rest, until they picked a fight they couldn't win with the US. After that, they absorbed most of the best practices of government and business in the US as of the late 40's.\r\n\r\nAnd never improved.\r\n\r\n&gt; Japan's way of doing business works very well in some industries and I believe it always will.\r\n\r\nExactly! Their hostility to people who do things in a non-Japanese way is legendary -- it's really, really hard to get access to capital if you're not part of a large and diversified company, and their strict bankruptcy laws mean that the risk of failure just isn't worth the reward of starting your own business instead of joining some post-Zaibatsu.\r\n\r\n&gt;...but they will always surpass the US in terms of quality and refinement that only a group can bring to a product.\r\n\r\n\"Made in Japan\" in the 50's meant about what \"Made in China\" meant in the 90's: cheap, but so shoddy it was still a bad deal. They got their act together, and their culture is definitely a good one for breeding perfectionist craftsmen, but there's something to be said for the rather American technique of having fifteen squabbling entreperneurs come up with fifteen contradictory standards, flood the market with mass-produced copies, and see who comes out on top. That wouldn't happen in Japan, since their business have stayed big by moving slowly (they dive into the domestic market, where they're supported by government tariffs, but they tiptoe into overseas markets where they have actual competitors and hostile governments).\r\n\r\n&gt;Diversity is good, even in a global marketplace.\r\n\r\nYeah. And nearly everyone fights it, because just about everyone could benefit, in the short term, from some of their competitors being ostracized. I think Americans need to face the fact that a major component of our economic success was how incompetent our big businesses are at manipulating governments and consumers.","controversiality":0,"timestamp_epoch":1566236774,"message_id":"42737-ecbad116-55fd-4776-8671-c5e9ce92b457-1566236774"}