{"author_flair_text":null,"author":"[deleted]","id":"cvlik","edited":false,"parent_id":"t3_vjjh","gilded":0,"retrieved_on":1473809091,"distinguished":null,"controversiality":0,"body":"As others have said, this is an article written by a pseudo-toughguy (I know, an actual female), who is spouting advice she got from somewhere else and assuming it's accurate.\r\n\r\nFighting Dirty is Fight Smart. Stupid advice. First off, 99% of fights are not about actually hurting the other person but rather proving a point. If a fight is about true survival, like someone is mugging you or whatever, fine. Do what you need to survive so you can RUN. So you can GET AWAY.\r\n\r\nIf you fight dirty against someone and, say, it doesn't work, you are 10 kinds of fucked. Anyone who's ever unsuccessfully thrown a shot to someone's balls can tell you that. Now you get beat double for fighting like a bitch.\r\n\r\nThis is an article more liable to get you killed than get you respect. She's advocating going all-out against ANY challenges and just throwing caution to the wind. I'm a 6'2\" 260 pound powerlifter who works security at a bar, and I would never give this bullshit advice to anyone. Case in point:\r\n\r\n\"Sometimes you’re just outmatched. But even losing a fight can be used to your advantage. When it’s over, feel free to spit blood in his face and tell him that it ‘didn’t hurt.’\"\r\n\r\nSTUPID. First off, if you lose a fight and you spit blood in the guy's face, guess what's gonna happen? He's gonna drill you again. If you lose a fight, accept it. You lost. Pick yourself up, concede defeat, move on with your life.\r\n\r\nYou want to know some REAL self defense? Check this out:\r\n\r\n1) Self-confidence. Not abrasiveness, confidence. Be confident in yourself. Not eagerness to fight. Act secure in yourself and usually this will help. Predators go after weak prey.\r\n\r\n2) AVOID FIGHTS AT ALL COSTS. No one \"wins\" in a fight. Ignoring legal troubles, you're gonna get hurt. Fights rarely are over anything important, so even if you win the fight, what did you really win? Did you get a prize?\r\n\r\n3) MINIMAL FIGHTING NECESSARY. Everyone, like this internet warrior, has this Fight Club \"spit teeth at 'em and smile\" mantra that just don't work in reality. Do as little as you need to do to keep yourself safe and getdahell outta there.\r\n\r\n4) Remember it's SELF DEFENSE. To go back to the \"fighting dirty\" thing, if you're fighting to prove something, then fighting dirty makes you look like a bitch. But if you've got someone attacking you, sure. Go for the throat or the balls, and as soon as you do, LEAVE.\r\n\r\nBah, why am I bothering.","stickied":false,"link_id":"t3_vjjh","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166684927,"author_flair_css_class":null,"score":27,"ups":27,"timestamp_epoch":1566236774,"message_id":"42773-a6a87da8-42ab-4279-87f2-c2922bc0eb39-1566236774"}