{"retrieved_on":1473809098,"distinguished":null,"gilded":0,"id":"cvluj","edited":false,"parent_id":"t1_cvkqm","author":"SargeZT","author_flair_text":null,"author_flair_css_class":null,"created_utc":1166694420,"ups":1,"score":1,"subreddit":"reddit.com","link_id":"t3_vjmv","stickied":false,"subreddit_id":"t5_6","body":"How is the \"savageness\" of Africa related to Kwanzaa? \r\n\r\nKwanzaa is a supposed cultural celebration of the related heritage of African-Americans. The celebration itself is believed by most of those participating to be somehow significantly related to Africa's culture. The real culture that Snow describes is, in a nutshell, indicative of the level of disconnection that native African's feel to one another.  \r\n\r\nWhen individuals celebrate Kwanzaa under these false pretenses, that of a Pan-African togetherness, then what is really gained? It's just a way to say, \"We're all came from Africa. Let's celebrate that.\" Do I think that the same could be said of other celebrations, such as Christmas, that are misrepresented? Sure. Christians celebrate the supposed birth of their savior in December, even though Jesus was almost certainly not born on the twenty fifth of December. However, Christmas is tradition for many Americans. It was put into tradition many hundreds of years ago, Kwanzaa was created less than a hundred years ago.\r\n\r\nThat's about all I had to say except this. Where do you get off just trying to rip apart Snow? Don't just judge the validity of his editorial based on the small part of it you read and disagreed with. There was an error in it, yes. Never the less, just the article as a whole. The first part of your comment was valuable, it added to the content of the article; as a comment should. The rest of it is a rant that seems to serve no purpose other then showing how big your internet penis is.\r\n\r\nCongrats! Your penis is large.\r\n\r\n","controversiality":0,"timestamp_epoch":1566236774,"message_id":"42908-7d0efd80-1743-4848-b12b-6ca877122d41-1566236774"}