{"author_flair_text":null,"author":"[deleted]","id":"ctely","edited":false,"parent_id":"t1_cteip","gilded":0,"distinguished":null,"retrieved_on":1473807605,"body":"I'm not an advocate of voting *or* sitting around, because those activities are (equally, in most cases) unproductive. I'm more of an advocate of actually thinking about and solving problems, rather than agitating against solutions that have effects you don't like.\r\n\r\nI didn't specifically claim that Einstein or Chomksy \"wave a sign around,\" for the very good reason that I don't think that's what they did. But we need to distinguish between their careers as academics and their public statements about economics -- Chomsky's linguistics and Einstein's math don't imply that either one of them know a great deal about economics (and since economics is the science of how normal people interact, you'd expect extraordinary minds to have *more* trouble intuitively grasping it, since they're not used to thinking that way).\r\n\r\nFor example, (to take a name you're likely to know), [Jim Keady](http://www.lrna.org/speakers/jimkeady.html) is an outspoken critic of Nike. I'm not name-dropping, by the way; the guy does vanity searches for blog entries about himself, and then emails the bloggers. Anyway, Keady's main argument is that rather than spend our money on a company that employs desperately poor people in third-world countries who would otherwise turn to begging, prostitution, or starvation, we should buy shoes from unionized American companies that pay their middle-class workers $20/hour to do repetitive manual labor. Amazingly, even though Keady has spent time living in third-world countries on the same budget as average Nike employees, he feels good about advocating that these employees be fired so American workers can earn slightly more. It's a unique combination of self-righteous economic nationalism and Catholic Liberation Theology; pretty nauseating, to be honest.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_tcs0","stickied":false,"subreddit":"reddit.com","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1165112688,"timestamp_epoch":1566236759,"message_id":"4299-a8f9ff82-c3ea-4cfe-b102-cb7a2177a8f5-1566236759"}