{"author":"richardkulisz","author_flair_text":null,"id":"ct5xz","edited":false,"parent_id":"t1_ct2nq","gilded":0,"distinguished":null,"retrieved_on":1473807441,"body":"Right, my defense is bullshit. It just happens to be pulled from the references **you** provided. You dumb fuck. Page 2 of your first reference.\r\n\r\n&gt; Although most countries collect information on the number of crimes recorded or reported by the police, absolute comparisons of crime levels are often misleading. Recorded crime levels will be affected by many factors including:\r\n\r\n&gt; a) Different legal and criminal justice systems;\r\n&gt; b) Rates at which crimes are reported to the police and recorded by them;\r\n...\r\n\r\nAnd if you're referring to (trying to deny) the fact that American police have been heavily militarizing and increasingly killing people in \"no knock\" raids, don't even bother.\r\n\r\nFURTHERMORE, your recent (better) sources totally contradict your earlier (weaker) sources.\r\n\r\n&gt; Homicide\r\n\r\n&gt;Since the definition of homicide is similar in most countries, absolute comparisons of rates are possible. For the period 1999 to 2001, the average rate (the number of homicides per 100,000 population) was 1.6 in the EU with the highest rates in Finland (2.9), Northern Ireland (2.7) and Scotland (2.2). For other countries, the highest rates were found in Russia (22.1), Estonia (10.6), Lithuania (10.6) and the USA (5.6).\r\n\r\nWhich makes a lot more sense than your \"murder and manslaughter figures\". Especially if manslaughter includes vehicular manslaughter which could easily be included in one country (Brussels) but not in another (USA).\r\n\r\nAnd the homicide rates make most sense because the countries that have high rates of internal conflict and poverty, or clinical depression in the case of Finland, are the ones with the highest rates of homicide. This makes sense. Your \"murder and manslaughter\" figures on the other hand are total nonsense.\r\n\r\nFurthermore,\r\n\r\n&gt; In the EU capital cities, the average number of homicides over the period 1999 to 2001 was 2.3 per 100,000 population with the highest rates in Belfast (5.6), Amsterdam (3.1), Vienna (2.8), Stockholm (2.8), London (2.6) and Berlin (2.3). There were higher rates in some American cities: Washington DC (42.9), New York NY (8.7) and San Francisco CA (8.1).\r\n\r\nIn other words, the usual story from the sources YOU provided. You're an idiot you know that? You know that:\r\n\r\n1. poverty correlates strongly with crime\r\n2. the USA has a lot more poverty than Europe\r\n3. Americans lie about crime stats to make themselves look good\r\n\r\nBut when you put 2 and 2 together, you got 73!","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_suoa","stickied":false,"subreddit":"reddit.com","score":-2,"ups":-2,"author_flair_css_class":null,"created_utc":1164932043,"timestamp_epoch":1566236758,"message_id":"43-c1b7b41e-6d75-4366-b3a2-8d75115798cb-1566236758"}