{"edited":false,"id":"cvmva","parent_id":"t3_vfhl","author_flair_text":null,"author":"ldsgems","retrieved_on":1473809117,"distinguished":null,"gilded":0,"link_id":"t3_vfhl","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"A living Mormon Apostle explained why Mormons baptize dead Jews:\r\n\r\n\r\nWe have been authorized to perform baptisms vicariously so that when they hear the gospel preached and desire to accept it, that essential ordinance will have been performed. They need not ask for any exemption from that essential ordinance. Indeed, the Lord Himself was not exempted from it.\r\n\r\n\r\nHere and now then, we move to accomplish the work to which we are assigned. We are busily engaged in that kind of baptism. We gather the records of our kindred dead, indeed, the records of the entire human family; and in sacred temples in baptismal fonts designed as those were anciently, we perform these sacred ordinances.\r\n\r\n\r\n“Strange,” one may say. It is passing strange. It is transcendent and supernal. The very nature of the work testifies that He is our Lord, that baptism is essential, that He taught the truth.\r\n\r\n\r\nAnd so the question may be asked, “You mean you are out to provide baptism for all who have ever lived?”\r\n\r\n\r\nAnd the answer is simply, “Yes.” For we have been commanded to do so.\r\n\r\n\r\n“You mean for the entire human family? Why, that is impossible. If the preaching of the gospel to all who are living is a formidable challenge, then the vicarious work for all who have ever lived is impossible indeed.”\r\n\r\n\r\nTo that we say, “Perhaps, but we shall do it anyway.”\r\n\r\n\r\nI bear witness that this work is true, that God lives, that Jesus is the Christ, that there is on this earth today a prophet of God to lead modern Israel in this great obligation. I know that the Lord lives and that He broods anxiously over the work for the redemption of the dead, in the name of Jesus Christ. Amen.\r\n\r\n- President Boyd K. Packer, \"The Redemption of the Dead\" Churchwide General Conference, October 5, 1975","author_flair_css_class":null,"created_utc":1166715772,"score":0,"ups":0,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"43304-761ec76d-bb6b-4277-be94-9e2aabe51e44-1566236774"}