{"score":-11,"ups":-11,"author_flair_css_class":null,"created_utc":1166720272,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vk0o","stickied":false,"controversiality":0,"body":"&gt; What saves university is generally the beauty of the subject as built by great minds.  But if you just look at the professors and don't see past their narrow obsession with their pointless and largely unread (and unreadable) publications to the great invisible university of the mind, you will probably conclude its as phony as anything else.  Which it is. \r\n\r\nHow unbelievably CONCEITED! \"the beauty of the subject as built by great minds\"?! Give me a fucking break!\r\n\r\nQuantum physics:\r\n\r\n* haven't assimilated advances made in 20th century\r\n* still believe in 17th century Vitalism, that the human brain doesn't follow the laws of physics\r\n* believe in magic\r\n* believe in gibberish\r\n* deny the formal conception of probability\r\n* don't teach fundamental concepts because practitioners don't know them\r\n* deny fundamental concepts are necessary, scorn them\r\n* have no deep understanding of fundamental concepts or how they interrelate\r\n* have no understanding of what is physics, dismiss it as philosophy of physics, dismiss their own subject matter as unimportant and irrelevant\r\n\r\nMathematics:\r\n\r\n* hasn't assimilated 20th century advances in meta-mathematics\r\n* assumes ancient Platonist ideal of uniqueness of mathematics\r\n* despite being viciously disproved in 20th century\r\n* most practitioners have no understanding of meta-mathematics and teach students lies\r\n\r\nAnthropology:\r\n\r\n* culturally relativist claptrap\r\n* denies developmental psychology exists\r\n* denies psychology exists period\r\n* denies own subject matter\r\n* denies the possibility of scientific explanations in field\r\n* is ANTI-scientific\r\n\r\nPsychology:\r\n\r\n* immature proto-science with no fundamental theory of mind\r\n* too many to go into\r\n\r\nSociology:\r\n\r\n* assumes psychology doesn't exist\r\n\r\nBiology:\r\n\r\n* no theory of cellularity\r\n* gave up on theory of cellularity\r\n* denies Central Dogma was overturned, have retconned reality claiming they \"never believed\" the Central Dogma was absolute\r\n\r\nEcology:\r\n\r\n* only a threadbare theory of *what* exists (common descent)\r\n* strictly ad hoc and non-empirical (non-scientific) explanations of how species evolve\r\n* no fundamental theory of ecosystems\r\n\r\nUrbanity:\r\n\r\n* doesn't exist as a field of study, should exist\r\n\r\nEconomics:\r\n\r\n* market fundamentalists exist\r\n* market economics not yet destroyed by development economics\r\n* obsession with trade over and above consumption and production is an obscenity and an abomination\r\n* no fundamental theory of economies\r\n* no clue about fundamental concepts of such a theory\r\n\r\nComplex Systems:\r\n\r\n* doesn't exist\r\n* even though it's required to formulate proper basis for economics, ecology, biology and urbanity.\r\n\r\nComputer Science:\r\n\r\n* not a science but a trade\r\n* teaches 20 year obsolete material\r\n* no understanding of the role of design or skillset of designers\r\n\r\nAnd that's not even going into the fact that ALL of these fields freely mix the practice of their field, the conceptual basis of their field and the history of their field. Roundly fucking up the study of ALL of them. Because all three streams have radically different audiences, different cognitive needs and different uses (at different times to boot).\r\n\r\nFinally, despite the great variety of *kinds of* tasks involved in the complex enterprise of science, there are only two recognized roles: experimentalists and theoreticians. There is no distinction made between generalists and specialists since everyone is assumed to be a specialist. There is no room made for networkers keeping everyone up to date. Nor is there any room for knowledge mappers maintaining and cross-checking an open conceptual basis for each scientific field.\r\n\r\nAcademia is shit.","distinguished":null,"retrieved_on":1473809123,"gilded":0,"id":"cvn8a","parent_id":"t3_vk0o","edited":false,"author":"richardkulisz","author_flair_text":null,"timestamp_epoch":1566236774,"message_id":"43511-89011051-cdab-4388-a7c6-babc554a2b4c-1566236774"}