{"body":"It just seems to me that the submission process works a lot better now than it used to, and that the /new page is useful and informative, now, whereas it was, for a time, totally swamped with useless drivel.\r\n\r\nI think that people tend to trust the voting system unless and until it becomes obvious that it's being tampered with, and while reddit may have gotten a boost from digg's issues with tampering (if it had such; I've never paid much attention to it), I think that reddit is different from digg in a lot of ways that are both more obvious upon visiting and more important to me.\r\n\r\nWhat ways?  Simplicity, lack of clutter, a UI I like for prefs and such, and most importantly: I can see 100 headlines at once, with almost 20 of those above the fold.  So, more information on a page, less clutter, less clicking around for a given amount of content.\r\n\r\nWhy are these more important to me?  Because I just don't care if the voting algorithm is honest.  I only care if I see things I'm interested in.  If I don't see things I'm interested in, I'll move along to other sites, just as I visit slashdot a lot less now that reddit is here.  \r\n\r\nIf I had to pick a site to get all my news and commentary, then it would be very important to me that the voting algorithms and moderation (or whatever) was verifiable and honest.  Since I can just start using another site if this one no longer shows what I want to see, I couldn't care less whether the stories get voted on, selected by special editors, or selected at random by Geiger counters and polonium.\r\n","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_vgqk","stickied":false,"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166720902,"author":"randallsquared","author_flair_text":null,"edited":false,"id":"cvnad","parent_id":"t1_cvn5s","gilded":0,"distinguished":null,"retrieved_on":1473809125,"timestamp_epoch":1566236774,"message_id":"43549-55221705-3df9-46e2-923e-f81a7759c0c9-1566236774"}