{"id":"cvnb9","parent_id":"t1_cvn4e","edited":false,"author":"fnord123","author_flair_text":null,"distinguished":null,"retrieved_on":1473809127,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vmrw","stickied":false,"body":"[I don't know how valid this information is, but it makes a nice story.](http://users.pandora.be/worldstandards/driving%20on%20the%20left.htm)\r\n\r\n&gt;About a quarter of the world drives on the left, and the countries that do are mostly old British colonies. This strange quirk perplexes the rest of the world; but there is a perfectly good reason.\r\n\r\n&gt;In the past, almost everybody travelled on the left side of the road because that was the most sensible option for feudal, violent societies. Since most people are right-handed, swordsmen preferred to keep to the left in order to have their right arm nearer to an opponent and their scabbard further from him. Moreover, it reduced the chance of the scabbard (worn on the left) hitting other people.\r\n\r\n&gt;Furthermore, a right-handed person finds it easier to mount a horse from the left side of the horse, and it would be very difficult to do otherwise if wearing a sword (which would be worn on the left). It is safer to mount and dismount towards the side of the road, rather than in the middle of traffic, so if one mounts on the left, then the horse should be ridden on the left side of the road.\r\n\r\n&gt;In the late 1700s, however, teamsters in France and the United States began hauling farm products in big wagons pulled by several pairs of horses. These wagons had no driver's seat; instead the driver sat on the left rear horse, so he could keep his right arm free to lash the team. Since he was sitting on the left, he naturally wanted everybody to pass on the left so he could look down and make sure he kept clear of the oncoming wagon’s wheels. Therefore he kept to the right side of the road.\r\n\r\n&gt;In addition, the French Revolution of 1789 gave a huge impetus to right-hand travel in Europe. The fact is, before the Revolution, the aristocracy travelled on the left of the road, forcing the peasantry over to the right, but after the storming of the Bastille and the subsequent events, aristocrats preferred to keep a low profile and joined the peasants on the right. An official keep-right rule was introduced in Paris in 1794, more or less parallel to Denmark, where driving on the right had been made compulsory in 1793.\r\n\r\n&gt;Later, Napoleon's conquests spread the new rightism to the Low Countries (Belgium, the Netherlands and Luxembourg), Switzerland, Germany, Poland, Russia and many parts of Spain and Italy. The states that had resisted Napoleon kept left – Britain, the Austro-Hungarian Empire and Portugal. This European division, between the left- and right-hand nations would remain fixed for more than 100 years, until after the First World War.","controversiality":0,"score":3,"ups":3,"author_flair_css_class":null,"created_utc":1166721167,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"43570-dc7c4c33-d503-482a-adfe-dcce9a7803cd-1566236774"}