{"retrieved_on":1473809128,"distinguished":null,"gilded":0,"edited":false,"id":"cvne8","parent_id":"t1_cvmsp","author":"BraveSirRobin","author_flair_text":null,"created_utc":1166722109,"author_flair_css_class":null,"score":18,"ups":18,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vmrw","subreddit_id":"t5_6","body":"Most are easy IMHO:\r\n\r\n\r\n* What comes after 999 trillion?\r\n\r\n999 trillion and one.\r\n\r\n\r\n* Why do train whistles at night always sound lonely and mournful? Not so in the daytime.\r\n\r\nBecause there is no other background noise. Everything sounds different at night.\r\n\r\n* Given the exchange and dispersion of matter, how likely is it/how often do we inhale/consume and/or incorporate into our own protein structure molecules that were once in some historical figure, say Abraham Lincoln?\r\n\r\nVery likely. It's the same with water; it's the same water you are drinking that Julius Caesar drank. \r\n\r\n* Lasers are now powerful and small (at least I think they are), so why don't our troops carry laser guns?\r\n\r\nThey aren't that powerful yet, and the powerpacks are heavy. Also, there are ethical issues, e.g. blinding the enemy would be against several treaties AFAIK. \r\n\r\n* Why did Zidane head-butt his opponent in the World Cup final? Do the French not fight with their fists?\r\n\r\nBecause it's highly effective. Fists on the other hand are pretty weak. More people die from getting kicked/stamped that being punched. Using your elbows is also more effective than using your fist.  \r\n\r\n* Is the universe infinite? It must end somewhere. But when it ends … there must be something on the other side … right?\r\n\r\nFinite is a human quality. We are born and we die. Atoms don't. It's perfectly feasable that the universe has always existed (expand/collapse big bang theory) and that it has no end. \r\n\r\n* Why do humans die so young? In biblical times, people lived for several hundred years; now living to 100 is considered a long life. What happened?\r\n\r\nThe bible stories went through at least 4 decades before the first was written down. Chinese whispers. \r\n\r\n* Hi, how does nature make water? How does nature combine one oxygen atom and two hydrogen atoms to make water? If we knew how nature makes water, then perhaps we can then find an efficient way of separating hydrogen from oxygen, thus creating the ultimate source for energy.\r\n\r\nThis is well known already. Making water (burning hydrogen) releases energy; it is an *exothermic* reaction. This is how hydrogen works. In order to separate the resultant water back to it's base elements, you need to add energy e.g. *electrolysis*. In theory this *endothermic* reaction requires the exact same amount of energy as you'd get out, but no process is 100% efficient. \r\n\r\n&gt; Do dolphins actually save people? If so, why do they do this?\r\n\r\nYes, it's happened. They are very social animals; young dolphins have been known to play games with each other. It's probably the same instinct that makes most humans help an animal in distress. \r\n\r\n* Can someone be forced to masturbate?\r\n\r\nYes, see Ab Graib torture photos. \r\n\r\n* I have noticed that a lot of mainstream movies feature men peeing. Are the actors really peeing?\r\n\r\nProbably not, unless the director is known for getting things right \"first take\". \r\n\r\n* Working in my yard yesterday, I killed a gnat in my ear canal, where it had flown. I couldn't remove the body as my finger was too fat. What happens to it now?\r\n\r\nEar wax is designed to gradually move debris out of the ear canal. It will come out eventially, wrapped up in wax. This is the waxes purpose and is why you should not insert cotton buds to push it back in. \r\n\r\n* Is chicken considered meat?\r\n\r\nBy most people yes, but there are some who disagree. I know someone who won't each red meat, but has no issues with white. \r\n\r\n* Hello ... Could you tell me if there's been any kind of medical discovery in the last 30 years besides DNA.\r\n\r\nLoads. Pick up a copy of Nature or something. \r\n\r\n* Are UFOs confirmed to be from other Alien Planets?\r\n\r\nNo, the name makes the point of \"unidentified\". If you knew where it came from, it wouldn't be unidentified.","controversiality":0,"timestamp_epoch":1566236774,"message_id":"43622-6f7f0752-e604-4c1a-b9a1-626103b17d41-1566236774"}