{"parent_id":"t3_vm6j","edited":false,"id":"cvnfp","author_flair_text":null,"author":"electromagnetic","retrieved_on":1473809128,"distinguished":null,"gilded":0,"link_id":"t3_vm6j","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"I would agree, except the Netherlands in the case of global warming, along with much of europe, will actually be facing glaciers from the shut down of the gulf stream.\r\n\r\nI live in England, and I'm only about an hours drive away from rocks left from the previous ice age. However we also have flowers in our garden and some plants still have most of their leaves, some have even out lasted the semi-evergreens. Yet England is going to be the most effected when the gulf stream shuts down, and given enough time my home should have a nice glacier-front view.\r\n\r\nI however think we should look at the recent high temperatures in the context of the Earth and not just green house gases. Since 1940 the suns has been \"unusually active\" with sunspots that cause a temperature increase, when they were inexplicably gone they caused the Maunder minimum and correlates with the middle (coldest) part of the Little Ice Age. We're currently at the Mordern Maxiumum, coincidence?\r\n\r\nThe Ozone layer has begun restoring itself, and with this the planet is actually warming because solar radiation is now reaching the stratosphere causing the emission of long-wave radiation into the troposphere instead of allowing short-wave (eg UV) through.\r\n\r\nWe currently have very little major volcanic activity causing an upward trend in temperatures due to less SO2 in the upper atmosphere. El Chichon in 1982 caused a drop in the transmission of solar radiation from 94% to 77%. We haven't had any recent volcanic explosions that caused missing summers, and we're long over due for some of those.\r\n\r\nI believe humans CO2 output is having an effect, but I also believe it's a case of bad timing too. In the long run we can't know if our pollution will harm us or save us. If we got a series of the summer missers we'd be fucked, but not if our pollution helps us however we could fry ourselves first.","author_flair_css_class":null,"created_utc":1166722557,"score":12,"ups":12,"subreddit":"reddit.com","timestamp_epoch":1566236774,"message_id":"43646-5813f169-29e5-478e-96f2-84972be00474-1566236774"}