{"gilded":0,"distinguished":null,"retrieved_on":1473809138,"author_flair_text":null,"author":"christierney","id":"cvnyx","parent_id":"t3_vj8t","edited":false,"subreddit":"programming","score":2,"ups":2,"created_utc":1166728502,"author_flair_css_class":null,"body":"This idea works if you just want to understand \"the why\" for a specific line or few lines of code.  It's pretty much useless for someone trying to read through a lot of code and understand it.  For example, if a new developer is trying to understand the whole system, she is going to have to check the revision history for every few lines of code.  What a pain!\r\n\r\n\r\n&gt;First of all, you're using up 5 lines of comments for 1 line of code. That's verbose, but not the worst of the problems.\r\n\r\nVerbosity is a problem in code, not in comments.  Comments should be as verbose as necessary to explain why you're doing something.\r\n\r\n\r\n&gt;What's worse is that if I'm just skimming the code because I'm trying to solve some other problem for which I don't really care about this particular line, you're going to make me stumble. I'm going to read that comment, remember that I once knew of a way in which the flags could get corrupted and spend the next 1/2 day chasing an issue that has a workaround. Your nice comments are on my face when I don't need them.\r\n\r\nThis is a pretty crappy reason not to comment your code.  If you're really worried about this, just skip the comments while you're skimming.  Heck, lots of IDEs/editors even let you fold comments so they'll be out of your way.\r\n\r\n&gt;Even worse, this style also leads to comments needing maintenance. The code will change, and the comment won't be updated with the change.\r\n\r\nThis part is a good point.  But the solution is not to stop commenting your code; the solution is to be disciplined and edit comments at the same time as you edit code.","controversiality":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_vj8t","timestamp_epoch":1566236774,"message_id":"43899-2c1d4be1-18ef-455d-b1cf-a65c92260a1d-1566236774"}