{"link_id":"t3_tcs0","stickied":false,"subreddit_id":"t5_6","body":"&gt; Chomsky or Einstein's beliefs should be judged on their merits, not on who espoused them.\r\n\r\nVery true. In fact, Einstein wrote, *\"Is it advisable for one who is not an expert on economic and social issues to express views on the subject of socialism? I believe for a number of reasons that it is.\"* And then goes on to enumerate those reasons.\r\n\r\nAnd Chomsky [answered the same question](http://www.pentaside.org/article/noam-qualifications.html) of whether his name-recognition should be a factor in evaluating his claims.\r\n\r\n&gt; Can you link to any particular Einstein essay on his political beliefs? I'd be interested in what you mean by this.\r\n\r\nI think [\"Why Socialism\"](http://www.monthlyreview.org/598einst.htm) is a good intro, which I already linked to.\r\n\r\n(One might consider it only on economics, but those engaging in political econ don't really separate econ vs. politics in normal discussion, as they impact each other enormously.)\r\n\r\n\r\n&gt; What should I be measuring or am I mismeasuring about Gates' and Buffett's charitable giving?\r\n\r\nI only asked for \"in-depth knowledge (outside press releases)\". So I can't advise you how to measure their efforts, as it's not even clear you know much about it, in order to do the measurement in the first place. Neither can I at the moment.\r\n\r\nI've cited admirable claims by Gates Sr. and Buffett, so I'm fine with speaking favorably of them. But I'm not fine with people (like the fellow I initially responded to earlier) who seem to castigate others because they don't react predictably to some media piece -- and offer little in the way of real knowledge.\r\n","controversiality":0,"author_flair_css_class":null,"created_utc":1165117406,"score":1,"ups":1,"subreddit":"reddit.com","edited":false,"id":"cteve","parent_id":"t1_cteqd","author":"tayssir","author_flair_text":null,"retrieved_on":1473807609,"distinguished":null,"gilded":0,"timestamp_epoch":1566236759,"message_id":"4399-8cdb2618-4f12-4612-bbbb-7a17dd729078-1566236759"}