{"author_flair_text":null,"author":"digital","parent_id":"t3_vmrw","id":"cvoc8","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809146,"body":"Why of course I can answer!\r\n\r\n• What comes after 999 trillion?\r\n\r\n----1000 trillion\r\n\r\n• Why do train whistles at night always sound lonely and mournful? Not so in the daytime.\r\n\r\n----Night is quieter.\r\n\r\n• Given the exchange and dispersion of matter, how likely is it/how often do we inhale/consume and/or incorporate into our own protein structure molecules that were once in some historical figure, say Abraham Lincoln?\r\n\r\n----It is likely that we ingest Lincoln's molecules about every four score and seven years.\r\n\r\n\r\n• Lasers are now powerful and small (at least I think they are), so why don't our troops carry laser guns?\r\n\r\n----Because those only existed a long time ago, in a galaxy far, far away.\r\n\r\n\r\n• Why is smooth peanut butter cheaper than nutty?\r\n\r\n----Because nutty adds one more ingredient to the smooth variety.\r\n\r\n• If we taught animals to talk, how would that affect the world?\r\n\r\n----We'd all be dead.\r\n\r\n\r\n• What would happen to the stock market if a meteor impacted the earth? What would happen to the global markets and the U.S. market? Say a meteor hits inside U.S. borders and takes out two states.\r\n\r\n----Probably a 1-minute shut down to watch the Breaking News, especially if the states are North and South Dakota.\r\n\r\n\r\n• Is it possible to collect all the cookie dough in Chocolate Chip Cookie Dough ice cream and actually bake cookies from it?\r\n\r\n----Of course it is possible, but it is not guaranteed to taste very good.\r\n\r\n\r\n• How clean is bar soap in a public bathroom? Is it \"self-cleaning,\" since it's soap? It seems like a health hazard to me.\r\n\r\n----Depends where it was dropped and how it was handled.\r\n\r\n\r\n• Why did Zidane head-butt his opponent in the World Cup final? Do the French not fight with their fists?\r\n\r\n----He's a soccer player, of course he won't use his hands.\r\n\r\n• When we are approaching another person, like in a hallway, why do we step to our left? That is, try and pass right-shoulder-to-right-shoulder.\r\n\r\n----This a common result of the many social gatherings where we were forced to do the 'electric slide'","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vmrw","subreddit":"reddit.com","score":3,"ups":3,"created_utc":1166733205,"author_flair_css_class":null,"timestamp_epoch":1566236774,"message_id":"44135-c88b2bea-d393-4a5e-88aa-3f3d1ed5cfe1-1566236774"}