{"distinguished":null,"retrieved_on":1473807610,"gilded":0,"id":"ctewk","edited":false,"parent_id":"t3_tdu8","author":"jmillikin","author_flair_text":null,"score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165118071,"subreddit":"programming","subreddit_id":"t5_2fwo","link_id":"t3_tdu8","stickied":false,"controversiality":0,"body":"\"An IDEA user is extremely unlikely to have a bug in his import statements or exception declarations wrong, for this simple reason that he never types import statements or exception declarations.\"\r\n\r\nIn other news, IDEA will automatically insert arithmetic symbols for the programmer. This will hopefully cut down on cases where the user typed '%' instead of '+'.\r\n\r\n\"Because of interactive static analysis, you could quickly bang out code that just barely worked, and feel confident that you would quickly find the flaws in your coding and design.  Because of automated refactoring, you could then take that barely working code and quickly turn it into something solid and production-worthy.  The costs (and risks) of just banging out barely working code dropped substantially.\"\r\n\r\nThat paragraph is completely absurd. Unless this IDE of his has a built-in library of every program that could be written, it cannot detect most flaws seen in poorly written code. Go browse [The Daily WTF](http://www.thedailywtf.com/), and count how many of those would be solved by automated refactoring.\r\n\r\nDisorganized code reveals a deeper disorganization of thoughts. Putting \"extract to method\" might make it easier for somebody to perform such a mundane task, but there is no \"write my software\" button.\r\n\r\n\"In many ways those costs are now lower than the costs of using \"dynamic\" languages, which are more clearly designed for just banging out code.\"\r\n\r\nI stopped reading here. Dynamic languages allow smart people to use patterns not even possible in static languages, such as advanced reflection and generic programming. A poor coder will write bad code in Python or LISP just as easily as in C or Java.","timestamp_epoch":1566236759,"message_id":"4415-ae19d23b-f425-4f4a-a6d9-51f65a930d68-1566236759"}