{"distinguished":null,"retrieved_on":1473809154,"gilded":0,"edited":false,"id":"cvoq1","parent_id":"t1_cvkfj","author":"jimbokun","author_flair_text":null,"score":3,"ups":3,"created_utc":1166738655,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_vk0o","controversiality":0,"body":"\"I seriously wonder how I'll do at the job I recently got which begins in early january.\"\r\n\r\nThe key to success at work is understanding other people's goals and how you can advance them.\r\n\r\nThe negative manifestation of this is called \"brown-nosing\", but general human empathy is a positive trait.\r\n\r\nI do not say this to suggest you lack empathy, but to encourage you that it's an obvious way to set small, achievable goals for yourself in your forthcoming job.  What would make my boss happy if I showed it to her tomorrow?  What can I finish this week that will get our clients/customers excited?\r\n\r\nOne of the problems with having so much (relative) flexibility as a university student is that it is difficult to choose what to focus on.  But that allowed you to get a broad exposure to a lot of things.  Having a Real Job will allow you to focus in depth on Whatever Will Make My Boss, Client, Customer, etc. Happy.  Which may very soon have you longing for the freedom and flexibility of the undergrad. :)\r\n\r\nBut for most of us, I think there is an appreciation of having some externally imposed structure.  You seem to be a bit wistful for exactly that, wanting something that will push you in the direction of creating something \"substantial\" over a period of time.\r\n\r\nThe next trick will be balancing the desire to keep learning new things and trying new things, while maintaining the Get Things Done and Make People Happy attitude.  Most of us spend our lives characterized by one of those but not the other, or veering from one to the other with no balance.  Living a life embodying both is the trick most of us are searching for.\r\n\r\nSo, in summary, don't worry about not having completed something large and substantial at this point in your life.  You now have a great opportunity to transition into exactly that.","timestamp_epoch":1566236774,"message_id":"44372-f321a5a6-1385-460f-9272-40840e3b76f5-1566236774"}