{"retrieved_on":1473809154,"distinguished":null,"gilded":0,"parent_id":"t1_cvoix","edited":false,"id":"cvoqo","author":"celoyd","author_flair_text":null,"created_utc":1166738985,"author_flair_css_class":null,"score":3,"ups":3,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vm6j","subreddit_id":"t5_6","body":"&gt; Bjorn Lombard's statistical analysis of climate studies showed that the climate is actually improving.\r\n\r\nYes. But other respectable people have studies showing otherwise. A non-expert has to take a vote or something. (Incidentally, though, I think Lombard is getting a raw deal: he seems to be making honest points and he deserves more attention.)\r\n\r\n&gt; restrictions on CO2 emissions will harm 2nd and 3rd world countries more than the Western nations that are proposing the limits … For us to come along and say \"Um, no sorry - you can't have these cheap fuels now. Keep on scratching in the dirt for a few more decades.\" seems to be be rather hypocritical.\r\n\r\nSure, it will harm them more. It will also benefit them more in the long run. This seems like the kind of everyone-is-downstream special case where even hardcore libertarians can agree that we need something akin to regulation.\r\n\r\nIt does sound hypocritical. We should do it, though. If someone does a lot of hard drugs when they’re young and then tells their kids not to because the effects aren’t worth it, what’s the problem? If we’re going to apply an everyday sense of fairness to groups of nations, we should strongly appove of the developed world preventing the developing world from repating its mistakes.\r\n\r\nI think we’ll solve this problem with tech: we’ll to get better at cheap and clean power generation, storage, and use. Regulation will force this, and so will regular markets as a billion Chinese people start buying toasters.\r\n\r\nI have to go back to work, so let me sum up my position:\r\n\r\n(A) We observe environmental changes with clear human causes, like high CO2 levels.\r\n\r\n(B) We observe environmental changes attributable to those changes, like higher temperatures.\r\n\r\n(C) Because of the type B changes, we can anticipate serious risk in the next few decades, and we ought to prevent what we can and prepare for the rest.\r\n\r\nA and B make one point: we’re doing this. B and C make a second point: we should be fixing this.\r\n\r\nThanks for the conversation.\r\n","controversiality":0,"timestamp_epoch":1566236774,"message_id":"44386-6a248beb-d1c5-47cf-8c67-020fe54330a7-1566236774"}