{"subreddit_id":"t5_6","link_id":"t3_uuhf","stickied":false,"controversiality":0,"body":"This is part 2 of the above comment because reddit cannot handle long comments apparently.\r\n\r\nHighlights of the judgment against the VP's overreach are below from pg 17-19 \r\n\r\n&gt;The defendant asks the court to construe the FOIA statute in a manner which avoids\r\nserious constitutional problems. Def.’s Opp’n at 22. In support of this position, the defendant\r\ncites Immigration and Naturalization Service v. Saint Cyr, a case in which the Supreme Court\r\nindicated that “if an otherwise acceptable construction of a statute raises serious constitutional\r\nproblems, and [] an alternative interpretation of the statute is fairly possible, [courts] are\r\nobligated to construe the statute to avoid such problems.” Id. (quoting INS v. St. Cyr, 533 U.S.\r\n289, 299-300 (2001)). Presumably, the defendant is arguing that if the court were to interpret FOIA to apply to records regarding the VPR, the Vice President’s “freedom ‘to seek confidential\r\ninformation from many sources, both inside the government and outside’ will have been\r\ncompromised.” Id. (quoting In Re Cheney, 406 F.3d 723, 727 (D.C. Cir. 2005)).\r\n\r\n&gt;**Perhaps the defendant’s concerns are valid. But even assuming they are, these concerns\r\ndo not serve as a license for the court to transmute the meaning of an *unambiguous statute*.**\r\nIndeed, the Supreme Court’s charge in St. Cyr applies to instances in which a statutory provision\r\nis capable of alternative interpretations. 533 U.S. at 299. But here, **the defendant has identified\r\nno ambiguity in the FOIA statute.** Rather, in deference to the defendant’s concerns, the court\r\nmust strictly apply the FOIA statute. In Re Cheney, 406 F.3d at 728 (recognizing that “[i]n light\r\nof the severe separation-of-powers problems [in applying provisions of the Federal Advisory\r\nCommittee Act, the court] must construe the statute strictly”).\r\n\r\n&gt;In FOIA cases particularly, **“Congress understood that government could not function\r\neffectively if public access were granted indiscriminately.”** Schell v. Dep’t of Health &amp; Human\r\nServs., 843 F.2d 922, 937 (D.C. Cir. 1988). But rather than grant the court the authority to strike\r\nwhat it perceives as an appropriate balance between transparency and government’s ability to\r\nfunction, “Congress sought a workable balance . . . by providing nine statutory exemptions from\r\ndisclosure.” Id. **The defendant’s concerns regarding the potential damage that disclosure would\r\nhave on the Vice President’s ability to discharge his official functions are appropriately addressed\r\nby this court if, and when, the defendant invokes a specific FOIA exception.** NLRB v. Sears,\r\nRoebuck &amp; Co., 421 U.S. 132, 150 (1975) (recognizing that “Congress had the Government’s executive privilege specifically in mind in adopting Exemption 5,” which protects from\r\ndocument “disclosure [] which ‘would be injurious to the consultative functions of\r\ngovernment’”) (internal quotations omitted).\r\n\r\n&gt;At this juncture, however, the plaintiff is not asking the court to mandate disclosure of the\r\nrecords. Instead, it seeks only that the court direct the agency to fully process its FOIA request\r\nand to do so in an expedited fashion. **The defendant has *neither demonstrated nor argued* that\r\nsimply processing the plaintiff’s FOIA request will do injury to the Vice President’s abilities to\r\ndischarge the duties of his office.** Accordingly, the court will proceed with a determination as to\r\nwhether the records in question are agency records, and it will analyze the defendant’s arguments\r\nconcerning harm to the Vice President’s function to a time after the agency conducts its review,\r\nidentifies responsive documents, asserts specific exemptions, and otherwise follows the ordinary\r\ncourse in FOIA cases.\r\n\r\nSo not only does your initial point about interfering with the VP's job not have merit here, the VP's lawyers didn't even bother to bring it up. Now since this release the DOJ has files an appeal to the DC Circuit court of Appeals, the contents of which we will not know until it is made more publicly available. If you have access to it please send me a link because I would love to see what kind of lame ass claims they are trying to hide behind at this point. In lieu of that we have one public sentence fragment from the appeal which states \"unprecedented intrusion into the daily operations of the vice presidency\", from the headline article and its news spammed AP variants. Having read the DC court ruling- that this is a business as usual request by the Washington Post, it would seem to be a long stretch to get to \"unprecedented intrusion\", specifically when the VP has the option of hiding whatever parts of the requested logs he likes. But of course we don't know yet since no one seems to have a public copy of the filing at this point.\r\n\r\nNow we also have this twist in the case where\r\n\r\n&gt;After the Deputy Director’s decision, however, on September 20, 2006, the\r\nFreedom of Information and Privacy Acts Officer for the Department of Homeland Security\r\nnotified Becker that the records sought are not agency records under FOIA and are governed by\r\nthe Presidential Records Act, 44 U.S.C. § 2201, et seq. Id., Ex. 6. This official explained that\r\nbecause the records “remain under the exclusive legal custody and control of the White House\r\nand the Office of the Vice President . . . the [Secret Service] lacks the authority” to provide the\r\nrequested records.\r\n\r\nWhere someone in the bowels of DHS attempted to apply the presidential records act to the logs, which itself is an unprecedented power grab on the executive side in favor of secrecy, and is typical behavior of the Cheney administration and it is such dramatically inappropriate behavior that I view it (the power grab) to be the real problem in this whole little fiasco, AS I STATED IN THE LAST 5 POSTS.\r\n\r\n&gt;The plaintiff subsequently commenced this action on October 10, 2006, seeking\r\ninjunctive relief. See generally, Pl.’s Mot. Because the plaintiff alleges a violation of a statutory\r\nright to expedited processing of a FOIA request, the court ordered expedited briefing. Minute\r\nOrder (Oct. 12, 2005). Now fully briefed, the court turns to the pending motion.\r\n\r\nBut of course, the Washington Post was having none of that and when fully briefed the DC court also was having none of that as their Memo above indicates. This is typical of so many of the executive overreaches by Team Cheney, Hamden v Rumsfeld among them. Why do something the normal way when you can attempt to invent new laws and power for yourself and spend years fighting and having them explicitly stripped from you in court?\r\n\r\nBut if we look at the more specific issues as you have been want to do, what we have here is a journalist looking for evidence of widespread corruption in the executive via many many extensive meetings between the executive and CONVICTED lobbyists and other influence peddlers. No one here is even remotely fishing for foreign visitors or looking for national security information- that was never the case. This is simply about the VP attempting to hide his corrupt misuse of the powers of office and attempting an executive power grab in the process, AS I HAVE CLAIMED FROM THE FIRST POST.","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166753200,"subreddit":"reddit.com","id":"cvphq","edited":false,"parent_id":"t1_cvphj","author_flair_text":null,"author":"smacfarl","distinguished":null,"retrieved_on":1473809168,"gilded":0,"timestamp_epoch":1566236774,"message_id":"44755-8fa32b8b-ecf4-49ce-aaf6-8fa3f4d384a1-1566236774"}