{"subreddit":"programming","author_flair_css_class":null,"created_utc":1166758167,"score":2,"ups":2,"body":"True, that is a bit hard to read. :-) There's a lot going on in that little line.\r\n\r\nHere's a broken translation in English:\r\n\r\n    `(let ((lst ((sxpath '(,@rest *text*)) ,obj)))\r\n         ...)\r\n\r\n\"Within this scope, let the name \"lst\" be bound to the result of applying an \"sxpath procedure\" to an object, \"obj\". The sxpath procedure performs an XQuery-like query upon the object (which is assumed to be a parsed XML document), finding a set of target nodes based on the query parameters specified in the list \"rest\". Upon finding those target nodes, take the text content of each of them, and keep it in a list. This list is the return-value of the sxpath procedure; it becomes bound to the name \"lst\" in the scope of this (let) statement.\"\r\n\r\nPart of that is the nature of (let), a common binding form in Scheme, part of it is Lisp-style macro definitions (the commas, quotes and at-sign), and part of it is an understanding of the \"API\" of the sxpath library. \r\n\r\nI'm not sure if I could have written it in a more clear fashion, with respect to readability. I should note that this is why I added the comments to the macro definition:\r\n\r\n    ;; just a little sugar for getting text from XML nodes.\r\n    ;; e.g. (&gt;&gt; my-htmldoc html head title) --&gt; \"doc title\"\r\n    ;;      (&gt;&gt; my-htmldoc // h1) --&gt; \"first main heading\"\r\n\r\nso that you might get a sense of what the macro could do, before (or in place of) trying to read it and figure it out.\r\n\r\n[ed: corrected a few silly mistakes in my English, above. Glad my code wasn't so broken. :-)]","controversiality":0,"link_id":"t3_vebh","stickied":false,"subreddit_id":"t5_2fwo","gilded":0,"retrieved_on":1473809172,"distinguished":null,"author_flair_text":null,"author":"gmfawcett","edited":false,"id":"cvpon","parent_id":"t1_cvop8","timestamp_epoch":1566236774,"message_id":"44860-1764fb6e-22a5-4062-bb86-cc663c3bba2f-1566236774"}