{"distinguished":null,"retrieved_on":1473809178,"gilded":0,"id":"cvpz7","parent_id":"t3_vo98","edited":false,"author":"xabbu","author_flair_text":null,"score":0,"ups":0,"author_flair_css_class":null,"created_utc":1166766422,"subreddit":"programming","subreddit_id":"t5_2fwo","link_id":"t3_vo98","stickied":false,"controversiality":0,"body":"I really am tired of seeing all the PHP bashing. Yes, it's far from a perfect language, but all languages have their annoyances, drawbacks and warts. And I prefer Ruby over PHP for anything except Web applications -- RoR might be fine for toy applications, but it shoehorns a developer too much IMO, in it's \"opinionated\" philosophical underpinnings.\r\n\r\nMeanwhile, PHP is powering major web applications and enabling point and click publishing. Whether it be [WikiMedia](http://meta.wikimedia.org/wiki/Main_Page), [WordPress](http://wordpress.org/) blogging software or [forum communities](http://www.simplemachines.org/). Robust systems with thousands of users and millions of page views. Anyone can install these applications on a shared web host and immediately have a dynamic database backed web site.\r\n\r\nPHP5 has added some cool features -- _autoload (spares me the include/require stuff and just build objects), static variables, PDO, integrated SQLite, etc... ...and I still love the concise, simple file_get_contents/file_put_contents functions.\r\n\r\nRuby and Python (the whitespace not a big deal to me, but the superfluous declaring of self arguments in class methods drives me batty) are cool, but they won't reach critical mass until there's enough F/OSS applications for folks to easily click &amp; install on a shared host. Most stuff running on the web for many organizations, small &amp; medium sized businesses are all on shared hosts, and that market and its needs are being met with PHP today.\r\n\r\nWhat the future holds, who knows. Languages are tools, they shine in some ways, suck in others, and all typically evolve into something smellier.","timestamp_epoch":1566236774,"message_id":"45009-02d8283f-9daa-43ce-8fd1-8c700ef41c51-1566236774"}