{"link_id":"t3_vpc5","stickied":false,"subreddit_id":"t5_2fwo","body":"&gt; Perhaps enough thought was not given to that \"What We Need\" section, but much of the point was to gather feedback and thoughts from other perspectives.\r\n\r\nI hope I was not so blunt as to offend. :)\r\n\r\nAs far as e-commerce vendors, I think that some kind of payment hook could be added or layered on OpenID.  It seems to me that all vendors care about is that the person in question legally controls a credit card, and if they can be fairly sure of that, all is fine.  They don't have to be perfectly sure, of course, since they aren't now, and since end users can do chargebacks and cancel cards, they aren't too concerned about that, either.\r\n\r\nAs for verifying an identity, it's not clear to me that it's possible to do this in a general way.  There are parts of the world where it's more common to have a cellphone than a State-issued ID of any kind, so verifying someone's identity seems very vague.  Does this mean you want verification that a name, \"X\", is associated with a particular body?  Who could possibly certify that?  This same person might be called \"X\" here, and \"Y\" a few neigborhoods over.  Which is his identity?  What about the five other people called \"Y\" in this area?\r\n\r\nNow, these problems might seem remote (literally), but one of the wonderful things about OpenID is that it mostly sidesteps this.  Not only do people pick their own ID provider, but someone could use more than one provider, obtain separate IDs, and there's no conflict, because the provider certifies easily that they've handed out the ID to only the person that has it.\r\n\r\nNow, there are still lots of problems (domain sales; XSS attacks; etc), but OpenID seems very promising in its current form, and it seems like at least some of those problems can be fixed in future versions.\r\n\r\nI haven't rushed out to implement the OpenID links on my personal site, yet, but I'm thinking about it. :)\r\n\r\n[edit: actually, I see they're already fixing the domain sales hole with \"XRI\" identifiers.  We'll see how that works.]","controversiality":0,"author_flair_css_class":null,"created_utc":1166766956,"score":3,"ups":3,"subreddit":"programming","id":"cvq01","edited":false,"parent_id":"t1_cvppb","author":"randallsquared","author_flair_text":null,"retrieved_on":1473809178,"distinguished":null,"gilded":0,"timestamp_epoch":1566236774,"message_id":"45016-ec14e07b-3d2b-4e08-b168-188b6c3b59e9-1566236774"}