{"distinguished":null,"retrieved_on":1473809178,"gilded":0,"id":"cvq0t","edited":false,"parent_id":"t3_vpcj","author":"anusmccolon","author_flair_text":null,"score":10,"ups":10,"author_flair_css_class":null,"created_utc":1166767504,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vpcj","stickied":false,"body":"That description is complete crap. The only way illegal immigrants would \"take jobs\" from citizens would be if they were hired at the exact same rate as the citizens would get (lets take the example figure posted by momo393 of $10/hour), which of course is not the case - the only way an illegal immigrant is going to get hired is by undercutting the wage the plant would have paid an American citizen (I would imagine most economists would have interesting things to say about how the minimum wage provides a wedge for illegal immigrants to enter the country, but I digress)\r\n\r\nSo let us say that the illegal immigrants undercut the American citizens by 50% - they take $5 an hour to work at the meat-packing plant. Now, what do you suppose the plant's owner is going to do with the dollars he saved by hiring the illegal immigrant? Eat them? \r\n\r\nNo, he's going to spend them, creating (you guessed it) new jobs. The idea that an illegal immigrant takes a job and as a consequence of this an American is irrevocably deprived of being able to make a living is an economic fallacy promoted sometimes by the types of ignorant people who think that buying a crappy American car will save the country, but sometimes, as in this case, it is perpetuated by people who should know better.\r\n\r\nIllegal immigrants don't \"steal jobs.\" They are willing to do exactly what you do for less pay - that's called free-market competition, and it is responsible for nearly all the wonderful things you have in your life (like the internet-enabled computer that allows you to make a post about how said competition \"take[s] jobs from citizens\"). The *problem* with illegal immigration arises when it takes place in a welfare state, and it is a problem to the extent that illegal immigrants consume resources intended for rightful citizens and do not pay their fair share in taxes to help the country continue to provide those resources.\r\n\r\nThe \"they stole our jobs!\" bit is polemic, it's ignorant, and as far as economics goes it's just plain nonsense. Stop it.","controversiality":0,"timestamp_epoch":1566236774,"message_id":"45027-21e93878-dd3b-4a9f-a091-2356340c5488-1566236774"}