{"author":"entropyfails","author_flair_text":null,"id":"cvqjo","edited":false,"parent_id":"t1_cvq2t","gilded":0,"distinguished":null,"retrieved_on":1473809188,"body":"I would like to understand that as well. I'll delve in to speculation as we are on reddit... ;)\r\n\r\nWe do know that any symbolic system is not capable of containing all truths about natural numbers. For me, this means that the information domain lies outside any symbolic processing system such as a computer or brain. I personally don't see any difference between the brain's system and a computer system, but we'll have to wait for a true AI to prove that point.\r\n\r\nSo if the informational domain does not lie inside of the computations that the material universe is capable of, then we have reason to believe that the Platonic Ideal actually exists either independently of the universe or is the actual basis of what we perceive as reality. (via cave arguments, perhaps?) Or it could be both at the same time.\r\n\r\nIf so, then the idea of a \"past life\" only means that a particular person is able to use their intuition to access a specific part of the incorporeal information domain. Since it obviously wasn't built via changing symbolic weights to proper values inside the brain, it must be that the random connections in the brain map onto the particular part of the informational domain that contains the needed facts. \r\n\r\nSo now we have to ask how this impossible chain of events happens? The HOW the information gets there seems solved, some process sets up what we perceive as random brain connections in a non-random way when viewed through the filter of a \"past life.\"  But that leaves us with more questions about what does the \"setting up\" or if it has any meaning at all that we can find. \r\n\r\nI guess that's enough speculation for now! =) I don't really know what to make of reincarnation. I don't have any belief in \"the soul\" so I'd like a better explanation as well. But I feel that Dr Stevenson's work and other non-scientific evidence (ie Dalai Lama) do leave some open questions that cannot be adequately answered by our current scientific understanding.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vo8v","subreddit":"reddit.com","score":2,"ups":2,"created_utc":1166791240,"author_flair_css_class":null,"timestamp_epoch":1566236774,"message_id":"45232-a4a299e3-26d9-4502-840d-84ee2f2a06ab-1566236774"}