{"distinguished":null,"retrieved_on":1473809198,"gilded":0,"parent_id":"t1_cvp5l","edited":false,"id":"cvr1e","author":"gwright","author_flair_text":null,"score":2,"ups":2,"created_utc":1166801541,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_vo79","body":"&gt; However, if an organization made it their business to take donated clothing and deliver it for free to Africa, the net effect might be positive.\r\n\r\nDeliver it for free to Africa?  That means that the shipping costs would also have to be covered by donations.  Now someone has to not only find clothes to be donated but to also find cash to be donated in order to ship the clothes.  In any case if the clothes were actually delivered in bulk for free to some foreign market, don't you think that someone there would suddenly realize that they could actually *sell* the clothes instead of wearing them?  I suppose you could create all sorts of regulations and government inspectors and NPO watchdog groups to make sure that the 'free clothes' actually were distributed for free, but then you need to figure out a way to fund all those regulatory mechanisms--maybe through more donations?   Doesn't it make a lot more sense to let market mechanisms automatically solve these problems?\r\n\r\nWhat exactly is so evil about people recycling clothes for profit?  The market mechanism in this case benefits a huge number of people.  The donor feels good about not throwing away clothes and saves money by reducing their trash.  The charity makes clothes available locally at reasonable prices.  Local consumers get used clothes that they've been looking for.  The charity earns money by selling the excess to the textile recyclers.  The recyclers make money by exporting the clothes to other markets.  The shipping companies make money by transporting goods.  The importers/sellers make money in the other markets and the consumers in the other markets get cheap clothes that they would not have otherwise had access to.  This is a win-win-win-win-win situation.\r\n\r\nThe only people losing out are those who insist on engaging in an unprofitable economic activity (locally produced clothes at above-market prices).   What is the motivation for making the clothing world revolve around that particular group of people?  In a free market, they are free to find new markets, adjust their product to increase demand, or change the business they are in and find some other way to make a living.  Sure, it would be easier for them if the entire economy was based on subsidizing their personal career choices, but what makes them so special?","controversiality":0,"timestamp_epoch":1566236775,"message_id":"45462-30553c33-35e1-4ead-8b82-9c0be6c41883-1566236775"}