{"subreddit_id":"t5_6","link_id":"t3_vnhg","stickied":false,"body":"http://www.exmormon.org/whyileft.htm\r\n\r\n...\r\n\r\nThe Book of Abraham is another document where Smith is a perpetrator of a fraud. This is the translation of an Egyptian papyrus which came into Smith's possession, and which he claimed to have been written by Abraham in Abraham's own handwriting and with his signature!. Note, that these papyri were too new to be Abraham's by almost 1500 years!! There was no one in Joseph Smith's time who could refute the \"translation\" as can be done today. So he was able to take advantage of people's ignorance of Egyptian. Smith charged admission to see the papyrus. Smith even prepared an Egyptian Grammar based on this papyrus. Smith's Egyptian Grammar was not published until the 1960's, and needless to say, it bears no resemblance to what we now know of actual Egyptian grammar.\r\n\r\nThe papyrus disappeared and was believed to be lost, but it turned up again in the Metropolitan Museum in NY, in 1967. Alas, the papyrus, which can be easily read by Egyptologists, is an ordinary Egyptian funerary papyrus from the 1st century A.D. and the text has absolutely nothing to do with the Book of Abraham! The attempts by the church to rescue this book are not much more plausible than the arguments used to support the Kinderhook Plates. Some Mormon scholars claim, for example, that the text of the Book of Abraham was somehow secretly encoded into this Egyptian papyrus or that the text somehow \"inspired\" Smith, in spite of the fact that there is no resemblance in content. Again, in a case where Smith can be checked, he comes up wanting.\r\n\r\n","controversiality":0,"score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166805159,"subreddit":"reddit.com","edited":false,"parent_id":"t1_cvqzp","id":"cvr90","author":"punkgeek","author_flair_text":null,"distinguished":null,"retrieved_on":1473809202,"gilded":0,"timestamp_epoch":1566236775,"message_id":"45577-e64e19ec-c64a-42b4-82c9-ee37876e8562-1566236775"}