{"author_flair_text":null,"author":"aardvarkious","parent_id":"t1_cvr9y","id":"cvrdh","edited":false,"gilded":0,"retrieved_on":1473809203,"distinguished":null,"body":"Many IQ tests do not test speed. And abstract pattern recognition is only a small part of IQ tests- there is also object identification, vocabulary, logic, math, etc...\r\n\r\nIQ tests were originally instituted in France to determine what schools children should attend. Consitently French-born children did better on these tests than 1st or 2nd generation immigrants: that test (much like modern ones) was a measure of cultural intelligence as much as anything else.\r\n\r\nIt has been proven pretty much without a doubt that IQ tests are affected by culture as much as anything. In North American tests, the population which scores 100 consistently is white, middle class citizens (which is how it should be because they are the majority, or rather the largest minority, and IQ tests are meant to test people compared to an average- some groups score higher than white middle class people, some lower). Just like, on average, rich people do better than poor people, so white people do better than black people (and nd generation Asian immigrants do better than anyone). This has nothing whatsover to do with white (or rich) people being more intelligent, it simply means that the tests are culturally targeted towards them. It would be possible to write an IQ test where black people consitently scored better than white people, or poor better than rich. It is just that this would no longer accurately measure averages.\r\n\r\n***My source is an \"Introduction to Psychology\" text book published in 2003. If its in an introductory book and given as truth (not a discussion), then this information is not anything new and probably isn't controversial among academics. If my professor had not been able to teach this, or use the text-book, that would have been a damn shame.","controversiality":0,"link_id":"t3_vqg5","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166806873,"score":4,"ups":4,"timestamp_epoch":1566236775,"message_id":"45659-f0d73edc-9b9a-41e7-aa6a-f1c6c8e9c867-1566236775"}