{"gilded":0,"retrieved_on":1473809206,"distinguished":null,"author_flair_text":null,"author":"beowulf","edited":false,"parent_id":"t1_cvr6z","id":"cvrj2","subreddit":"programming","created_utc":1166809099,"author_flair_css_class":null,"score":9,"ups":9,"body":"I used C# for about three years on some very large applications, then I switched over and used Python for about four years after that on some very large projects.  I've been programming in Ruby for about two years now.  My opinion is that Python and Ruby are much better languages than C# when it comes to really large projects.  The reductions in code size and the improved abstractions really gain a lot of traction on a code base of serious size.\r\n\r\nMy experience is that in C# or Python or Ruby, the quality of the code is 100% dependent on the person writing the code.  Basic type errors just aren't the real world problems that people run into when building big systems.  Other issues are much more problematic.  For instance, I can't tell you how many times I've seen a C# guy declare class level variables in some complex process and start modifying them all the time.  In reality those class level variables become mini-global variables with all of their attendant problems.  I've also seen Python programmers abuse the hell out of multiple inheritance creating a nightmarish hierarchy.\r\n\r\nUltimately readable code depends on writing good code in whatever language you are working in.  Personally I prefer Python and Ruby over C#.  In my opinion their reduced lines of code and increased powers of abstraction outweigh that once a year type issue that comes up.\r\n\r\nNo languages are perfect, particularly when the code is written by imperfect programmers.  Using Ruby or Python doesn't automatically create beautiful elegant code, on the other hand, if you think someone can't screw up C# or Java code in real world applications, I'd suggest you haven't worked with very many people on real world applications.","controversiality":0,"stickied":false,"link_id":"t3_vr55","subreddit_id":"t5_2fwo","timestamp_epoch":1566236775,"message_id":"45752-0b362264-d271-4ce9-9f4c-9a96dd69c464-1566236775"}