{"retrieved_on":1473809213,"distinguished":null,"gilded":0,"parent_id":"t1_cvr6s","id":"cvruz","edited":false,"author_flair_text":null,"author":"depleater","author_flair_css_class":null,"created_utc":1166813844,"score":3,"ups":3,"subreddit":"reddit.com","link_id":"t3_vnhg","stickied":false,"subreddit_id":"t5_6","body":"Seriously, uriah923. Links to Brigham Young? Now *there's* a totally\r\nunbiased source :).\r\n\r\nI couldn't work out what specific points your\r\n[second](http://maxwellinstitute.byu.edu/publications/dna.php?selection=dna&amp;cat=dna)\r\nand\r\n[third](http://maxwellinstitute.byu.edu/publications/bookofmormonview.php?subcat=198&amp;cat=5)\r\nlinks were meant to convey, as they were both pointers to a collection\r\nof quite a few articles, more than I could reasonably investigate in a\r\nshort amount of time. But [your first\r\nlink](http://maxwellinstitute.byu.edu/display.php?table=jbms&amp;id=311)\r\nwas to something specific, an article from the [Journal of Book of\r\nMormon\r\nStudies](http://maxwellinstitute.byu.edu/publications/jbmsmain.php)\r\nby the totally unbiased [Associate Professor Michael\r\nWhiting](http://maxwellinstitute.byu.edu/viewauthor.php?authorID=220).\r\n\r\nThis article... well, it strikes me as unnecessarily verbose\r\nhandwaving. I don't know anything about the specifics of the Mormon\r\nfantasy, so had to rely on this representation:\r\n\r\n&gt; The critics argue that the Book of Mormon predicts that the Lamanite\r\n&gt; lineage should carry the genetic signature of a Middle Eastern\r\n&gt; origin and that the genetic descendents of the Lamanites are Native\r\n&gt; Americans. They then scour the literature to show that current DNA\r\n&gt; research suggests that Native Americans had an Asian origin. These\r\n&gt; results are then trumpeted as invalidating the authenticity of the\r\n&gt; text.\r\n\r\nHeh. Nice spin. \"Scour the literature\" suggests desperation, and\r\n\"trumpeted\" suggests an inappropriately scientific lack of detachment.\r\n\r\nMost of the rest of the article seems (to me at least) to be a lot of\r\ndouble-talk and waffle, attempting to confuse the issue as much as\r\npossible (and making straw men out of the \"critics\").\r\n\r\nThere was one point (which he made a few times in different forms)\r\nthat I found interesting:\r\n\r\n&gt; The problem is that, unlike a good NSF research proposal, the Book\r\n&gt; of Mormon does not explicitly provide a list of null and alternative\r\n&gt; hypotheses for scientific testing.\r\n\r\nHeh. Yeah, what a surprise :). I especially like the \"explicitly\"\r\nqualifier - as though it's not playing fair to test any of the\r\n(intentionally?) implicit assertions made by Mormon religious texts.\r\n\r\nYou see, this is one of the classic reasons that there's not much\r\npoint in using science to poke holes in religious fantasies **if**\r\nyour goal is to \"win\" an argument with a religious type. They'll just\r\ngo ahead and shift the goalposts (sadly enough, not all of them - many\r\nhave an impressive ability to ignore reality). \"Okay, yes the Old\r\nTestament does say that the world was created in seven days... but it\r\ndoesn't specifically say how *long* those days were! They were, um,\r\n*metaphorical* days!\" ... uh-huh.\r\n\r\nBut there are other reasons to debunk religious fantasies, just like\r\nthere are good reasons to publicy debunk all other kinds of hoaxes and\r\nconfidence tricks. For example, the easier it is for people to look up\r\nreputable information (especially online) on these kind of scams, the\r\nmore likely it is that such people can avoid getting caught in them.\r\n","controversiality":0,"timestamp_epoch":1566236775,"message_id":"45906-03bbd243-cfbe-4b87-b59b-c86409588d26-1566236775"}