{"gilded":0,"retrieved_on":1473809215,"distinguished":null,"author_flair_text":null,"author":"[deleted]","edited":false,"id":"cvrx8","parent_id":"t1_cvc62","subreddit":"reddit.com","created_utc":1166814702,"author_flair_css_class":null,"score":1,"ups":1,"controversiality":0,"body":"I am afraid I am pretty busy with work these days so I don't have time to do a line by line.  \r\n\r\nThe \"non-overlapping magisteria fallacy\" is not a fallacy, it is a philosophical position that you don't agree with so you call it a fallacy.  While there may be some kind of overlap between domains in some respects, each has elements that are distinct with no overlap.  You can't empirically and quantitatively examine logic, logic is simply not a domain that science can discuss.  Like mathematics, it is something that has to be taken as being prior to science.  So too with much of the domains of epistemology, ontology, and metaphysics.  Which brings us to the philosophy of mind.  If you assume materialistic monism, you can assume an overlap between science and philosophy, but I am a substance dualist (that's really kind of crude, ultimately I am a monist, but not a materialist monist, but I don't want to spend a thousand words on that in busy times), so I'd say that the nature of consciousness is prior to science.  If you assume materialism you can try to seek out materialist accounts of consciousness, but as yet the search has been fruitless, and what you really have going on is the Atheism of the Gaps:\r\n\r\nhttp://www.leaderu.com/ftissues/ft9511/revessay.html\r\n\r\nWhen I described my experiences I said outright that I did not expect them to convince you of anything, I don't care what you think.  You can call me a liar, a charlatan, a poet, or whatever.  But being who I am as having had those experiences, I personally cannot accept materialism.  If you think I have made them up, that really just goes to show that materialism prejudices one's understandings as much as theism does.\r\n\r\nWhile the things I described to not in themselves show life after death, they do (at least to me) illustrate that materialism is not adequate to explain the whole of human experience.  As such, once one has been unshackled from materialism, then the possibility of life after death is at least a position that could be considered without prejudice. There are some data points that I can offer:\r\n\r\n1) The manner of the discovery of the current Dalai Lama, which was described here:\r\n\r\nhttp://reddit.com/info/vo8v/comments/cvosx\r\n\r\n&gt;After the last Dalai Lama died an oracle was consulted to find the next incarnation. The oracle gave a description of a kind of house with a number of geographical details. Three houses in Tibet were found that met the description. A group of monks went to each house with a collection of items, some of which were previously owned by the Dalai Lama, some of which were randomly selected. When they arrived the current Dalai Lama greeted some of the monks who had known the previous Lama as if he knew them. When they laid out the items, the current Dalai Lama selected all of the items that were associated with the previous Dalai Lama, and none of the others. This did not occur at the other two houses. There are a number of other remarkable details as well.\r\n\r\nThat description is actually imperfect, but I can't find a resource inline that describes it.  The actual description was even more remarkable.  \r\n\r\n2) There have been a number of similar incidents in Tibetan Buddhism.  I don't have a list available, since I 've sold off the relevant books, and Google isn't doing it for me, but some time with library research could turn up an number of other events. \r\n\r\n3) Dr. Ian Stevenson's book\r\nhttp://en.wikipedia.org/wiki/Twenty_Cases_Suggestive_of_Reincarnation\r\n\r\n4)  I have had two other experiences I don't care to describe which have sealed the deal for me.  To vaguely describe one, it involved seeing a vision of an uncle who had recently died, though at the time it was not known that that person was dead.  I don't expect this to persuade you at all, but all the same, it has erased from my mind the possibility of materialism, and persuaded me that life after death is likely.\r\n\r\nThe thing is that in most cases experiences of spiritual matters requires spiritual exercises, and those exercises that are effective are taught such that they do not seek out supernaturalism, nor do they reveal supernatural phenomenon that might occur as side effects, since that draws in those who are seeking magic rather than spirituality.  If skeptical investigators have not found cases of spiritual phenomenon that could be verified it is unsurprising since only charlatans would ever approach them.\r\n","stickied":false,"link_id":"t3_v6h2","subreddit_id":"t5_6","timestamp_epoch":1566236775,"message_id":"45943-f1f37023-787d-4052-b972-82dcd8a45d98-1566236775"}