{"id":"cvsgc","edited":false,"parent_id":"t3_vrmf","author_flair_text":null,"author":"rocky_m","distinguished":null,"retrieved_on":1473809225,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vrmf","controversiality":0,"body":"I have no hate for the lying stripper, or the lying Durham DA (Nifong) who milked this for political gain. There are always bad individuals in any society.. My anger is exclusively to all those \"Black-rights orgs\" which jumped on this bandwagon, destroying the lives and careers of those kids and the harmony in the Duke-Durham community..\r\n\r\nI remember all those scary e-mail all students at Duke got from the President Brodhead warning students about the \"New Black Panther\" party which had come to Durham from all over the country to \"protest\".. (The mail said some of those \"activists\" might be armed and might enter university buildings etc..)\r\n\r\nAnd this \"New Black Panther\" party was not the only Black organization to jump on this racist tirade against students at Duke. Black organizations from around the country immediately bought EVERYTHING that stripper had to say and immediately incriminated those kids from the Lacrosse Team..\r\n\r\nI belong to a much smaller (non-white) minority (as compared to Blacks), and after this incident I lost ALL respect for these \"Black Activists\" and there organizations..\r\n\r\nBlack-rights Leaders of the past were a beacon to other minorities in the country (and the world). I count Dr. MLK Jr. among the greatest human beings in history.. \r\n\r\nSadly, given the current state of this movement.. The \"movement\" has deteriorated to just racism against white people, and they should be ashamed of themselves.. (and I direct it, not to all Black people, only to these \"Black-rights activist\" who terrorized students at Duke..)\r\n\r\n(edit: got rid of the N-word..)\r\n","score":10,"ups":10,"created_utc":1166824237,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236775,"message_id":"46267-9d26d36c-1f2a-4629-b66d-41c04e9345ee-1566236775"}