{"stickied":false,"link_id":"t3_vs7p","subreddit_id":"t5_6","controversiality":0,"body":"My comment, as posted with the article ...\r\n\r\nIncorrect.  I agree in theory, but in practice this attitude has been proven time and time again to simply not work.  I'm a dyed-in-the-wool libertarian, but I support the public smoking bans.  The simple economics of it make a single restaurant or bar banning smoking a bad business idea.  \r\n\r\nSmokers definitely won't come there (obviously), especially when the place right next door allows it.  And in general, people look for a crowd when they're going out, so the immediate drop off in smokers will pull away the non-smokers who would rather hang out where the most people are.\r\n\r\nThe sole place that a government SHOULD step in is where the market is given a chance to make the proper choice, but has proven consistently to make the worse choice to the detriment of its participants.  So, in this case, where the market has shown to maintain a status that is harmful to citizens, the government should step in and act on behalf of the citizenry.  This should only be the case when that action is supported by ample evidence to be better for the people (ie, health-wise).\r\n\r\nAny studies disputing the health effects of second-hand smoke are almost always ones funded by tobacco companies.  Any \"grassroots\" efforts AGAINST smoking bans?  Backed by tobacco companies, though covered through many layers.\r\n\r\nThe funny thing is, in almost every municipality (or county, state, whatever) where public smoking bans were implemented ... nearly universally saw an upswing in the amount of business at bars, retaurants and the like ...","created_utc":1166824320,"author_flair_css_class":null,"ups":1,"score":1,"subreddit":"reddit.com","id":"cvsgl","edited":false,"parent_id":"t3_vs7p","author_flair_text":null,"author":"dieselcreek2","retrieved_on":1473809225,"distinguished":null,"gilded":0,"timestamp_epoch":1566236775,"message_id":"46275-d5dcd181-721b-48a0-a445-0827a69666d1-1566236775"}