{"author_flair_text":null,"author":"bonniejeanne","id":"ctfdo","edited":false,"parent_id":"t1_ctf4l","gilded":0,"distinguished":null,"retrieved_on":1473807619,"body":"Not only is it misleading it is racist and hateful.  This is the media trying to dehumanize Muslims all over the world to justify the West's illegal, irresponsible, and idiotic actions in the Middle East (both before and after september 11).  \r\n\r\ntheir demand to continue to have final say over rape cases isn't about religion. while they may use the language of Islam to justify their opposition to it, but its not about islam, its about power. these provinces resent the central government and have long been marginalized economically, socially, and politically. \r\n\r\nand unlike BBKLYN suggests, I would really doubt that these leaders were democratically elected.  Pakistan isn't really a democracy (unlike India which he tries to compare it to).  Musarraff (spelling?) has never been elected and has never had to run in an election.  he keeps promising democratic reform but little has changed.  i'm sure regional representatives are elected in some manner, but i doubt everyone is represented by the vote (much like our vote) and to judge a country based soley on the elected leaders from some extreme states is unfair.  imagine if they judged us exclusively by our leaders who condone or even encourage the use of the torture in the war against \"terrorism\"declaring sacred rights like habeus corpus dead so we can protect our \"freedoms\"?  or the fiercely zionist statements always emerging from washington on both sides of the aisle? ignoring the hundreds of palestinian and lebanese civilians murdered this year in Israeli incursions. what if europe judged us soley on our crazy senators like Coburn and former-senator Santorum?  It wouldn't be fair, just like this article isn't fair. \r\n\r\nI wish people would stop buying into this hate they're (our government, coporations, the people profiting from this state of constant warfare) trying to promote in the media.","controversiality":1,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tdo4","subreddit":"reddit.com","score":-1,"ups":-1,"created_utc":1165132400,"author_flair_css_class":null,"timestamp_epoch":1566236759,"message_id":"4639-c84d2361-72e7-4d39-9d8d-94a60b85c958-1566236759"}