{"body":"&gt; The clothing was given freely with the presumption that a poor person would be receiving it for free.\r\n\r\nReally?  Maybe the donation was to the charity and not to some abstract local person in need.    If the donor believes in the mission of the charity and leaves it to the charity to figure out the best way to use the donated clothing, doesn't that make more sense?  Some is given directly to those in need (homeless, house burned down, etc.).  Some is sold on the open market (local consumers looking for interesting clothes, those interested in cheap clothes, and so on), some is sold to textile recyclers.  The charity can then use the sales revenue to address needs that aren't met via the used clothes themselves (like new clothes of a different size or perhaps new underwear that certainly isn't going to get donated and so on).\r\n\r\nAs long as the charity is using the donation to further their publicly stated mission, I don't think anybody is being defrauded.\r\n\r\nThe problem with your hypothetical requirement (or the requirement of your hypothetical donor) that the clothes must be given directly to a poor person is that the requirement presupposes an exact match between supply and demand.  But there is no reason to think that the particular types of donated clothes are going to exactly match the needs/desires of those served by the charity.  The open market provides a way to allocate the different types of clothes (fashion/quality) to different types of markets via the most efficient process.\r\n\r\nI'll bet if you sat down and talked to a bunch of charitable organizations you would find that they much prefer unrestricted donations over donations that come with particular restrictions attached ('must give to local poor person').  It may be true that many people think they are donating their clothes to a local person in need but that only works if there is a local person who needs/wants the particular donated clothes.  If there is a mismatch, then the charity is left with truckloads of clothes that, according to you, they aren't permitted to sell.  What to they do with them, toss them in the land fill?\r\n\r\nI think the food bank (or food in general) is a much different situation because you don't reuse food.  We aren't talking about a secondary market as with used clothing.  So I think the food situation is different.  That being said, I don't care what the food bank does with my donations as long as it furthers their mission.  For example, if they've got an abundance of green beans but no cereal, then I think they should sell the extra beans and purchase cereal.  I'm not going to get upset that they sold my donated beans.  If they sell the beans and buy themselves a nice new car, I would be upset but that is a different issue altogether.","controversiality":0,"link_id":"t3_vo79","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166829227,"ups":1,"score":1,"author_flair_text":null,"author":"gwright","id":"cvspf","edited":false,"parent_id":"t1_cvrzb","gilded":0,"retrieved_on":1473809229,"distinguished":null,"timestamp_epoch":1566236775,"message_id":"46416-5dbcc6db-0d30-4b2d-b5e7-6467d8fa3ccb-1566236775"}