{"stickied":false,"link_id":"t3_vrot","subreddit_id":"t5_2fwo","controversiality":0,"body":"&gt; My point is that he's probably more skilled than the average programmer. That means he can do things that normal programmers can't do. The reason to keep that person around is that if you ever need someone to do the impossible (what normal programmers find impossible), you've got him around.\r\n\r\nThat assumes he is capable and willing to work on non-Samba projects. Some people spend so much effort becoming domain experts in one area that they are just about useless in other areas.\r\n\r\nLets assume our he is not Allison, but rather some unnamed member of the Samba team. Assuming our Mr. X is really good, I see him falling into one of three categories.\r\n\r\n1: General go-to guy. Can work on anything, but isn't an expert on any specific task.\r\n2: Domain expert on reverse engineering MS network protocols.\r\n3: Domain expert on Samba code.\r\n\r\nIf he is of the first type, a company would be foolish to let him go. Those kinds of programmers are not rare, but they are always in short supply.\r\n\r\nIf he is of the second type, then I see it being a coin toss. Novell could benefit for that on non-Samba projects, but with the MS deal they shouldn't need to reverse engineer as much. Considering how rare \r\n\r\nIf he is the last type, a Samba expert, he is useless unless Novell needs some custom extensions that no one else is already asking for.\r\n\r\nGoogle is in the same boat. If google needs domain experts on MS networks or Samba, Mr. X of type 2 or 3 is essential. If not, then he is dead weight. Type 1's should obviously be grapped on principal.\r\n","created_utc":1166829786,"author_flair_css_class":null,"score":0,"ups":0,"subreddit":"programming","edited":false,"id":"cvsq0","parent_id":"t1_cvsot","author_flair_text":null,"author":"grauenwolf","retrieved_on":1473809229,"distinguished":null,"gilded":0,"timestamp_epoch":1566236775,"message_id":"46421-7ca750e7-413c-446f-9f15-144341e58d57-1566236775"}