{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vqbj","controversiality":0,"body":"Here is a [transcript of the Pope's speech](http://www.vatican.va/holy_father/benedict_xvi/speeches/2006/september/documents/hf_ben-xvi_spe_20060912_university-regensburg_en.html). Although the Pope's speech had [other errors](http://reddit.com/info/it0w/comments/cit10), it didn't have such any such quote about Muslims. For one thing, the \"guy\" he quoted (Manuel II Paleologus) died in 1425, whereas Constaninople did not fall to the Muslims until 1453.\r\n\r\nYou may have heard about the event known as the \"Sack of Constantinople\". I'll let the War Nerd describe it:\r\n\r\n&gt;Constantinople found out what it was like being visited by the knights of old in 1204. Those wonderful chivalrous knights needed a ride to the Holy Land and the Venetians offered to drop them off if they'd do a little favor: burning Venice's trade rival, Constantinople, and killing and raping everyone in it.\r\n&gt;\r\n&gt;\"Nooooo problemo,\" said the valiant knights, and in a few weeks Constantinople, a Christian city that had held off the Muslim hordes for centuries, was a smoking ruin.\r\n\r\nThe killing of the nun, Leonella Sgorbati, was an evil act, an attack on someone who made a great sacrifice for the cause of helping the suffering people of Somalia. \r\n\r\nIt is just speculation, however, that it was related to the Pope's speech. Somalia is a dangerous place.\r\n\r\n&gt;[Like many foreigners, she traveled with a bodyguard in Somalia, a Horn of Africa nation that sank into anarchy after warlords overthrew the country's longtime dictator in 1991.](http://www.iht.com/articles/2006/09/17/news/somalia.php)\r\n\r\nCatholic Relief Services says that\r\n\r\n&gt;[the motives for the murders are still not clear](http://www.crs.org/about_us/newsroom/press_releases/releases.cfm?ID=361)\r\n\r\nDave Lucas' take on it:\r\n\r\n&gt;[It's Mogadishu, stupid](http://dave-lucas.blogspot.com/2006/09/bloggers-muslim-witch-hunt.html)! It's like that seedy neighborhood in your city that you wouldn't want your kids to go near\r\n \r\nIt's a place where a lot of people have been gunned down. We don't know why she was gunned down. So the statement that \"in response muslims went and killed a nun\" is not factual.","score":7,"ups":7,"created_utc":1166830331,"author_flair_css_class":null,"subreddit":"reddit.com","edited":false,"id":"cvsr8","parent_id":"t1_cvrjq","author":"Stani","author_flair_text":null,"distinguished":null,"retrieved_on":1473809229,"gilded":0,"timestamp_epoch":1566236775,"message_id":"46443-7a599c4d-ee22-4bfe-8849-5c3b92e68cc9-1566236775"}