{"body":"From the FAQ\r\n\r\n&gt; How does Modest Needs differ from other, more conventional charitable organizations?\r\n&gt; \r\n&gt; Modest Needs Foundation differs from most conventional charitable organizations in several significant ways. For example:\r\n&gt; \r\n&gt; *   At Modest Needs, we focus on prevention by making grants designed to STOP the cycle of poverty BEFORE it starts. Conventional charitable and social programs play a critical role in the lives of those who simply cannot support themselves. But generally, individuals and families generally have to lose everything - including any hope of future self-sufficiency- before they qualify for assistance from these types of programs.\r\n&gt; \r\n&gt;     At Modest Needs, we think it makes more sense to assist hard-working individuals and families at the OUTSET of a financial crisis, when a small amount of well-timed assistance has the power to keep our applicants from entering the cycle of poverty altogether.\r\n&gt; \r\n&gt;     In this way, we not only promote the financial self-sufficiency of our applicants, we free up the critical tax dollars that otherwise would go to support these individuals and families, were we simply to take no action and allow the cycle of poverty to run its course.\r\n&gt; \r\n&gt; *   Modest Needs' donors have a real and tangible voice in how our funding - their funding - actually is allocated. In most cases, when a donor gives to a conventional charitable organization, they have minimal control - or no control at all - over how that gift actually is used. They have even fewer opportunities actually to participate in a charitable organization's funding and evaluation process.\r\n&gt; \r\n&gt;     At Modest Needs, we want our donors to become active participants in the work they're supporting. To that end, we give our donors the opportunity to read and evaluate (in an anonymous format) each application for assistance posted to the Modest Needs ledger. The rating that each application receives from our donors determines its place in our funding queue, and with few exceptions, we follow the guidance of our donors by giving priority to the applications for assistance that our donors tell us they most would like to see funded.\r\n&gt; \r\n&gt;     Modest Needs is proud to be the ONLY organization of its type to give its donors this unprecedented opportunity for personal involvement in the grant-making process.\r\n&gt; \r\n&gt; *   As part of our commitment to financial responsibility, Modest Needs spends no money - not ONE donor dollar - hiring professional fundraisers. We fundraise simply by making it possible for concerned members of the public to support this work if they wish to do so, and then we move to assist as many individuals/families as we can with the funding our friends and partners are kind enough to make available.\r\n&gt; \r\n&gt;     The fundraising costs that we report are the estimated percentage of our shared resources consumed by fundraising activities. We report these for the sake of transparency.\r\n","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_vsvz","stickied":false,"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1166833998,"author":"JulianMorrison","author_flair_text":null,"edited":false,"id":"cvsw1","parent_id":"t3_vsvz","gilded":0,"distinguished":null,"retrieved_on":1473809232,"timestamp_epoch":1566236775,"message_id":"46528-ed8ba04b-baef-4395-a455-f438186bd134-1566236775"}