{"gilded":0,"distinguished":null,"retrieved_on":1473809237,"author":"bevets","author_flair_text":null,"edited":false,"parent_id":"t1_cvruk","id":"cvt2z","subreddit":"science","score":-14,"ups":-14,"created_utc":1166838676,"author_flair_css_class":null,"body":"It remains that I should put before you what I understand to be the third phase of geological speculation -- namely [EVOLUTIONISM](http://bevets.com/evolution.htm). ~ Thomas Huxley\r\n\r\nIt is important to point out that laws and trends are radically different things. There is little doubt that the habit of confusing trends with laws, together with the intuitive observation of trends (such as technical progress), inspired the central doctrines of [evolutionism](http://bevets.com/evolution.htm) and historicism - the doctrines of the inexorable laws of biological evolution and the irreversible laws of motion of society. ~ Karl Popper \r\n\r\nI want to consider the way in which these two alternative world views-[evolutionism](http://bevets.com/evolution.htm) and creationism have affected or might affect systematics and systematists.\r\n\r\nGillespie's book is a historian's attempt explain the amount of space that Darwin gave to combating the creationist arguments. Gillespie shows that what Darwin was doing was trying to replace the creationist paradigm by a positivist paradigm, a view of the world in which there was neither room nor necessity for final causes. Of course, Gillespie takes it for granted that Darwin and his disciples succeeded in this task. He takes it for granted that a rationalist view of nature has replaced an irrational one and of course, I myself took that view about eighteen months ago. Then I woke up and realized that all my life I had been duped into taking [evolutionism](http://bevets.com/evolution.htm) as revealed truth in some way.   ~ Colin Patterson\r\n\r\nInherit the Wind took many liberties in telling the tale, shaping the clash to reflect concerns of the 1950s rather than the 1920s -- specifically the right to have contrary opinions which, thanks to the Cold War, Americans were under great pressure to conform to general norms of behavior and thought. In the real Scopes Trial, evolution -- particularly human evolution -- was certainly at the center of the debate, but the true issue was more the general philosophy for which evolution was taken to stand. [Evolutionism](http://bevets.com/evolution.htm) rather than mere evolution.  ~ Michael Ruse \r\n","controversiality":0,"subreddit_id":"t5_mouw","stickied":false,"link_id":"t3_vqk3","timestamp_epoch":1566236775,"message_id":"46642-245a329c-2822-4986-a1eb-5766de8be0d2-1566236775"}