{"body":"&gt; I'm troubled by students that take a cafeteria approach. They never get truly good at any single art and seem prone to make crucial errors as they try to mix skills from different sets.\r\n\r\nI'm not saying that we should avoid expertise in a single art.  On the contrary, expertise is always (in any reasonable circumstance) a good goal.  It's better to be a renaissance (wo)man than to overspecialize.  As you get further into the upper reaches of a given art's style, you tend to find yourself more and more focused on a specific, limited problem domain, to the neglect of others that can be critical.  If you don't offset that with a broader range of skills, you can find yourself in deep doo-doo at an inopportune moment, particularly when you're dealing with matters of self defense.\r\n\r\nPart of the problem of overspecialization is that it becomes increasingly difficult to recognize your own weaknesses, and even some of your strengths.  One of the better demonstrations of this in my own life relates to my work as an information technology industry professional: when I started making the transition from MS Windows to free unices, I learned more about Windows in the first year of playing with Linux than I had in the preceding three our four years of doing some seriously hairy Windows admin, cleanup, recovery, and customization work (I was working for the sort of consultancy that gets called only when someone needs something new and weird done or when someone seriously screws the pooch and desperately needs it unscrewed quickly).  Learning about how to use Linux-based OSes and how they work under the hood taught me things about MS Windows by contrast that I would likely never have learned otherwise.\r\n\r\nSimilarly, if I had spent exactly as much time learning exactly one martial art -- any one from among the many I've pursued for at least a couple months -- I would be far less knowledgeable and skilled than I am now.  I do wish I had buckled down and learned more of one of them (probably either aikido or Jeet Kune Do, given my druthers) than I had, but the main reason I have failed to focus more on a specific art is not the fact that I also learned a fair bit about the others.  It is, rather, the simple fact that I have moved around a bit, seen several studios close, and otherwise not spent as much time in martial arts training as I would like.\r\n\r\nFor most purposes, if it were a serious fight, I'd bet on myself over about fifty percent of the martial arts instructors I've had.  Each one of them, every single one, has so much more expertise in his chosen art that he could hand me my ass in an art-specific match without even breaking a sweat, but the ones to whom I'd most likely lose are those who have devoted serious time to learning more than just their one single chosen art.\r\n\r\nConsider this: the greatest martial artists of all time are, in general, thought to be those who are the progenitors of some of the most interesting arts (Bruce Lee -- Jeet Kune Do, Morihei Ueshiba -- aikido, Ng Mui -- Wing Chun, Zhang Sanfeng -- Tai Chi Chuan, et cetera), arrived at their ability to create and define a widely influential and very effective martial art by way of comprehensive knowledge of many arts, not by studying one isolated art exclusively.","controversiality":0,"stickied":false,"link_id":"t3_vjjh","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166840527,"author_flair_css_class":null,"ups":-2,"score":-2,"author_flair_text":null,"author":"apotheon","id":"cvt5d","edited":false,"parent_id":"t1_cvsiz","gilded":0,"retrieved_on":1473809238,"distinguished":null,"timestamp_epoch":1566236775,"message_id":"46686-48f95707-8129-4bc6-8128-23040af21e8f-1566236775"}