{"author":"smacfarl","author_flair_text":null,"edited":false,"id":"cvtis","parent_id":"t3_vtfa","gilded":0,"distinguished":null,"retrieved_on":1473809246,"body":"I have made a laughable crude attempt to supply context to the redaction based on the Raw Story selections. I obviously have no idea what the actual content was and have made a lame attempt to fill in what seemed to make sense and match the flow of the original Op-ed. I would ask fellow interested redditors to try the puzzle pieces on their own to create a more realistic version of the document. My feeble attempt is below **the substitutions are in bold**:\r\n\r\n***Un*Redacted Version of Original Op-Ed**\r\n\r\nThe Iraq Study Group has added its voice to a burgeoning chorus of commentators, politicians, and former officials calling for a limited, tactical dialogue with Iran regarding Iraq. The Bush administration has indicated a conditional willingness to pursue a similarly compartmented dialogue with Tehran over Iran’s nuclear activities.\r\n\r\nUnfortunately, advocates of limited engagement — either for short-term gains on specific issues or to “test” Iran regarding broader rapprochement — do not seem to understand the 20-year history of United States-Iranian cooperation on discrete issues or appreciate the impact of that history on Iran’s strategic outlook. In the current regional context, issue-specific engagement with Iran is bound to fail. The only diplomatic approach that might succeed is a comprehensive one aimed at a “grand bargain” between the United States and the Islamic Republic.\r\n\r\nSince the 1980s, cooperation with Iran on specific issues has been tried by successive administrations, but United States policymakers have consistently allowed domestic politics or other foreign policy interests to torpedo such cooperation and any chance for a broader opening. The Reagan administration’s engagement with Iran to secure the release of American hostages in Lebanon came to grief in the Iran-contra scandal. The first Bush administration resumed contacts with Tehran to secure release of the last American hostages in Lebanon, but postponed pursuit of broader rapprochement until after the 1992 presidential election.\r\n\r\nIn 1994, the Clinton administration acquiesced to the shipment of Iranian arms to Bosnian Muslims, but the leak of this activity in 1996 and criticism from presumptive Republican presidential nominee Robert Dole shut down possibilities for further United States-Iranian cooperation for several years.\r\n\r\nThese episodes reinforced already considerable suspicion among Iranian leaders about United States intentions toward the Islamic Republic. But, in the wake of the 9/11 attacks, senior Iranian diplomats told us that Tehran believed it had a historic opportunity to improve relations with Washington. Iranian leaders offered to help the United States in responding to the attacks without making that help contingent on changes in America’s Iran policy — a condition stipulated in the late 1990s when Tehran rejected the Clinton administration’s offer of dialogue — calculating that cooperation would ultimately prompt fundamental shifts in United States policy.\r\n\r\nThe argument that Iran helped America in Afghanistan because it was in Tehran’s interest to get rid of the Taliban is misplaced. Iran could have let America remove the Taliban without getting its own hands dirty, as it remained neutral during the 1991 gulf war. Tehran cooperated with United States efforts in Afghanistan primarily because it wanted a better relationship with Washington.\r\n\r\nBut Tehran was profoundly disappointed with the United States response. After the 9/11 attacks, **a U.N.-sponsored conference in Bonn led by Jim Dobbins** set the stage for a November 2001 meeting between Secretary of State Colin Powell and the foreign ministers of Afghanistan’s six neighbors and Russia. **A draft document was established by these six nations and the US to create a broadly based democratic successor government to the Taliban, as well as to collectively support a democratic Afghanstan and jointly prosecute the war on terror.** Iran went along, working with the United States to eliminate the Taliban and establish a post-Taliban political order in Afghanistan.\r\n\r\nIn December 2001, **the US asked**  Tehran to keep Gulbuddin Hekmatyar, the brutal pro-Al Qaeda warlord, from returning to Afghanistan to lead jihadist resistance there. **Iran agreed** so long as the Bush administration did not criticize it for harboring terrorists. But, in his January 2002 State of the Union address, President Bush did just that in labeling Iran part of the “axis of evil.” Unsurprisingly, Mr. Hekmatyar managed to leave Iran in short order after the speech. **After hearing this speech the Iranians threw him out as quickly as possible because** the Islamic Republic could not be seen to be harboring terrorists.\r\n\r\n**Richard Armitage accused the Iranians of further harboring al-quaeda terrorists. Iran identified a group of less than 100 individuals operating in the NE region along the border with Pakistan operating in the drug smuggling operations of that region. They captured all of them and offered the complete list to the UN in 2002 and then offered to turn them over to the US in exchange for the Iraqi MEK terrorist group captured by the US that threatened Iran's governing powers. The US refused this exchange, and so Iran deported the detainees to the custody of their home governments of Saudi Arabia and post-Taliban Afghanistan.** This demonstrated to Afghan warlords that they could not play America and Iran off one another and prompted Tehran to deport hundreds of suspected Al Qaeda and Taliban operatives who had fled Afghanistan.\r\n\r\nThose who argue that Iran did not cause Iraq’s problems and therefore can be of only limited help in dealing with Iraq’s current instability must also acknowledge that Iran did not “cause” Afghanistan’s deterioration into a terrorist-harboring failed state. But, when America and Iran worked together, Afghanistan was much more stable than it is today, Al Qaeda was on the run, the Islamic Republic’s Hezbollah protégé was comparatively restrained, and Tehran was not spinning centrifuges. Still, the Bush administration conveyed no interest in building on these positive trends.\r\n\r\n**After the May 12,2003 Saudi Arabian bombing by an internal Iranian group, all 3500 \"members\" of the organization, including many family and extended members not directly involved in the action were seized by the Iranians and offered to the US as proffer for the Iraqi MEK. Further a proposal for negotiations aimed at resolving all outstanding bilateral differences between Tehran and Washington, including the nuclear issue was offered directly to the President by Swiss diplomat. The proposal was described as having been endorsed by all the major power centers in Iran, including the supreme leader, Ayatollah Ali Khamenei. The US reaction was to not even acknowledge the document and accuse the Swiss diplomat of being \"out of line.\"**\r\n\r\nFrom an Iranian perspective, this record shows that Washington will take what it can get from talking to Iran on specific issues but is not prepared for real rapprochement. Yet American proponents of limited engagement anticipate that Tehran will play this fruitless game once more — even after numerous statements by senior administration figures targeting the Islamic Republic for prospective “regime change” and by President Bush himself that attacking Iran’s nuclear and national security infrastructure is “on the table.”\r\n\r\nOur experience dealing with **the highest ranking and most serious and important** Iranian diplomats over Afghanistan and in more recent private conversations in Europe and elsewhere convince us that Iran will not go down such a dead-end road again. Iran will not help the United States in Iraq because it wants to avoid chaos there; Tehran is well positioned to defend its interests in Iraq unilaterally as America flounders. Similarly, Iran will not accept strategically meaningful limits on its nuclear capabilities for a package of economic and technological goodies.\r\n\r\nIran will only cooperate with the United States, whether in Iraq or on the nuclear issue, as part of a broader rapprochement addressing its core security concerns. This requires extension of a United States security guarantee — effectively, an American commitment not to use force to change the borders or form of government of the Islamic Republic — bolstered by the prospect of lifting United States unilateral sanctions and normalizing bilateral relations. This is something no United States administration has ever offered, and that the Bush administration has explicitly refused to consider.\r\n\r\nIndeed, no administration would be able to provide a security guarantee unless United States concerns about Iran’s nuclear activities, regional role and support for terrorist organizations were definitively addressed. That is why, at this juncture, resolving any of the significant bilateral differences between the United States and Iran inevitably requires resolving all of them. Implementing the reciprocal commitments entailed in a “grand bargain” would almost certainly play out over time and in phases, but all of the commitments would be agreed up front as a package, so that both sides would know what they were getting.\r\n\r\nUnfortunately, the window for pursuing a comprehensive settlement with Iran will not be open indefinitely. The Iranian leadership is more radicalized today, with Mahmoud Ahmadinejad as president, than it was three years ago, and could become more radicalized in the future, depending on who ultimately succeeds Ayatollah Ali Khamenei as supreme leader. If President Bush does not move decisively toward strategic engagement with Tehran during his remaining two years in office, his successor will not have the same opportunities that he will have so blithely squandered.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vtfa","subreddit":"reddit.com","score":1,"ups":1,"created_utc":1166851082,"author_flair_css_class":null,"timestamp_epoch":1566236775,"message_id":"46852-1aaa079b-7663-4d7d-9f02-73e28eda0715-1566236775"}