{"gilded":0,"retrieved_on":1473809247,"distinguished":null,"author_flair_text":null,"author":"jerf","id":"cvtml","edited":false,"parent_id":"t1_cvt7k","subreddit":"programming","author_flair_css_class":null,"created_utc":1166855093,"score":5,"ups":5,"body":"I don't have enough experience with those languages to be able to judge. (I need real projects to learn a language with and so far there has been no meeting of project I need done with the necessary libraries to do them and the time to do it.) I was explicitly talking about what you might call \"traditional static typing\"... and if you're dismissing that as too primitive to bother with, we're in basic agreement.\r\n\r\nI still have to admit to some skepticism, though. I only rarely make typing errors in real code anymore. Not 0, but certainly not very often. My bugs are logic and other such things. There are some things the more exotic type inference things could catch, but they'd have to be pretty sophisticated to catch those bugs without firing what I would consider to be false positives every which way.\r\n\r\nI think some of it is that to me, a typing error is neither more nor less important than any other kind of error. I think if you lack that seemingly instinctive repulsion about type errors, which I think is instilled very early in most educations (which I also received, I've just chosen to take an increasingly ruthless approach about costs/benefits analysis), that you'll find static typing has a somewhat higher bar to meet than you might expect. I fully expect a type system to meet it someday, but I would imagine it's probably a ways away for me yet. In general, jumping through hoops once to fix a type error outweighs several bugs, if you assume decent testing methodology (which in my personal analysis I do). (And it seems to me that some of those new typing systems are much nicer in the general case but when they break will truly kick your ass when you try to fix the problem. I hope I'm wrong and welcome people's experiences. Maybe it'd make a good reddit poll: \"Have you used a more sophisticated type system on a decent-sized project? How did it go? \")","controversiality":0,"link_id":"t3_vr55","stickied":false,"subreddit_id":"t5_2fwo","timestamp_epoch":1566236775,"message_id":"46913-e1682eab-ec94-4a94-a7e8-98a873e8394b-1566236775"}