{"subreddit":"reddit.com","score":2,"ups":2,"created_utc":1166864828,"author_flair_css_class":null,"body":"bogdon6,\r\n\r\nOkay you need to stop. Just stop already. Are we now measuring civil rights and privacy law based on who has died because of the legislation? It doesn't bother you at all that there is an entirely parallel justice system set up by the Patriot Act and cemented by the Military Commissions Act, controlled solely by the executive, in which anyone citizen or non-citizen can be judged an enemy combatant solely at the discretion of the executive, stripped of all rights, detained indefinitely without charges, and denied the right of judicial review? I know many of the truest libertarians do not forgive Lincoln for attempting this during the civil war, to this day. Yet libertarian you is gonna give the current administration a pass on that huh?\r\n\r\nI don't know what kind of libertarian you think you are, but I know that anyone who can dismiss the above as a lesser evil to the current fiasco that is US drug policy is not remotely self consistent.\r\n\r\nAs for criticisms of Glenn Reynolds the site linked above is just one of many highlighting his near constant contradictions. You didn't read it obviously. \r\n\r\nWe can devote a whole separate thread documenting the vast failings of the Glenn Reynolds class pundits, their hypocrisies, and their outright dishonesties. Reynolds is one of the most derided pundits on the web, and he has only himself to blame for it. \r\n\r\nAnyone who has a political platform and is not involved in politics is wasting time, especially in this era of the internet connected voting base. As for sugar-plum fantasies, if Webb and Obama do not deliver, they will be out of office for it. 2006 has shown there is a growing internet connected, very details oriented, involved populace demanding involvement in the political process. That was the point of both video clips I linked to above. If you had watched them you would know that. Reform starts from engagement not disengagement. This, ironically, is also the crux of the current conflict over our disastrous foreign policy, as the recent NYT Iran Op-ed has shown us.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vrfp","gilded":0,"distinguished":null,"retrieved_on":1473809253,"author":"smacfarl","author_flair_text":null,"edited":false,"id":"cvtwj","parent_id":"t1_cvtox","timestamp_epoch":1566236775,"message_id":"47055-9b7fe36b-1b18-475c-9e53-a624901ab8ca-1566236775"}