{"ups":1,"score":1,"author_flair_css_class":null,"created_utc":1166864898,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vpsx","stickied":false,"controversiality":0,"body":"I don't think the statement \"There is no equivalent word in English, IMHO this is why the German term is so well known.\" is a generalisation.\r\n\r\nIt's a fairly specific statement, which is either in error or not. The irony of your attempting to be so pedantic as to be arguably wrong about the existence of an archaic word in a post which misuses the word \"generalization\" is palpable.\r\n\r\n\r\nEnglish often assimilates words from other languages, schadenfreude has more right to be an English word than \"epicaricacy\". Where do you draw your particular linguistic line? Latin-derived terms only? The vernacular of the inhabitants of London circa 1750? Do you permit \"de facto\" as an English phrase? What about those derived from Old Norse or Norman French? Does the spelling of something have to change from its original form in another language to look and feel properly \"English\" to you? How about composite words?\r\n\r\n\r\nYou said: \"The fact that the word got used in 1727 is fine with me. They spoke English.\" and to me this speaks volumes. \r\n\r\nDo you idealise the linguistic make-up of the English language at a certain time and place in the same way you idealise the genetic make-up at a certain time and place? (Whilst simultaneously denigrating the current linguistic and genetic makeup as degenerate?). Fascinating.\r\n\r\nEngland has always been a melting pot. Waves of invaders and immigrants have always swept through the country. And each generation's bigots will have hated them for being different.\r\n\r\nIt does appear that the bigot-count is going down a bit over the last few decades and I don't welcome your attempts to increase it.","distinguished":null,"retrieved_on":1473809253,"gilded":0,"edited":false,"parent_id":"t1_cvrx6","id":"cvtwl","author":"jbert","author_flair_text":null,"timestamp_epoch":1566236775,"message_id":"47056-b46cbcf8-1855-4bdc-8a22-89dcff0215ff-1566236775"}