{"edited":false,"id":"cvufs","parent_id":"t3_vtxk","author_flair_text":null,"author":"hopeseekr","retrieved_on":1473809262,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_vtxk","subreddit_id":"t5_6","controversiality":0,"body":"&gt;\"Damage, including DNA damage, drives the functional decline we all experience as we age,\" she said. \"But how we respond to that damage is determined genetically, in particular by genes that regulate growth hormone and insulin.\"\r\n\r\nGrowth Hormone's connection to aging was *totally* unknown until ***I*** started rapidly aging after being weened off artifical HGH in 1996 at age 14.  I am now 25 with the body of a 30 year old, but! I haven't aged in a year since receiving artificial growth hormones again, after a 10 year hiatus.  I was aging at an ever-increasing rate that approached ~1.8 times the chronological rate, but that stopped happening suddenly after 1 year 6 months on a daily regime of artificial HGH at 2 CCs.\r\n\r\nYou should go back and read my 2004 article [**Thank *me* on your 150th birthday**](http://www.xmule.ws/phpnuke/modules.php?name=News&amp;file=article&amp;sid=99).  don't worry; i'll bring this tech which is priced out of every one's hands ($50/gallon to farmers, $65,000 / year for me) when I revolutionize the world in the near future (target: 2013).\r\n--------\r\nI know my upfront, unapologetic, freedom-fighting stance is viewed by the more conservative and angry as being unduly arrogant, but you must realize we are at a stage in our collective evolution wherein a small portion of the human population *really are* mutants (of which, I am one):  See [**Dabrowkski's Overexcitabilities or SuperSensitives**](http://www.stephanietolan.com/dabrowskis.htm).\r\n\r\nIF I receive significantly and sometimes dramatically more sensational input than you do, since that is our sole connection to the outside world, it can be argued that I have a firmer grasp on reality; for instance:  I was always puzzled as a child when I studied the output of prisms; and other things that no one else could (such as auras/bioenergy fields).  I now realize (and have had officially verified in scientific tests) that I see a bit of the ultraviolet spectrum and little of the IR as well.","created_utc":1166883736,"author_flair_css_class":null,"score":-8,"ups":-8,"subreddit":"reddit.com","timestamp_epoch":1566236775,"message_id":"47248-4d6d07dc-a09d-4fd6-a15c-8fd1aaac3537-1566236775"}