{"gilded":0,"retrieved_on":1473809267,"distinguished":null,"author_flair_text":null,"author":"[deleted]","edited":false,"id":"cvup8","parent_id":"t1_cvu1g","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166891577,"score":-3,"ups":-3,"body":"&gt; I'd simply resent some scum who has no claim on me having a back door to my cash. *My* computer, *my* modem, *my* sound card. I owe you nothing!\r\n\r\nYes! Unless you're listening to *my* content! Nobody's got a back door on anyone's cash. You're free to do with your computer, modem, and sound card as you wish! Feel free to record something and get $.001/min for your content as well!\r\n\r\n&gt;Not only would it play havoc with my budgeting (because how could I possibly anticipate how much it might sum up to?)\r\n\r\nIt wouldn't matter! Even if you watched/listened to content 8 hours a day, that would only add up to $15/mo. If your budget is so tight that an additional +/- from there is going to break you, you probably shouldn't be spending 8hrs/day watching media!\r\n\r\n&gt;Also, since it's a fixed compulsory price paid by law (AKA \"a tax\"), it would not be subject to market forces but political ones. Competition would be irrelevant.\r\n\r\nNewsflash, competition is already irrelevant! If Korn (or their record company) decide they are going to charge $20 for their album, there's not a competing company that can produce a Korn album for less. Copyrights are monopolies.\r\n\r\n&gt;Also, since it's a fixed compulsory price paid by law (AKA \"a tax\"), it would not be subject to market forces but political ones. There would always be industry pressure to raise the price, and politicians would cave. It certainly wouldn't stay $.001 forever\r\n\r\nBullshit. For one thing, it doesn't have to be government-controlled. Record labels could band together and offer their own music site that worked this way, or whatever. But even if it were run by the government (which *would* be good in the sense that all content could be in one place), the rate could be locked to inflation by law or something.\r\n\r\nThe point is that we have libraries because we think it benefits people to have free access to information. Our copyright system, and the need for a system of compensating the artists, is what is preventing us from having a complete digital library available to us. I like the illegal downloads not just because they're free, but because I can find just about anything I want and get it at home without any hassle. I don't want to pay $.99 and \"own\" a track (which I *wouldn't* own anyway) because I want the freedom of being able to listen to whatever I want whenever I want without cost limiting that ability. Only having a system with negligible cost to me, but where the cumulative effect of millions watching means a decent amount of money for the artist, can do that.","controversiality":0,"link_id":"t3_vs61","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236775,"message_id":"47380-85db2d17-6b25-4788-bc2e-ce642fed6a21-1566236775"}