{"gilded":0,"retrieved_on":1473809271,"distinguished":null,"author_flair_text":null,"author":"[deleted]","id":"cvuww","edited":false,"parent_id":"t1_cvtyu","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166896913,"score":0,"ups":0,"body":"Oh, no.  I don't view anyone as an authority.  I don't believe in \"legitimate sources\" at all.  I try to judge any report on its own credibility.  I was merely agreeing with the diarists.\r\n\r\nDid you catch the news about Iran and [Khobar Towers](http://en.wikipedia.org/wiki/Khobar_Towers_bombing)?  Or about the Jewish community centre in [Buenos Aires](http://news.bbc.co.uk/2/hi/americas/6085768.stm).  Do you think the Bushocrats made these things up, too?\r\n\r\nSo what is in the redacted information?  (1) the Iranian security forces actually condescended to enter a meeting room with Americans, presumably without chanting \"Death to America.\"  (2) the Iranian security forces prudently suppressed Al-Qaeda when they saw the US in a very dangerous and pissy mood.\r\n\r\nAnd this is supposed to be evidence of a great untapped reservoir of love.\r\n\r\nDo you watch the Sopranos?  Is any of this, in any way, inconsistent with the hypothesis that the various factions in the Iranian and Syrian government work and think much like Tony Soprano and Johnny Sack?  That they are simply large, well-managed criminal organizations looking out for their own interests?  I would argue that even the US government is easiest to explain with this metaphor.  In fact, I believe that it is the converse of this metaphor that needs to be stated as a hypothesis and backed with evidence.  Why would you think that deeply nice people would be in control of any of this stuff?\r\n\r\nThe problem with this whole brand of State Department diplomacy (disclaimer: my father worked for State for most of his career) is that it assumes conditions that applied when it was invented, but no longer exist.  Diplomacy as we know it now dates to the 19th century, a time of personal rule when honor and personal trustworthiness were critical to monarchs.  As a result, commitments could be made and relied on.  But neither strongman societies like Iran or Syria, nor the slightly more genteel oligarchic democracies of US and Europe, have ever been known for maintaining their commitments when they had a reason to break them.  This trend is very old - there's a reason for the phrase \"perfidious Albion.\"\r\n\r\nIn other words, what could Iran and Syria possibly offer the US in diplomacy?  What, are they going to cede sections of territory, or something?  Will they give us, say, Khuzestan?  The hell they will.  All they have to offer us is promises.  And we have no reason to think that they will keep their promises.  They certainly don't have much reason to hope that we'll keep ours.\r\n\r\nThat's why I think the whole damn thing is a waste of newsprint.  Print some pictures of topless women, or something.","controversiality":0,"link_id":"t3_vq1i","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236775,"message_id":"47502-17d5ed5b-fd75-49c2-a5bd-cc49c16c7499-1566236775"}