{"created_utc":1166897133,"author_flair_css_class":null,"ups":18,"score":18,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vuk7","subreddit_id":"t5_6","controversiality":0,"body":"*These are people with low incomes who only have two options; Pay the bills by using high interest payday loan places or don't pay the bills and face huge fees.*\r\n\r\nAnd they chose the option of the payday loan, meaning that they considered it to be *better* than the alternative. Now the solution, you say, is to legally prohibit them from choosing the better of two options? I notice you don't give credit to the payday lenders for saving people money in the case that it does turn out to be a better option than not paying the bills and facing late fees - you can't have it both ways. Not to mention the fact that I can't possibly be the only one on the planet who wonders \"what on earth did these people do before paycheck loan companies came about?\"\r\n\r\n*For those of us irresponsible middle class people, we can repay the payday loans with no problem. However the people discussed in this article cannot, hence having to pay almost as much in interest as they borrowed in the first place.*\r\n\r\nHere's a science project: go to one of the low-income neighborhoods you describe and offer to loan people $1 to be paid back with $1,000 interest two weeks from now and see how many takers you get. My guess is \"none.\" How can this be, if these people are so ignorant and completely clueless that they can't make their own decisions?? Does the payday loan company have some super-secret mojo that allows them to hypnotize poor people into accepting a loan where you cannot? The only hypothesis I can think of that would explain why a poor person would take a payday loan at 25% over two weeks yet not take your 1,000% interest loan over two weeks is that they make decisions based on their self-interest and preference. Many will make good decisions that get them out of a jam, and many will make poor decisions that put them *into* one - nevertheless, they certainly aren't clueless automatons being preyed upon by payday loan companies, because in our little thought experiment we looked at a scenario where someone was explicitly trying to prey upon them and failed completely.\r\n\r\n*Thus, in areas where the average income is on the lower side it is almost criminal that these places take advantage of people.*\r\n\r\nSo therefore they would be better off without the option of this loan? Look, the money is either for an absolute emergency scenario or it isn't - they either need it or they don't. If it is for an absolute emergency scenario, how exactly is the person somehow better off not having the option? If you need insulin for your baby girl and have no other recourse than taking a payday loan, yes you have to pay 25% over two weeks, but YOUR DAUGHTER GETS INSULIN. How is that person better off not having the option of getting the money (and therefore, the medicine) at all?\r\n\r\n*When banks, such as the one mentioned in the article, step up and offer better micro-loan solutions, then you can harass the stupid people who still take payday loans.*\r\n\r\nThey are - that's free-market competition at work. The Credit Union has decided to take on such unbelievably high-risk loans at almost *half* the interest rate of the big franchise locations. \r\n\r\nIn addition, never did I harass people who take payday loans - I believe in a free society, which means that I could not care less what they do with their money; it's their choice. What I *do* care about is when they evade responsibility for having made said choice, because then that limits your and my options should we need an emergency paycheck loan or some such.\r\n\r\nAny scene where a father tells his kids \"sorry, there isn't going to be a christmas this year, but you know we still love you,\" rips the heart out of anyone who has a pulse. But  anyone who looks at the facts realizes that it's not the Big Evil Payday Loan Corporation that stole christmas from that man's children - he stole it from them himself, and it is no less a tragedy because of that.","retrieved_on":1473809271,"distinguished":null,"gilded":0,"id":"cvuxd","edited":false,"parent_id":"t1_cvuvi","author_flair_text":null,"author":"anusmccolon","timestamp_epoch":1566236775,"message_id":"47512-2636aa80-1fe8-4f2c-b589-0ae0b19a0c70-1566236775"}