{"edited":false,"id":"cvv09","parent_id":"t1_cvu9n","author":"lemmikins","author_flair_text":null,"distinguished":null,"retrieved_on":1473809272,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vsz3","stickied":false,"controversiality":0,"body":"&gt; That doesn't prove that people evolved from apes, does it. \r\n\r\nWe have large amounts of evidence which indicate precisely that.  For example, there are no human fossils older than a certain age, but there are fossils that are very close.  Going back further, there are fossils that are close to those but less close to humans.  With genetic analysis we can also confirm where we are close to other apes and where we differ.  We can also establish that all humans were in Africa 50,000 to 60,000 years ago.\r\n\r\nSo not only do we share a common ancestor with modern apes, but you, I, and everyone else have great, great, great... grandparents who were African.  All of us were black!\r\n\r\nSo it depends on what you mean by \"prove\".  Certainly it is proven to all biologists and scientists who have studied it.\r\n\r\nIf you mean \"convince me that my religious convictions are wrong\", nothing can do that except your own choices.  If you decide to believe something no matter what, your beliefs may be unshakeable.\r\n\r\n&gt; That is *not* a fact.\r\n\r\nActually whether something is a fact or not is independent of what we believe about it.  It is kind of like in a court of law where you may or may not believe testimony, but that does not make it true or untrue.\r\n\r\nIt's possible that our interpretations of evidence are mistaken, but we could be wrong and STILL have evolved from apes, as you put it.  Just like a detective might be wrong about how a killer committed the act, but still be right about the killer's identity.  We may think it was the lead pipe, but Colonel Mustard doesn't get to proclaim innocence then because he actually used the candlestick!\r\n\r\nThe claims of evolution are not made frivolously.  There is overwhelming evidence for it.\r\n\r\nThere are, of course, a few assumptions that it makes, such as fossils were not just put there by God to test our faith; that we weren't created this very instant with all of our memories intact; and other untestable magic contrivances, any of which may be true.  Gravity may be caused by magic elves in the center of the Earth, or the Earth may be flat but God changes all the satellite pictures so it looks spherical to punish us for using too much technology.\r\n\r\nIf you discount the magic-wand theories and go by what we have evidence for, then evolution by means of natural selection is proven by overwhelming evidence.  My nigga.\r\n","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166898695,"subreddit":"reddit.com","timestamp_epoch":1566236775,"message_id":"47550-37cae2ed-a372-45f0-9032-0e0a8f9408b1-1566236775"}