{"author_flair_text":null,"author":"Skepsis","edited":false,"id":"cvv1y","parent_id":"t3_tif6","gilded":0,"retrieved_on":1473809274,"distinguished":null,"body":"(Apologies for lack of spelling)\r\nAbove all, I need! in the near future a language that has a simple and complex example for EVERY funtion/method so I can get it into my thick head how to use the thing. I have spent far too long tracking down how to do things. \r\n\r\nAn inteligent debugger, if thats possible, that can point to the REAL place of potential problems rather than just the place that the error occurred. So much time, in debugging, seems to be taken up in identifying the place of the real problem. How about a history of variable values and a ref to the line of code that changed the variable then looking through the history of the variables might identify the error quicker.\r\n\r\nA simple structure and a standard structure with as little clutter as possible, yes I like Python.\r\n\r\nI want to query the language on possible solutions to a problem at some level or other but that probably harps back to the huge help\r\n\r\nI guess I want a language that lets you concentrate on WHAT you want to do rather than HOW to program that.\r\n\r\nI want code that is instantly understandable and am prepared to sacrifice some 'compactness' because most of a programming effort is in maintaining that code, tweeking it to work etc etc.\r\n\r\nAutomatic import of function libraries rather than having to load them, probabily a waste but hey this is the 'future'\r\n\r\nA reduced function set that is over loaded and knows what you are really asking of it with only a few clues, maybe by looking ahead in the code to see that you might want to get from the function.\r\n\r\nA compiler/interperater pass that looks at your code and suggests a better way of achieving parts of it.\r\n\r\nFinally a natural language interface that lets you 'describe' what you want in simple statements rather than the pigeon english of code today\r\n\r\nOh, ye and an interface/IDE that can accepts voice input and output.\r\n\r\nWhich brings me to the other side of a computer language the IDE. Why dont IDE's offer you a selection of the variables in the function/procedure rather than making you write then out time and again with possible transcription errors ( I have not used many IDE's ). They do it for functions/methods and modules.\r\n\r\nMuch more suficicated code completion that knows if the method structure is complete on the lines below rather than dumbly putting the 'End Function'or 'end if' in again.","controversiality":0,"link_id":"t3_tif6","stickied":false,"subreddit_id":"t5_2fwo","subreddit":"programming","author_flair_css_class":null,"created_utc":1166899808,"score":1,"ups":1,"timestamp_epoch":1566236775,"message_id":"47580-771bede9-e12e-4c7b-9213-4e81511b0aa2-1566236775"}