{"ups":0,"score":0,"author_flair_css_class":null,"created_utc":1166903455,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_vk0o","stickied":false,"controversiality":0,"body":"Ok, you can't empathize with other people. That a problem, but not mine of course. \r\n\r\nOTOH is it not smart and not even cool to ignore experimental evidence. So I hope that you accept this experimental evidence and are only attacking the interpretation of those evidence. For example even in school you can show that, for example, 'Uncertainty' is a fact.\r\n\r\nBut the \"Uncertainty Principle\" is also quite simple and follows directly from the wave nature of the world. Everybody who can understand Fourier transformation can understand that the time and frequency localization of a wave is subject to certain constraints. And if you not accept the wave nature of the world then you have a certain problem, because there is no way to explain for example electron scattering without taking the wave nature of the electron into account.\r\n\r\nBut non-determinism is another thing and until Aspects experiment lots of physicists don't really believed in it. But I think that even Aspects experiment is wrongly interpreted and doesn't really rule out determinism:\r\n\r\nIn fact the QM is a fully deterministic theory - at least as long as you only work on the level of wave functions. Only the measurement process can create something like 'indeterminism', but because there is still no real accepted detailed model of the measurement process itself (which I find really annoying myself) I'm quite suspicious here.\r\n\r\nSo how can an otherwise fully deterministic theory turn out indeterministic suddenly by looking at a weakly defined process nobody seems to understand? THAT is the big gapping hole in QM. And it's this hole which leads to all those nonsense like the Copenhagen or the many-worlds interpretation. IMO is QM in fact deterministic and the reason for the probabilistic nature of measurement (which also is an experimental fact) is a result of the deterministic but nonetheless highly complex (and thus indeterminable) state of the measurement apparatus.\r\n\r\nBUT: It don't changes anything of the validity of the QM as a very good working model of the world. Its supported by heaps of evidence which is hard to rule out without making oneself a laughing stock.\r\n","distinguished":null,"retrieved_on":1473809277,"gilded":0,"edited":false,"id":"cvv7k","parent_id":"t1_cvuwp","author":"kawa","author_flair_text":null,"timestamp_epoch":1566236775,"message_id":"47668-c6235058-adc6-428c-9ec0-28b2b1880930-1566236775"}