{"author_flair_text":null,"author":"anusmccolon","parent_id":"t1_cvv7d","edited":false,"id":"cvvb8","gilded":0,"retrieved_on":1473809278,"distinguished":null,"body":"*kind of hard to do that when you don't have the internet*\r\n\r\nInternet-enabled terminals are available at nearly every public library in the country. A library card is available for free simply by producing a current phone or utility bill. Not the easiest thing in the world to do if you had two jobs and three kids, but it is far from impossible. You can also ask a banker or the people you work with \"is this a good deal or not?\"\r\n\r\n*(and of course, part of the abuse was the man not allowing you to use protection...)*\r\n\r\nOooook. That was pretty random. Moving on...\r\n\r\n*And many aren't of average IQ... They were malnourished (yes, Alex, even in America!) as children, went to gang-infested schools where the focus was survival.*\r\n\r\nWait a minute - after getting trained in a school where \"the focus was survival,\" these people come out the other end not knowing that the huge increase in paycheck advance stores means they're probably not handing out money at a loss? That was one crummy survival course.\r\n\r\nAt any rate, your argument is that people who have below-average IQs because of malnourishment in gang-ridden schools (or people with below-average IQs *and* malnourishment) should not be allowed to make financial decisions like this. Fine - that's your opinion. But you're not going to squirm out of the *implications* of that opinion - namely that people of below-average IQ will not be allowed to drink alcohol, smoke cigarettes, eat more than a moderate amount of red meat, or possibly watch television (\"you should be working more!\"). You are certainly entitled to your opinion, but I would ask of you two things: first, that you show the courage of your convictions and go door-to-door in these malnourished low-IQ neighborhoods and tell them that you are taking over the management of their lives because they are incapable of making intelligent decisions; and second, that I be allowed to watch while you do this, because I have a feeling it is going to be priceless.\r\n\r\nAs far as the specific decision itself (whether or not to accept the 25% over two weeks), see the post in this topic where I talk about offering these poor people money at 1,000% interest over two weeks - if it is true that these people are completely helpless and being preyed upon and taken advantage of, they'd have no choice but to take that unbelievably high rate of interest. That is absurd, therefore they clearly do have a choice and choose in their self-interest. The solution does not seem to me to be to eliminate this option so that a poor person in a true emergency cannot get this money because you oh-so-thoughtfully prohibited it \"for his own good.\"\r\n\r\n*And those running payday loans know this. They know they can make a tremendous profit.*\r\n\r\nMicrosoft knows that they can charge $120 for Windows. They know they can make a tremendous profit.\r\n\r\nBanks know that they can lend money at a high rate of interest but borrow money at a very low rate of interest. They know they can make a tremendous profit.\r\n\r\nWhat's the point? It's a business like any other - the only reason people get into it in the first place is *because* they can make a profit. If you don't think so, please open up a chain of 0%-interest paycheck loan stores. And please allow me to watch this too.\r\n\r\n*(Though, this profit has gone down to market average with the glut that has come - however, none of them have competed on interest rate!)*\r\n\r\nYes, they do compete on interest rate. Unless you think they all get together on Christmas when nobody is watching and have a meeting where they twitch their moustaches and plan how to screw the public. The article link above describes a credit union that lends paycheck advances at 15% or so, as opposed to the 20-25% of the storefront companies - do you think they do that because they're just swell folks?\r\n\r\n*On the other side, those who take these loans are credit risks themselves. However, to just say they should learn basic finance - that's a bit too simplistic.*\r\n\r\nI agree that not everybody should be expected to take a course in basic finance. However, if you print the interest rate in huge font and put it up on posters all over the store, and put on the forms of the agreement exactly how much money you're getting now for exactly how much you're agreeing to pay back in return in two weeks, then I'm sorry - no amount of malnutrition and low-IQ explains that. It's pure irresponsibility.\r\n\r\nI am really, really tired of explaining this. It's a very simple thing to understand, and it's not that hard to figure out yourself with a bit of thought.\r\n\r\n\r\n","controversiality":0,"stickied":false,"link_id":"t3_vuk7","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166906867,"author_flair_css_class":null,"score":6,"ups":6,"timestamp_epoch":1566236775,"message_id":"47721-51c7b258-11a2-42c7-a977-5ebbc829cd82-1566236775"}