{"body":"Some people prefer to pay per-use rather than up front - it's why people rent flats, hire cars, have pay-as-you-go phone tariffs etc.\r\n\r\nMy first impression of you chair analogy was that it was irrelevant - no one is suggesting renting out chairs.  But if you insist:\r\n\r\nSuppose an office chair costs $200, and is expected to last 5 years.  If an average chair is sat on for 8 hours per day, this works out at about *1c per hour*.  If the logging and payment is all done behind the scenes, is anyone really going to care about sitting or not sitting?  Are you going to think \"I'd best stand for the next hour, to save that cent\"?  No, you'll just get ignore it and get on with your life.\r\n\r\nSo why (other than the obvious technological difficulties) does this business model not work for chairs?\r\n\r\nSince there is no cost in actually owning the chair, it means that consumers can have as many chairs as they like, since they can only use one at a time.  For some consumers (the ones with big houses, for example) this is an advantage, and for others (those with small houses, for example) not.\r\n\r\nBut, whilst the consumer with lots of chairs doesn't have to pay any extra, the producer obviously does.  So the price of chair-rental goes up to reflect the fact that most of the chair-rental buyers are actually getting many chairs.  This price increase makes it even less attractive for those with small houses.  So the average 'chairs per customer' goes up again, and the producer has to push up the prices again.  And so on and so forth, until the company runs out of customers.\r\n\r\nNotice that this happens because the cost for the producer increases (roughly) proportionally to the number of chairs,  whereas the cost to the customer is fixed.  This is why the business model doesn't work.\r\n\r\nBut the same is not true for music.  The cost for a record company to distribute 10,000 digital copies of some music is pretty much the same as the cost of distributing one copy.  Because of this, the feedback loop of consumers gaming the system and driving prices continually higher does not occur (at least, not in this form).","controversiality":0,"stickied":false,"link_id":"t3_vs61","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166910011,"author_flair_css_class":null,"score":3,"ups":3,"author_flair_text":null,"author":"acrophobia","parent_id":"t1_cvu1b","edited":false,"id":"cvvgc","gilded":0,"retrieved_on":1473809281,"distinguished":null,"timestamp_epoch":1566236775,"message_id":"47776-5c32cd4d-4409-4b23-b45e-ff5af2cac1bc-1566236775"}