{"subreddit_id":"t5_6","link_id":"t3_vtxd","stickied":false,"controversiality":0,"body":"***!=*** means \"not equals\"..So my prev. comment is saying (non-religious) NOT EQUALS (atheist)..\r\n\r\n(That was my bad. I spend too much time among Computer Scientists...No reason for someone who doesn't program to know that notation..)\r\n\r\n&gt; I neither believe in the existance or the non-existance of god(s).\r\n\r\nThat makes you [an agnostic..(wikipedia link)](http://en.wikipedia.org/wiki/Agnostic)\r\n\r\n&gt; I'm not going to quit religion just to have Dawkins or anyone else telling me I should sign up to be an atheist and believe what they believe.\r\n\r\nI don't want to argue with you on X'mas weekend.. When you have time see some of these following interviews/reports on Prof. Dawkins.(links to come below) He is usually not as militant as people think.. Also, what Prof. Dawkins and most other (sane) atheist hope for is that other sane people (like you) not believe in dogma which people have traditionally brainwashed their kids for thousands of years..\r\n\r\nEvolution is not Dawkins' Theory and there are several Theist Scientists who do understand and support it. And it is substantiated by a lot of evidence and even observed on a smaller scale.. Dawkins extends this theory to indicate that even if there is a \"superior being/designer/intelligence\" who created life on earth, logic/rationality/science suggests that that being can not just appear out of nowhere and explaining that \"god\" becomes nearly impossible, especially when there is no evidence that such a being even exists..\r\n\r\nProf. Dawkins is essentially an academic, and I can understand his frustration when faced with absolute bible-nuts. I hope people like you don't base your opinion on Prof. Dawkins' frustration at the simplistic debates (creationism, evolution etc..) which are just plain stupid..\r\n\r\nWhen in an slightly deeper interview which does not dwell on superficial issues (*\"soundbites\"*), agnostics and non-religious people have a much better opportunity to understand Prof. Dawkins' argument (and the atheist argument) in it's entirety ..\r\n\r\n(links to come as soon..searching on youtube and google)\r\n\r\nHappy Holidays..\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166922651,"subreddit":"reddit.com","id":"cvvwu","edited":false,"parent_id":"t1_cvvu7","author":"rocky_m","author_flair_text":null,"distinguished":null,"retrieved_on":1473809290,"gilded":0,"timestamp_epoch":1566236777,"message_id":"47990-3f33aefe-1ac6-445a-b2e7-fb3f691074b0-1566236777"}