{"edited":false,"id":"cvvys","parent_id":"t1_cvvkk","author":"anusmccolon","author_flair_text":null,"distinguished":null,"retrieved_on":1473809291,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vuk7","stickied":false,"controversiality":0,"body":"*Wow, you must be really bored home this Christmas weekend? :)*\r\n\r\nHey, I gotta do something to keep myself from roaming the streets to exploit poor people :).\r\n\r\n*Assuming people can seek out information just because it is out there is wrong.*\r\n\r\nI agree - that's why I would endorse slight regulations (eg huge posters in the store that say exactly what the interest rate is and over what term, as well as print exactly what the person will owe exactly when on the form they have to sign [again in big print]) to help a potential lender be more informed and to make a more informed decision. *But*, and here's the important point: once we've given the consumer the information to make an informed decision, the decision itself is out of our hands and we should not concern ourselves with it. It's essentially the social corollary to William James's maxim that you should gather all the information you can, make the best decision you can, then do it and *do not concern yourself with the outcome*. If you didn't chip in to the lottery pool at work because you think the lottery is a Stupidity Tax and your co-workers win the jackpot, you should congratulate them and never think twice about your decision not to buy the ticket. You made the right decision, and that's what matters; the particular outcome of that decision is out of your hands. Likewise, we should seek to arm consumers with information, but let them in the end decide for themselves.\r\n\r\n*Should rationale and intelligent behavior be assumed in an economic model or seen as benefits of solid governmental policies?*\r\n\r\nThis brings up a very good point, and I'm glad you mentioned it, because it's very confusing to most people. When economists say that consumers are \"rational\", they simply mean \"people try to maximize their utility\", or even more simply, \"people do things to get what they want.\" This, in 99.999% of all cases has absolutely nothing to do with decision tree theory or differential equations or supply and demand curves - it's as simple as seeing ACME foot powder in two stores right next to each other, one where it's $5.99 and one where it's $4.99, and deciding which one you want. Of course this isn't limited to monetary utility - for example, the $5.99 foot powder is in the store that I really like/where the hot chick works/that doesn't smell like cat piss/where they actually update the products on the shelves and the foot powder isn't 7 years old, whatever.\r\n\r\nIn the case of paycheck advance services, it's hard to imagine someone not realizing that they are going to have to pay that money back and then some - the question is, do they realize how much \"and then some\"? Printing the interest rate and the exact amount that will be due two weeks hence solves that problem. The rest of the problem lies in plain vanilla irresponsibility. I don't claim to make responsible decisions all the time myself, but I also do not seek sanctuary for the foreseeable consequences of my decisions.\r\n\r\nBased on a cursory googling for \"paycheck advance,\" the first two sites I looked at had ultra-simple tools or tables for figuring out how much you will owe in that period of time - they didn't even mention the interest rate (which is the only thing I would think would confuse a potential lender without a calculator on hand), they both just said \"if you borrow $100 for a period of two weeks, the interest we will charge is $18.62 and you will owe $118.62 total at the end of the two weeks.\" Not to mention that I am almost certain people who work in that industry are trying to cover their asses in every conceivable way possible to make it a fair, undisputed contract - they probably have plenty of people trying to duck out of payments already.\r\n\r\nSaying that these poor people are so ignorant and gullible that they can't understand the loan when put in simple terms like that seems absurd to me.","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1166925342,"subreddit":"reddit.com","timestamp_epoch":1566236777,"message_id":"48019-69faf6f0-678e-40cb-b987-e31b99bffd94-1566236777"}