{"body":"THE PASSION OF OUR LORD AND KING JESUS CHRIST...       CREATED BY RAZMIK TOROSSIAN\r\n\r\n\r\n     PLEASE ALSO VISIT MY OTHER WEB PAGES: \r\n\r\nwww.myspace.com/razmiktorossian \r\n\r\nwww.motionbox.com   NBC TV NETWORK  keyword: RAZMIK\r\n\r\nrazmiktorossian.livedigital.com \r\n\r\nwww.dailymotion.com/razmiktorossian   \r\n\r\nwww.ifilm.com          keywords: CHRIST+RAZMIK  \r\n\r\nuncutvideo.aol.com     keywords: CHRIST+RAZMIK\r\n\r\nwww.vmix.com           keywords: CHRIST+RAZMIK\r\n\r\nvideo.google.com       keywords: CHRIST+RAZMIK\r\n\r\nvideo.yahoo.com        keywords: CHRIST+RAZMIK\r\n\r\nwww.clipshack.com/razmiktorossian  \r\n\r\nrazmiktorossian.blogspot.com\r\n\r\nrazmiktorossian.livejournal.com\r\n\r\nCONTACT: RAZMIKTOROSSIAN@YAHOO.COM\r\n\r\n\r\n\r\nDescription of the video:\r\n\r\nANYONE WHO DOES EAT MY FLESH AND DRINK MY BLOOD HAS ETERNAL LIFE, AND I SHALL RAISE HIM UP ON THE LAST DAY.  FOR MY FLESH IS FOOD INDEED AND MY BLOOD IS DRINK INDEED.  THE MAN WHO EATS MY BODY AND DRINKS MY BLOOD LIVES IN ME AND I LIVE IN HIM.\r\n\r\nTHE FATHER LOVES ME, BECAUSE I LAY DOWN MY LIFE IN ORDER TO TAKE IT UP AGAIN. NO ONE TAKES IT FROM ME; I LAY IT DOWN OF MY OWN FREE WILL, AND AS I HAVE POWER TO LAY IT DOWN, SO I HAVE POWER TO TAKE IT UP AGAIN ....\r\n\r\nANYONE WHO HAS SEEN ME HAS SEEN THE FATHER ....  YOU MUST BELIEVE ME WHEN I SAY THAT I'M IN THE FATHER AND THE FATHER IS IN ME ....  I AND THE FATHER ARE ONE.\r\n\r\nWHOEVER HOLDS TO MY COMMANDMENTS AND KEEPS THEM IS THE ONE WHO LOVES ME; AND WHOEVER LOVES ME WILL BE LOVED BY MY FATHER, AND I SHALL LOVE HIM AND REVEAL MYSELF TO HIM.\r\n\r\nIN MY FATHER'S HOUSE THERE ARE MANY MANSIONS TO LIVE IN; OTHERWISE I WOULD HAVE TOLD YOU.  I'M GOING NOW TO PREPARE A PLACE FOR YOU, AND AFTER I HAVE GONE TO PREPARE YOU A PLACE, I SHALL RETURN TO TAKE YOU TO MYSELF, SO THAT YOU MAY BE WITH ME WHERE I AM.\r\n\r\nI AM THE WAY; AND THE TRUTH AND THE LIFE.  NO ONE CAN COME TO THE FATHER EXCEPT THROUGH ME.\r\n\r\nIF I HAD NOT COME, IF I HAD NOT SPOKEN TO THEM, THEY WOULD HAVE BEEN BLAMELESS; BUT AS IT IS THEY HAVE NO EXCUSE FOR THEIR SIN. \r\n\r\nANYONE WHO HATES ME HATES MY FATHER.  IF I HAD NOT PERFORMED SUCH WORKS AMONG THEM AS NO ONE ELSE HAS EVER DONE, THEY WOULD BE BLAMELESS; BUT AS IT IS, IN SPITE OF WHAT THEY HAVE SEEN, THEY HATE BOTH ME AND MY FATHER ....  WHOEVER IS NOT WITH ME IS AGAINST ME!\r\n\r\nALL AUTHORITY IN HEAVEN AND ON EARTH HAS BEEN GIVEN TO ME ....  GO OUT TO THE WHOLE WORLD, PROCLAIM THE GOSPEL TO ALL CREATION ....  BAPTISE THEM IN THE NAME OF THE FATHER AND OF THE SON AND OF THE HOLY SPIRIT ....  WHOEVER  BELIEVES AND IS BAPTISED WILL BE SAVED; WHOEVER DOES NOT BELIEVE WILL BE CONDEMNED ....  AND BEHOLD, I SHALL BE WITH YOU ALWAYS, EVEN UNTIL THE END OF THE WORLD.","controversiality":0,"stickied":false,"link_id":"t3_tfq6","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165144604,"author_flair_css_class":null,"score":0,"ups":0,"author_flair_text":null,"author":"RAZMIKTOROSSIAN","edited":false,"parent_id":"t3_tfq6","id":"ctfqq","gilded":0,"retrieved_on":1473807626,"distinguished":null,"timestamp_epoch":1566236759,"message_id":"4804-9d64c2d7-051d-4215-85b6-2faa07a4e8ee-1566236759"}