{"author_flair_text":null,"author":"stimcaps","parent_id":"t1_cvuo4","id":"cvw0v","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809293,"body":"At this festive season of the year, Mr. Scrooge,\" said the gentleman, taking up a pen, \"it is more than usually desirable that we should make some slight provision for the poor and destitute, who suffer greatly at the present time. Many thousands are in want of common necessaries; hundreds of thousands are in want of common comforts, sir.\"\r\n\r\n\"Are there no prisons?\" asked Scrooge.\r\n\r\n\"Plenty of prisons,\" said the gentleman, laying down the pen again.\r\n\r\n\"And the Union workhouses?\" demanded Scrooge. \"Are they still in operation?\"\r\n\r\n\"They are. Still,\" returned the gentleman, \"I wish I could say they were not.\"\r\n\r\n\"The Treadmill and the Poor Law are in full vigour, then?\" said Scrooge.\r\n\r\n\"Both very busy, sir.\"\r\n\r\n\"Oh! I was afraid, from what you said at first, that something had occurred to stop them in their useful course,\" said Scrooge. \"I'm very glad to hear it.\"\r\n\r\n\"Under the impression that they scarcely furnish Christian cheer of mind or body to the multitude,\" returned the gentleman, \"a few of us are endeavouring to raise a fund to buy the Poor some meat and drink, and means of warmth. We choose this time, because it is a time, of all others, when Want is keenly felt, and Abundance rejoices. What shall I put you down for?\"\r\n\r\n\"Nothing!\" replied Scrooge.\r\n\r\n\"You wish to be anonymous?\"\r\n\r\n\"I wish to be left alone,\" said Scrooge. \"Since you ask me what I wish, gentlemen, that is my answer. I don't make merry myself at Christmas, and I can't afford to make idle people merry. I help to support the establishments I have mentioned: they cost enough: and those who are badly off must go there.\"\r\n\r\n\"Many can't go there; and many would rather die.\"\r\n\r\n\"If they would rather die,\" said Scrooge, \"they had better do it, and decrease the surplus population. ... It's enough for a man to understand his own business, and not to interfere with other people's. Mine occupies me constantly. Good afternoon, gentlemen!\"\r\n\r\n— Charles Dickens, A Christmas Carol.\r\n\r\nTomorrow is Christmas Eve. \r\n\r\nThe fact that you could (I guess?) have read the article and still come away saying, \"The thing that REALLY pisses me off about this is the ones who get screwed are the majority,\" made me think of someone else who thought a lot like you at this time of year.\r\n\r\nI'm sure you consider it a compliment.\r\n","controversiality":1,"subreddit_id":"t5_6","link_id":"t3_vuk7","stickied":false,"subreddit":"reddit.com","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1166927445,"timestamp_epoch":1566236777,"message_id":"48048-67e7020a-976c-482e-adf7-9a13b9d9969a-1566236777"}