{"gilded":0,"retrieved_on":1473809294,"distinguished":null,"author_flair_text":null,"author":"rocky_m","edited":false,"id":"cvw3s","parent_id":"t1_cvvz2","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166931029,"score":1,"ups":1,"body":"&gt; It was this show that showed how idiotic some of the 'leading' atheists are.\r\n\r\nWell, they can't all be intelligent.. (Sam Harris tops my list of dangerously idiotic atheists..[here's why(link)](http://reddit.com/info/sd3z/comments/csdus))\r\n\r\nAnd to add to the problem, a growing number of atheist is what can be called \"knee-jerk/reactionary/reflexive atheist\"   [(link)](http://reddit.com/info/scgc/comments/csd2f)who after spending quite some time of their lives find out how silly and contradictory (and sometimes outright cruel) the Bible is, and embrassesed at their long \"devotion\" to Christianity suddenly start calling themselves atheist. These are the ones (atheists), I believe, agnostics/non-religious people like you will find particularly annoying.\r\n\r\n(In those \"soundbite\" interviews of Prof. Dawkins where the news channels want to exaggerate the \"controversy\" and hence improve ratings, Prof. Dawkins also sounds like one of those annoying atheists...)\r\n\r\nThose newly atheist anti-Christian rebels don't really have good reasons for being atheists (beyond the elementary ridiculousness of Creationism and \"Young Earth\" as compared to evolution). Nor do they have any way (or knowledge) of refuting \"Gods\" of other religions (esp. eastern) and hence believe their atheism \"on faith\" and hence fall victim to the same flaw as dogmatic religions.\r\n\r\nNot all atheists are that annoying..But, I guess non-annoying people don't make \"sexy TV material\" at least in the US.. [(I don't know if you have heard of Prof. Dan Dennett (link to his interview) ](http://video.google.com/videoplay?docid=-3133438412578691486&amp;q=Daniel+Dennett&amp;hl=en)\r\n\r\n\r\nThis is a much better interview of Prof. Dawkins by Jonathan Miller:- (It gets more relevant in part 2 and 3..)\r\n\r\n- [Atheist Tapes: Richard Dawkins Part 1(link)](http://www.youtube.com/watch?v=Y-ko_YS7Wxg&amp;mode=related&amp;search=)\r\n- [Atheist Tapes: Richard Dawkins Part 2(link)](http://www.youtube.com/watch?v=_9q8Dnx5ozA&amp;mode=related&amp;search=)\r\n- [Atheist Tapes: Richard Dawkins Part 3(link)](http://www.youtube.com/watch?v=FNg6hnlfs5E&amp;mode=related&amp;search=)\r\n\r\nAlso, there are other videos by Prof. Dawkins which are more interesting (to me) than these debates over religion/god..\r\n\r\n1. \"Nice Guys Finish First\" (evolution of \"altruism\"): http://richarddawkins.net/article,305,Nice-Guys-Finish-First,Richard-Dawkins--BBC\r\n\r\n2.. (more later..) \r\n\r\n","controversiality":1,"link_id":"t3_vtxd","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236777,"message_id":"48097-5aeec7ec-4db5-43ca-9c63-6271efbcf3d9-1566236777"}