{"author":"jvance","author_flair_text":null,"id":"cvwhw","edited":false,"parent_id":"t1_cvmux","gilded":0,"distinguished":null,"retrieved_on":1473809301,"body":"Um, you need to actually read it.  The first part talks about crash involvement.  The second part talks about crash severity.  They're two separate issues.  One is whether you tangle with another car, the other is whether you die as a result.\r\n\r\nCrash involvement:\r\n\r\n&gt; As illustrated in figure 2, the likelihood of being involved in a crash was extremely flat, with little difference in crash risk for vehicles traveling within 15 mi/h (25 km/h) of the mean speed of traffic.\r\n\r\nOverall likelyhood of same direction crash involvement:\r\n\r\n&gt;  If conflicts created by large differences in travel speeds were a major factor in the likelihood of crashes, then one might expect to find a large number of crashes involving two or more vehicles traveling in the same direction. Cerrilli (1997) found less than one-third of all crashes and 5 percent of all fatal crashes in 1996 involved two or more vehicle traveling in the same direction. Many of these likely occurred as a consequence of a vehicle slowing or stopping for cause (i.e., to make an intended maneuver or avoid striking a stopped vehicle or other hazard) and being struck from behind by a vehicle following too closely or going too fast for the driver to stop in time to avoid the collision. By far, the predominant crash type on rural roads is a single vehicle running off the road.\r\n\r\nRegarding crash severity, the faster you go, the more likely you are to die if you crash.  The relationship is exponential.  Look at figures 5, 6 and 8.\r\n\r\nFinally, from the summary:\r\n\r\n&gt; When the consequences of crashes are taken into account, the risk of being involved in an injury crash is lowest for vehicles that travel near the median speed or slower and increases exponentially for motorists traveling much faster. \r\n\r\nThe logic is pretty much inescapable.  The safest speed to drive (taking into account both crash likelyhood and severity) is anywhere between the mean traffic speed and 15mph under.  So in your case, what do you do if everyone is driving 15 mph over the speed limit?  Drive the speed limit.   It's both safe and legal.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vjh2","subreddit":"reddit.com","ups":0,"score":0,"created_utc":1166945927,"author_flair_css_class":null,"timestamp_epoch":1566236777,"message_id":"48298-697825c4-90da-4330-84c1-5aaca292ca5e-1566236777"}