{"stickied":false,"link_id":"t3_vw3w","subreddit_id":"t5_6","controversiality":1,"body":"Some Further Evidence:\r\n\r\nThe Amanita Muscaria Mushroom is a red mushroom with white dots commonly found as a christmas ornament, and sharing the same color scheme as christmas. This mushroom is one of the most potent hallucinogens in the world, as it has a near-perfect mix of uppers and downers. It is also a favorite food of most Reindeer species. These mushrooms were even left by the fireplace in order to dry out, similar to the way we leave stockings. Maybe they were flying for more reason than one?\r\n\r\nSpeaking of Reindeer, the names of the Reindeer were actually made up by poet Clement C. Moore, in \"Twas the Night Before Christmas\" which is pretty much the canonical Christmas poem. Anyway, Donder and Blitzen, the last two reindeer, are actually misspellings of Dunder and Blixem, the Dutch words for \"Thunder\" and \"Lightning\", more sky and weather references.\r\n\r\nSanta Claus himself can be traced back to various European fire gods, including Odin (during christmas he would have a great hunting party, from which stems the tradition of having ham for christmas, as well as the German/Belgian practice of leaving one's shoes (full of hay) outside the door, for Odin to fill with candy in thanks for feeding his flying horse), the Icelandic Yulemen, etc. This is directly referenced in \"Twas the Night Before Christmas\": \r\n\r\nHe was dressed all in fur, from his head to his foot,\r\nAnd his clothes were all tarnished with ashes and soot;\r\n[...]\r\nThe stump of a pipe he held tight in his teeth,\r\nAnd the smoke it encircled his head like a wreath;\r\n\r\nHis use of the chimney, the sort of axis of the house, and control of the north pole are both references to his control over the earth's axis, which relates directy to Astrological Ages, as they are determined by the 26000 year wobble of this axis, which moves in retrograde through the zodiac. We are currently exiting the Age of Picies (into the age of Aquarius, hence the song), but before 1 AD we were in the age of Aries, the god of fire and war. \r\n\r\nContinuing the fire thing, in most mythologies, fire is associated with creator gods, like Hephestus or Odin, gods who build things for others. Like toys. These gods are also usually disfigured in some way- Hephestus was lame. Santa, again from \"Twas the Night Before Christmas\":\r\n\r\nHe had a broad face and a little round belly,\r\nThat shook, when he laughed like a bowlful of jelly.\r\nHe was chubby and plump, a right jolly old elf,\r\nAnd I laughed when I saw him, in spite of myself;\r\n\r\nHe is also described as hunched and peddler-like.\r\n\r\nIn effect, Christmas is the a sort of Astrological Rollover, where the old fire god (Santa) makes way for the new Peaceful god (Jesus), while still showing his mastery and control of the forces of gravity, as well as the charity of the older religions, and ultimately his control over the cycle of divinity as seen through the Astrological Ages. Even his \"false gift\" of coal for bad children would have been valuable during the middle ages- Santa in that way acted as a sort of flying socialist, as well basically a drunken fat old drug-dealer.","created_utc":1166952700,"author_flair_css_class":null,"ups":3,"score":3,"subreddit":"reddit.com","parent_id":"t3_vw3w","edited":false,"id":"cvwmo","author_flair_text":null,"author":"connor","retrieved_on":1473809304,"distinguished":null,"gilded":0,"timestamp_epoch":1566236777,"message_id":"48350-30ac423e-f005-407b-bb9b-4bb7eb246749-1566236777"}