{"body":"http://www.history.com/minisites/christmas/\r\n\r\n*Germany is credited with starting the Christmas treetradition as we now know it in the 16th century when devout Christians brought decorated trees into their homes.*\r\n\r\n\r\n*It is a widely held belief that Martin Luther, the 16th-century Protestant reformer, first added lighted candles to a tree.*\r\n\r\n\r\n*It is not surprising that, like many other festive Christmas customs, the tree was adopted so late in America. To the New England Puritans, Christmas was sacred. The pilgrims's second governor, William Bradford, wrote that he tried hard to stamp out \"pagan mockery\" of the observance, penalizing any frivolity.*\r\n\r\n\r\n*It wasn't until the 19th century that Americans began to embrace Christmas. Americans re-invented Christmas, and changed it from a raucous carnival holiday into a family-centered day of peace and nostalgia.*\r\n\r\n\r\n*In the early years of Christianity, Easter was the main holiday; the birth of Jesus was not celebrated. In the fourth century, church officials decided to institute the birth of Jesus as a holiday.Unfortunately, the Bible does not mention date for his birth (a fact Puritans later pointed out in order to deny the legitimacy of the celebration). Although some evidence suggests that his birth may have occurred in the spring (why would shepherds be herding in the middle of winter?), Pope Julius I chose December 25. It is commonly believed that the church chose this date in an effort to adopt and absorb the traditions of the pagan Saturnalia festival.*","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vw3w","subreddit":"reddit.com","score":5,"ups":5,"created_utc":1166957312,"author_flair_css_class":null,"author":"NitsujTPU","author_flair_text":null,"parent_id":"t1_cvwoh","id":"cvwpp","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809306,"timestamp_epoch":1566236777,"message_id":"48385-496b8d96-e922-4a77-b974-a94697dabf2b-1566236777"}