{"author_flair_text":null,"author":"nostrademons","parent_id":"t1_cvwl9","edited":false,"id":"cvxae","gilded":0,"retrieved_on":1473809315,"distinguished":null,"body":"Question is - is he turning down offers because he really wants to run his own company, or is he turning them down out of arrogance and hubris?  The former is very, very difficult, and requires one good decision after another for 15-20 years.  Companies that get big fast, like FaceBook, often can't develop the culture needed to sustain themselves over the long haul.\r\n\r\nJoel wrote a [good essay](http://www.joelonsoftware.com/articles/fog0000000056.html) on this, once upon a time when he was still writing good essays.  The biggest mistake you can make as an entrepeneur is to confuse the two.  Facebook grew as an Amazon company, but they're now claiming to want to be Ben &amp; Jerry's.  Sometime, it's likely to bite them.\r\n\r\n(Also, I don't think the social networking business has the network effects that most social networking companies think it does.  The normal logic is that people want to be where their friends are, and so a social network that gets big has \"lock in\" where nobody wants to leave their friends.  This completely ignores that people are actually at home, sitting at their computers, and social networking sites are one of many communication media between them (also including e-mail, IM, phone, message boards, and so on).  When a social networking site gets old, whole groups of friends desert it en masse.  I've watched this happen numerous times, with a whole bunch of my Internet friends defecting from DeadJournal to LiveJournal to MySpace to Vox at once, and a whole bunch of my college friends defecting from planWorld to Friendster to TheFaceBook and now largely back to planWorld.)","controversiality":0,"stickied":false,"link_id":"t3_vw3y","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166978794,"author_flair_css_class":null,"score":1,"ups":1,"timestamp_epoch":1566236777,"message_id":"48626-87a8e0ee-6a59-4bfd-a061-b88a724c0a0e-1566236777"}