{"distinguished":null,"retrieved_on":1473809320,"gilded":0,"edited":false,"parent_id":"t3_vw3w","id":"cvxi5","author":"[deleted]","author_flair_text":null,"score":6,"ups":6,"created_utc":1166984823,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_vw3w","controversiality":0,"body":"The cult of Mithras was (loosely) based on the Persian Zoroastrian mysteries.  At that period in history the effects of Zoroastrianism were being felt widely in the Roman world, which introduced the idea of a positive evil.  That's positive in the sense of being a real thing rather than a negation.  Rather than bad things being a result of mistakes, or a result of inherent limitations of nature, instead the world was seens as a battle between good and evil, and bad things were seen as rooted in a real force that tried to make bad things happen in the world.  In Greco-Roman philosophy the idea of a positive evil makes no sense (you are attributing privation as a substance), and to a traditional educated Greek or Roman pagan the idea of an evil God made no sense at first.\r\n\r\nThe Jews who had returned from the Persian captivity brought Zorioastrian thought with them.  The Persian Ahriman became Satan.  Modern scholarly analytic studies of the O.T. point to the time frame of this return as the point when Satan was introduced to the Bible.  At that point the story of Adam, Eve, and the Serpent was dramatically reinterpreted.\r\n\r\nThere was much contact between the Greeks, Romans, and Persians, the Greeks especially worked as mercenaries and Mithraism came to Rome via soldiers.  Mithraism was especially popular among the soldiers of Rome.   \r\n\r\nThere is some significant differences between Mithraism and Christianity worth noting.  Mithraism was well regarded by the Emperors for much of the Roman Imperial period up to Constantine, while Christianity was generally not well regarded.  Mithraism only allowed male members, while Christianity allowed women, and was especially popular among women during the Roman period.  One often hears of a conversion to Christianity of an important Roman figure being based on the religion of his mother.  In Mithraism the battle between good and evil was reinterpreted as a battle to maintain virtuous conduct against the passions, the conflict was moved from the cosmic scale to the personal.  This is actually reminiscent of the one traditional Islamic view of Jihad.  In Christianity there are various views of evil, but the one that is most pernicious to society is that which holds believers as the good people, and non-believers as evil, so that the Christian soldiers could march forth in the name of goodness.  A significant difference that can help account for the popularity of Christianity is that Christianity made it clear that it went to the slums seeking converts, and sought out those of poor character to convert and save, those traditionally rejected from other mystery cults.  The N.T. depicts Jesus saving the prostitutes and fishmongers - in Mithraism there were strict ethical requirements for joining the cult, and as one progressed through the initiations, there were (quite interesting) tests that the candidate went through.  While Zoroastrianism, Christianity, and Judaism both rejected foreign gods as evil, Mithraism actually embraced the pagan gods.  It was very syncretic.  In Mithraic temples, there were representations of the traditional Greco-Roman gods, as well as various Oriental gods such as Cybele and Serapis.  In later periods when the Romans soldiers were spending much time up north, Celtic and Germanic gods appeared.  Pagan priests officiating over the temples were often also initiates in the Mithraic mysteries.  Rather than rejecting the cultural legacy of Greece and Rome, as Christianity did, Mithraism incorporated it.  \r\n\r\nThere were a number of points in Roman history where it looked like Mithraism would triumph and become the dominant religion of Rome.It's an interesting though experiment to consider what the West would have looked like were Mithraism to have dominated.  While the late period of Rome in the West was a series of catastrophes, I still wonder if the handling of those catastrophes could have been better.  Certainly the religious character of the world would be completely different.  There would be no Islam as we know it, for Christianity had a profound effect on Islam (as did Judasim and Zoroastrianism).  Consider that if Mithraism were to have met Buddhism in an area, the two would have been sympathetic and would likely have merged in geographies where both were popular, as both were syncretic.  The islamic purge of Buddhists from India would not have happened.  Western philosophy would have been markedly different as well.","timestamp_epoch":1566236777,"message_id":"48746-296e9176-2602-4da8-9edb-9df47afcbd4a-1566236777"}