{"controversiality":0,"body":"If you look at Hegel, you'll see that he was saw the significance of and saw the conflicts  between modern critical philosophy, and classical philosophy.  His system was (among other things) an attempt at a reconciliation, though I think among other things his historicism left the project doomed, as there is no end to history.  That and his views of evolution and progress have clearly been quite problematic as we have seen the effects of Hegelian thought on history.\r\n\r\nBut it does bring up something that used to be quite important to the educated Westerner, that the classical mode, while different than the modern, contains insights into the most fundamental issues in philosophy.  And there are certain differing preconceptions between modernism and classicism, most importantly regarding skepticism.  Starting with the pre-Socratics, and seen at a remarkable flowering in Plato, Aristotle, and appearing in the many Hellenistic and Roman philosophers, there is an inherent trust of reason.  The view really is tied in with their view of the nature of the divine.   \r\n\r\nSocrates plainly said, \"Only the Gods are wise!\"  Philosophy is the love of wisdom, not the possession of it.  In this way the ancients truly thought philosophical truth was founded not only on the human, but also on the divine.  Like the Gods men are intelligent, and it is through the Gods that intelligence is granted to men.  But unlike the Gods, because human beings are human, they can't ever claim to possess the whole truth.  \r\n\r\nIn the modern view philosophical knowledge in the ancient sense is impossible because the divine is a figment of the imagination.  The contemporary and the ancient views differ fundamentally on what philosophical truth is and whether it can be attained.  The very idea of truth itself differs between the ancients and moderns, as do the definitions of the real/being, what constitutes an essence, the nature of mind and even self.  These differences are well worth accounting for.  While studying the ancient and modern understandings of metaphysics can be strange at times, as one encounters ideas so remarkably different about quite fundamental human questions.  But it is something that is significant to do, for while contemporary philosophy tries to pretend that it doesn't do metaphysics, when you don't do metaphysics, what you really wind up doing is bad metaphysics, such as relativism and materialism.\r\n\r\nTo bring up a view of the differences or view, consider that the Ancients looked at things in this manner.  There are two really fundamental questions that govern our relationship to the whole of our experience.  Those questions are:\r\n1) Is it good?\r\n2) Is it a thing to relate to as a material object, is it a thing to relate to as another sentient being, a \"you\", or is it a thing to relate to as the self.\r\n\r\nIt's from those answers that our experience is governed, so it is important to think about each very carefully.  If you look to all as good, there will be a fundamentally different way to relate to the all as compared to if one relates to it with indifference, or if one relates to it as bad.  For examples of the ancient philosophers who thought in each mode, Plato was one of those who look to the all and thought it was fundamentally good.  For Plato, ultimately all the cosmos was created out of the God or the One.  And according to Plato it is in our nature as humans that we can turn from the world of sense experience towards the mind itself, and through the mind itself to that highest point in which the individual bind is bridged to something that is even higher, and which is rooted in the good.  Thus the individual self was both rooted in the good in this way, but also the world of experience was taken as Plato to be the theophany of the Demiurge.   The Stoics typify one who would look to the world with indifference.  The god was not of this world, and so this world was not to be judged by it.  Rather the good was found in maintaining a certain impassive state of mind (ataraxia) in relation to the world.  Materialists such as Epicurus also taught this.  Finally there were those who looked to the world and saw it as something fundamentally bad.  These would have an idea of the good as something not of this world, so that this world is not really in a full relation to the good.  Some of these were the Gnostics, who the Platonist Plotinus takes to task in \"against the Gnostics.\"  Non-Gnostic Christians too thought in this way, but some added another element, \"The Devil.\"  They looked to the world and saw it as containing a force that worked actively against the good.  Christianity, some sects of Judaism, especially after the return of the Jews from Persia, and the later Islam all have elements that look to the world as evil, and believe in a positive evil.  These are the most dangerous groups in that the belief in a positive evil is such a mentally unhealthful, world hating view, that it causes those believers to potentially find evil in anything that they relate to.  This builds in conflicts, as once the devil without is conquered, the pagans subdued and eradicated, then they turn to themselves and carry on battling evil, be it in their community or in their self.  The fundamental problem with this view is that is defined all forms of relating to experience as conflict.  \r\n\r\nIn Plato courage is defined as facing the all with the belief that it is good even if one suffers pain, and that pleasure and pain are separate from the good.  The greatest courage is to see that one is in physical pain but still believe that the world is good.  For Plato the good was at the center, both the root of consciousness and visible to the living and conscious as the root of the order that one finds in the world.  To the degree that one can see the fundamental order of the world Platonically, the more one finds its nature of be good, so one can find the good both in himself and in the world when in the right relation to the world.    \r\n\r\nIn Plato truth is inherently grounded in the divine, and it is only through the divine gift of reason that we can find truth.  Plato cannot allow any faith whatever in his system, but the whole is predicated on the idea of the Good or the One, and ultimately on a One or Good that is even beyond ideas.  It is in that grounding that reason acts.  \r\n\r\nThe modern conceit is to consider that the mind is ultimately without substance, it is an animal mechanism operating in the world of sense experience where the mind must act, and if the mind leaves the domain of the senses all it can find are fantasy.  There is no god possible in such a view (except perhaps occasionally the Cosmos itself), for the only place to find a god would be in matter, and there is no god to be seen using quantitative analysis of phenomenon that can be detected through the senses or other material instruments that operate as sensors.\r\n\r\nNow given the choice as to which of these views to accept, one would want to follow Plato's advice and turn the mind from the world of sense to the mind itself, and spend some time there more seriously, not looking at the world of the senses, but turning the mind to itself to know oneself.  This is often called \"turning the light around,\" for in the ancient world sense operation was seen as the light of the mind entering the world, rather than as material light entering the eyes into the nervous system, where the light is analyzed by the brain and formed into an image of the experience, a qualila.  Plato holds that in turning the light around that there are certain forms that one will find.  While the nature of the forms is difficult to understand well, it's clear that Plato did not appear to meant a form as an archetypal image taken as a model for individual material items.  Rather one seems that the forms are the fundamental noetic categories of understanding that the light of understanding uses.  But that understanding entails more than just sense experience, it is fundamentally grounded in the good, and to the degree that one turned the mind to itself, one finds the good.  \r\n\r\nI count myself as something of a Buddhist.  I see these fundamental systems of understanding the world, but prefer to stand outside of them and above them, using them when useful, but not staying too attached to them.  I don't really see modern materialism as more true than Platonic idealism.  Nor do I find it a better descriptor of the nature of reality, nor is it really more satisfying to live with.  In all when I view each system as neutrally as possible, Platonism seems to be more true, nor more useful for understanding the world (for Platonism still can include modern science, but believing in scientism precludes Platonism), and in general a more satisfying understanding of the world.  \r\n\r\nDang it, I was going to go into how reincarnation worked into such a system, for both Buddhist and Platonists both believed in reincarnation, and their accounts of reincarnation are interesting to compare.  But it's Xmas eve, and I have already wasted too much time on the computer I need to go be with my kids.\r\n\r\nHopefully my previous remarks will be better understood in this context.  Merry Xmas/Happy Holidays.","link_id":"t3_v6h2","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1166987403,"score":1,"ups":1,"author_flair_text":null,"author":"[deleted]","parent_id":"t1_cvs4m","edited":false,"id":"cvxl9","gilded":0,"retrieved_on":1473809321,"distinguished":null,"timestamp_epoch":1566236777,"message_id":"48799-d0aba695-3107-4079-92fd-8d647f76170e-1566236777"}