{"author_flair_text":null,"author":"corwin","parent_id":"t1_cvw67","id":"cvxpz","edited":false,"gilded":0,"retrieved_on":1473809324,"distinguished":null,"body":"Speaking of sleight-of-hand... You're trying to say \"hey, I'm not taking if from the original owner, so it's OK.\" That, my friend IS rationalization. It's kind of the definition of it, actually... coming up with a rationale to justify a position. And I didn't say you were dishonest... the two are not the same thing. \r\n\r\nBack to the issue...\r\n\r\n* The person from whom you're copying the song does not have the right to redistribute the song. Copying the song from them is participating an a violation of copyright - both the copier and the person allowing the copying are in the wrong here. \r\n\r\n* Theft.... I simply am not going to start arguing the minutiae of this definition, but  your definition is taken from a world with physical artifacts only. In that world, theft naturally deprives the previous owner of the property. This isn't true in the digital world, but that does not mean  the act is right. Call it something else, but you're still taking something that has value to you and not paying for it. Thief, cheat, whatever... Why should you get value without paying for it? Aside from the copyright owner allowing this, what you're doing is stealing. Find another word if it makes you feel better, but that's what it is. \r\n\r\n* Point #3 does not anticipate my conclusion - you're again trying to redefine terms to fit  your point. The original owner of the song retains rights to the distribution of the song. Hence you are getting value and not compensating the owner of the song - which is NOT the guy who bought the CD. The person buying the CD does not suddenly own rights to the song, anymore than your customers own the rights to the software you sell them. The CD buyer merely owns the rights to use it for their own enjoyment. I'd argue that includes ripping it to a iPod, burning a second CD for the car, etc.... but it cannot reasonably be stretched to include the right to give it away to others ad infinitum.","controversiality":0,"stickied":false,"link_id":"t3_vtf3","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1166990631,"author_flair_css_class":null,"score":0,"ups":0,"timestamp_epoch":1566236777,"message_id":"48875-33833653-a782-443c-aec7-bd06d7ae4b83-1566236777"}