{"created_utc":1166991267,"author_flair_css_class":null,"ups":20,"score":20,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vx46","subreddit_id":"t5_6","controversiality":0,"body":"Eh eh, typical British article on Christmas eve: poking fun at the neighbours is a sure way to sell paper. ;) Come to think of it, I'm pretty sure I could find a humorous article about England in the French papers or magazines this week. :D\r\n\r\nYes, I'm French, and I must say I don't follow the most outlandish rules outlined in the article. Foie gras? On the toast of course, though I prefer not to spread it, just eat a piece along with the toast. Sorbet or ice-cream? Never seen anyone eating it with a fork.\r\n\r\nHowever, yes indeed, there are a few things that most people I know follow (myself included), such as keeping hands on the table, not pouring a drink for yourself without at least asking your neighbours if they might want some, or arriving right on time (though an hour late is definitely way too much, ten to fifteen minutes is much more common). Those are what being a different culture is all about.\r\n\r\nNote that the author aimed straight for the elitest of the Parisian elite, almost outlandish folks for the rest of the nation. I don't stare blankly at people when they make a faux pas, moreso when they have obvious excuses, such as being a stranger visiting a foreign country. As for the language, it's not so much that the French would want to force you to speak theirs, but rather that they're not very good or very comfortable speaking yours. ;)\r\n\r\nFinal note: the article mentions a Japanese \"Paris Syndrome\". There's been an article on Reddit about that a few months ago, and the conclusion was that fault was on both sides: Parisian rudeness, sure, but also Japanese idealization and utter lack of preparedness.","retrieved_on":1473809325,"distinguished":null,"gilded":0,"id":"cvxr0","parent_id":"t3_vx46","edited":false,"author_flair_text":null,"author":"boa13","timestamp_epoch":1566236777,"message_id":"48893-451a8043-5121-4af4-b35f-eb9c1604bb00-1566236777"}