{"retrieved_on":1473809331,"distinguished":null,"gilded":0,"edited":false,"parent_id":"t1_cvxpz","id":"cvy2m","author_flair_text":null,"author":"randallsquared","created_utc":1167000837,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_vtf3","subreddit_id":"t5_6","controversiality":0,"body":"&gt; You're trying to say \"hey, I'm not taking if from the original owner, so it's OK.\"\r\n\r\nI'm saying that I'm not taking *anything* from the original owner.  He's lost nothing.  That's the most important point, here.  The original owner still has everything he had.  I certainly don't mind the original owner trying to make money from the fact that he has something that others would like a copy of; I just prefer that he not take the shortcut of using force to ensure a continued monopoly.  Instead, I would prefer that he find a market solution.\r\n\r\n&gt; The person from whom you're copying the song does not have the right to redistribute the song.\r\n\r\nHe most certainly does, except in the strict sense of the current legal environment in many Western countries.  He may have signed a contract defining an exchange regarding the song, in which case he is responsible for adhering to the terms of that contract, or paying the contractual penalties for not doing so.\r\n\r\nOf course my definition of theft applies to physical artifacts only, because that's all there really is.  If I own a hard drive, I own the information described by the physical artifact, not separately, but because that's what the information *is*.  If someone buys a CD without further contract, they own the CD.  Period.  There's no need to complicate matters of ownership with epicycles.\r\n\r\nI think one of the fundamental problems with discussing this sort of thing is that people seamlessly switch between two different meanings for a whole category of words.  When someone talks of owning a CD, sometimes they mean owning a physical disk, and sometimes they mean ownership of nebulous rights to all CDs which are sufficiently similar to this one.   \r\n\r\nFrankly, it seems incredible to me that anyone really believes that their creation of a pattern in place X can affect my ownership of a pattern in place Y, absent a contract.  Viewed from my position, it's very peculiar that *arrangements* of things have been promoted to having the same legal position as things themselves; it's just obviously not the case that one can own an arrangement separately from the things that make it up.\r\n\r\n&gt; The person buying the CD does not suddenly own rights to the song, anymore than your customers own the rights to the software you sell them.\r\n\r\nThe CD buyer and my customers both own their copy, outright.  If the CD buyer or my customers want to resell that product (absent a specific contract), there's no reason in the world that the publisher of the CD or I should be able to stop them.  The place to make the decision about what I want to sell is before I sell it, not after the fact.  After the sale, *they* *own* the copy I sold them, and I own the copy I didn't sell them.  They have all the rights to their copy that I would have to a bit-for-bit identical copy I kept.\r\n\r\n&gt; I'd argue that includes ripping it to a iPod, burning a second CD for the car, etc.... but it cannot reasonably be stretched to include the right to give it away to others ad infinitum.\r\n\r\nSo, you'd argue, to paraphrase, that while the buyer doesn't have the right to perform some actions with the CD, they *do* have more rights to perform actions than the CD publisher claims?  Why?  I mean, if you're going to say that the publisher has the right to control some copies they make, why not others?  \r\n\r\nI think you have to step back and follow your argument where ever it leads.  If it then leads to something that's obviously false, either you made a mistake, or your argument is wrong.  In this case, either patterns can be owned separately from their constituent matter, and any abrogation of that ownership is theft, or they cannot, and there's no reason to think that people don't own what they bought.  I don't think the first can work; there'd be enormous amounts of bookkeeping involved in the most trivial sales or activities.  The second only needs people to wake up and find revenue streams that don't involve sorta kinda pretending the first is true.","timestamp_epoch":1566236777,"message_id":"49094-7b94c3b9-a5a6-4797-aaae-605df08f9d29-1566236777"}