{"stickied":false,"link_id":"t3_vwfa","subreddit_id":"t5_6","controversiality":1,"body":"Here's something better than that literary sludge:\r\n\r\nI, God, choose not to appear to you people as anything at all. Like a parent who actually cares for his children, I'd not want to confuse you.\r\n\r\nI gave you free will, so that you could be free. Even I don't know what you will do with it, which was the point in the first place.\r\n\r\nTherefore, I am not omniscient. Duh.\r\n\r\nWhat's more, I like atheists alot. Not the ones that are always pushing it in your face, they remind me too much of the christians with all their bullshit. I'm not admitting to anything here, but just suppose I walked among you disguised from time to time. It'd be a tossup who is the more foolish, wouldn't it? The Jehovah's Witnesses who tell me I'm going to hell, and that only they can save me, and the rabid atheists who tell me I don't exist.\r\n\r\nBut those atheists who just try to be good people, because being good is the whole idea... these people are more saintly than any crazy catholic who ate moldy rye bread and had visions. They're not being extorted into acting good, they just are. You nutjobs out there that \"believe in me\", well, when I hear you say \"if God didn't exist, I'd be out there murdering and raping\"... fall in a well and drown already.\r\n\r\nThat these atheists happen to be wrong about my existence are wrong, who can blame them? I'd be doing them a crime, if I insisted that they believed in non-divine things without evidence, and yet it's some saintly thing if they for some reason do it concerning myself? Medammit, if I made them that way, they'd be suckers to every con job that came their way. I'd be crippling them spiritually. Well, seems I didn't have to, did I? There are plenty who will spiritually chop off their own legs at the hip, to use a bad metaphor.\r\n\r\nGet this straight. There is no heaven, but if there were, I'd not have some secret password or dumbassed test. I don't ask that you know how many stars there are in the universe, nor do you have to be able to answer correctly whether or not I exist. If there was any at all, it is that you're a good person. Nothing else makes sense. And laying it out before you like this, well, can't you see that it's so much more difficult to be a good person when you are religious? Why take on that extra burden? \r\n\r\nBesides, if there is a heaven, and I neither confirm nor deny it, we'll make fun of you for eternity for being so stupid. Just because you were accidentally right won't spare you that indignity. Quit being a dumbass already, I commandeth thee.\r\n\r\nOh, an evolution. It's wrong. Creationism too. Evolution is closer to the truth though... but the people who understand it best are too damn stodgy. The thing that's right but not really quite evolution either, it's really quite clever. Wish I could take credit for it. Those completely natural mechanisms that allow a species to pop up overnight (at least the geological equivalent of \"overnight\"), those are pretty damn cool. Not one trait accidentally being born and spreading throughout the population over thousands of years... but a whole boatload of them at once, in a single organism, skipping all the transitional phases that could never work.\r\n\r\nI really wish I could tell you. It's so beautiful, you almost have to think someone invented it. It's difficult to believe.\r\n\r\n","created_utc":1167000735,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","parent_id":"t3_vwfa","id":"cvy2i","edited":false,"author_flair_text":null,"author":"NoMoreNicksLeft","retrieved_on":1473809331,"distinguished":null,"gilded":0,"timestamp_epoch":1566236777,"message_id":"49091-ed41c95c-4e1a-4114-ac13-f83145388c31-1566236777"}