{"id":"cvy5s","edited":false,"parent_id":"t1_cvxw2","author":"lysine23","author_flair_text":null,"distinguished":null,"retrieved_on":1473809333,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_vxqd","stickied":false,"controversiality":0,"body":"&gt;Assuming you want good teachers, and there are no more, you have to bribe them away from another school, which then loses a good teacher.\r\n\r\nNew teachers can be trained.  If the demand is there, it'll happen.  If it turns out that good teachers are worth professional incomes, we'll see more talented people become teachers.\r\n\r\nEven if I'm wrong, if there's a shortage of good teachers that can't be solved, what difference does it make whether we have vouchers or public schools?  Why bother to oppose vouchers?\r\n\r\n&gt;No, it would work as markets work. That's the difference. Then again, maybe you generally believe advertisements.\r\n\r\nIt depends.  I'm not going to disbelieve 2+2=4 just because an advertisement or a conservative economists says so.\r\n\r\n&gt;Ah, didn't think you would catch that. The problem is, economies of scale will kick in, and these private schools will soon be big corporations. Sorta like those HMOs that tell your doctor it costs too much to give you proper treatment. Gatto himself believes in small schools, with only a couple hundred students at most. But corporatizing, privatizing all these school systems will create only super schools. Some accountant will decide that it costs less to bus your kid 2 hours away to one with 5000 kids than it would to build two buildings. And all the other accountants at all the other school corporations will come to the same conclusion (not that there will be so many competing ones).\r\n\r\nI'm not so sure about that.  What economies of scale?  Teachers will dominate the expenses of any decently-run school, and they'll cost the same for the big guys as they will for independents.\r\n\r\nWe have private schools now.  Are they dominated by corporate chains?\r\n\r\nEven if you're right, it'll end up looking more like the restaurant business than telecom.  We have mega-restaurants like McDonald's and TGIFriday's, but they'll never drive the Thai place down the street out of business, because people who care about food are not going to go exclusively to chains.  Education is not a natural monopoly like telecom.\r\n\r\nFinally, my real reason for supporting vouchers - People like me wouldn't feel that we had to buy houses that we can't afford in a neighborhood with a good school district, if we weren't scared of the underperforming schools in the cheaper district.","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1167002197,"subreddit":"reddit.com","timestamp_epoch":1566236777,"message_id":"49129-e1255c14-0065-4b96-b99f-723403f03fd6-1566236777"}