{"id":"cvy77","edited":false,"parent_id":"t1_cvy5s","author_flair_text":null,"author":"NoMoreNicksLeft","retrieved_on":1473809333,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_vxqd","subreddit_id":"t5_6","controversiality":0,"body":"&gt; New teachers can be trained.\r\n\r\nBut not all trained teachers are good teachers.\r\n\r\n&gt; If the demand is there, it'll happen.\r\n\r\nDemand doesn't create things out of thin air. There is demand for twice as much oil as there is in the ground, but that doesn't mean it materializes out of nothing.\r\n\r\n&gt; If it turns out that good teachers are worth professional incomes, we'll see more talented people become teachers.\r\n\r\nThis assumes that there is some pool of people that would be good teachers, but choose not to be, and that more money will convince them to become teachers. Most good teachers aren't in it for the money. Even then, even supposing you are right, will this be enough to make up for the shortfall?\r\n\r\n&gt; Even if I'm wrong, if there's a shortage of good teachers that can't be solved, what difference does it make whether we have vouchers or public schools? Why bother to oppose vouchers?\r\n\r\nI'm not opposed, I see it as something pretty stupid. But, it also says that I'm somehow oligated to pay for your kid's education. Why is that? Actually, there is more. I see it as a distraction. Same thing with politics, one side claims it has the answers, the other side claims they're the ones that have them, and both are so incredibly wrong that it would be a disaster if either makes it into office.\r\n\r\n&gt; It depends. I'm not going to disbelieve 2+2=4 just because an advertisement or a conservative economists says so.\r\n\r\nSo, you think that vouchers are more or less 2+2=4?\r\n\r\nIt wouldn't work as advertised. Not even close. Too much money to be made, devouring the corpse of public education. Markets don't always give us the best possible product, or even close. Often they don't. They give us the profit-maximising product.\r\n\r\nThis might be because of the way markets are distorted... you can claim that they aren't really free markets and all that bullshit. But even if true, why would this market buck that trend?\r\n\r\n&gt; I'm not so sure about that. What economies of scale? Teachers will dominate the expenses of any decently-run school\r\n\r\nPayroll done for 10,000 teachers is cheaper than for 50. Insurance and benefits. Less middle management. Advertising is cheaper. Everything is.\r\n\r\nTeachers don't dominate the cost. Read some of Gatto's books. In 1900, 98% of all school-employed people were teachers. Now, I think it's a third. All sorts of administration and transportation and everything else. This won't change just by privatizing schools. It can't. So, teachers won't dominate the cost.\r\n\r\n&gt; We have private schools now. Are they dominated by corporate chains?\r\n\r\nIt's a niche market right now. Things are different.\r\n\r\n&gt; Even if you're right, it'll end up looking more like the restaurant business than telecom. We have mega-restaurants like McDonald's and TGIFriday's\r\n\r\nHow perfect a metaphor! I love it. All of them serving nearly-inedible junk that is filling but tastes awful. Enough to survive with, and hundreds of flavors. Complete with stupid ronald mcdonald commercials!\r\n\r\n&gt; Finally, my real reason for supporting vouchers - People like me wouldn't feel that we had to buy houses that we can't afford in a neighborhood with a good school district, if we weren't scared of the underperforming schools in the cheaper district.\r\n\r\nMe, I could never trust anyone except possibly my own wife or family to teach my children anything. I remember how schools were 25 years ago, and I don't think they could have somehow improved. When you buy houses in an expensive neighborhood because you \"think the schools are good\" what you really are doing is buying the kid some status, not an education. That's pretty sad. Maybe they'll be one of the popular kids though, and won't get bullied.","created_utc":1167003413,"author_flair_css_class":null,"score":-1,"ups":-1,"subreddit":"reddit.com","timestamp_epoch":1566236777,"message_id":"49146-8af51c9f-669d-4973-b4c7-1ca00705161c-1566236777"}