{"score":10,"ups":10,"created_utc":1165154626,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tdn1","controversiality":0,"body":"Actually, \"employing less stupid employees\" is not far off.\r\n\r\nThe manager and assistant manager are \"agents\" of McDonalds.  Legally this means that when they are acting in their duties as McDonald's employees they represent McDonald's and that *McDonald's is liable for damages resulting from their actions*.  This is known as [vicarious liability](http://www.lectlaw.com/def2/u035.htm) or [*respondeat superior*](http://www.lectlaw.com/def2/q042.htm).  Similarly, if you got hit by a UPS truck, you could sue UPS because of the drivers actions.\r\n\r\nI'm sure McDonald's lawyers will try to duck their company's responsibility here, but I think this quote is important:\r\n&gt;McDonald's training manual does include a section that cautions employees that \"no legitimate law enforcement agency would ever ask you to conduct such a search.\"\r\n&gt;But none of the employees \"Primetime\" spoke with at the Mount Washington, Ky., McDonald's say they recall seeing the warning.\r\n\r\nThis shows that McDonald's was aware of the problem, but hadn't done enough to protect their employees, or to train their management.  I think the management training piece is what could do them in.  Summers, who's in charge of the store with the manager gone, used her authority over the victim as assistant manager to force her to undergo an illegal strip search and caused her to be sexually assualted.  McDonald's failed to properly train the management of this restaurant to prevent such things from occurring.\r\n\r\nThe degree McDonald's is responsible will be argued in court by the lawyers, and I'll make no predictions how it will turn out.\r\n \r\nEdit: Added links.","distinguished":null,"retrieved_on":1473807632,"gilded":0,"parent_id":"t1_ctfoi","id":"ctg2q","edited":false,"author_flair_text":null,"author":"emiller40","timestamp_epoch":1566236759,"message_id":"4916-427e9094-8ba7-42d0-bab0-a0179310f325-1566236759"}