{"author":"NoMoreNicksLeft","author_flair_text":null,"parent_id":"t1_cvyng","id":"cvyof","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809343,"controversiality":0,"body":"&gt; You're wrong about Bin Laden - what about the 52 virgins and all that ?\r\n\r\nAnd when we send off our own young men to die, from our secular nation, we wrap it up in a flag and talk about fireworks and 21 gun salutes and all that bullshit. I say \"goddamnit\" once in awhile too, doesn't make me any less the atheist. Sometimes they're just words, and Osama was more or less being poetic. His reasoning has to do with US troops in Saudi Arabia, and oil hegemony. He's still a homocidal asshole, an evil one at that, but his motivation is purely political.\r\n\r\n&gt; the next thing to attack is the very notion of separate countries\r\n\r\nYou really are a stooge. I'd feel more comfortable if the federal government were weakened to the point that the states acted like sovereign states. Fuck globalization.\r\n\r\n&gt; I'm against all those other isms you mentioned. Any kind of silly baseless group behavior is pretty much the same thing.\r\n\r\nYes, because you're clearly not jumping on a bandwagon here, thoughtlessly agreeing with every single word Savior Dawkins says. He's wrong, that essay is lame and counter-productive. Religion is stupid, pointless and often harmful... but when you harp on it and belittle it, instead of trying to be a good person and solve real problems, you've just turned atheism into religion. \r\n\r\nWorry about making sure no one goes hungry. That they have basic sanitation and medicine. That you treat them as if they were a person no matter the color of their skin, that you treat them as a brother no matter where they were born. Help them to have some dignity, and some time to think about philosophy. And once you've gotten that far, then you can worry about whether or not they believe in stupid myths. Trying to do it in any other order will backfire.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_vx8t","subreddit":"reddit.com","ups":2,"score":2,"created_utc":1167021241,"author_flair_css_class":null,"timestamp_epoch":1566236777,"message_id":"49410-3882a0fa-e26d-49b3-b0af-4615aeb61b0f-1566236777"}