{"controversiality":0,"body":"Wow, I must be bored...\r\n\r\nI think this is a team situation: those who believe in logic and science vs. intellectual laziness and tribalist b.s.\r\n\r\nBoth stated examples involve a group of people shunting their free will onto the shoulders of an idealized leader, thereby enabling these masses of cowards to maintain a feeling of individual innocence, even righteousness, while partaking of muderous rapacity - they believe they are operating within a system \"larger than themselves\" and thus do not have to take responsibility for their own actions... \"what happens in Vegas stays in Vegas...\" and punks who say that deserve to get slapped down, too.\r\n\r\nWhether said leader is real or imaginary (or a bastardized combo meal... hey, jeebus!), or said system theoretical or actualized, is beside the point.\r\n\r\nWere you to run \"define:religion\" dans le Googs you'd discover that, semantically, any mass psychosis with a component of ritual can be construed as religion - only a very few listed definitions include anything about objective supernaturality as a prerequisite.\r\n\r\nThe origin of the term \"religion\" renders as: \"vows under obligation\" and before being tied to the Church was used to denote \"scrupulous conformity.\" If Nazis and Stalinists (as opposed to Communists, of course) do not conform to that definition, then I'm not sure who or what would.\r\n\r\nI've noticed your slags of Dawkins in other threads, Little Nicky... do you not feel you're trying to punch above your weight? I'll call you \"Golgotha Troll;\" that's a much slicker handle.\r\n\r\n...and I'm not pinning all these \"murders\" on some god - it'd be like blaming Moby Dick for Hurricane Katrina, or Gandalf for the brown spots on my lawn; as I don't blame 9/11 on \"Allah\" but on assholes who handed their individual morality over to a sick myth of the vindictive god of the desert. It's just as sad as the kids who slump around trying to live life according to Holden Caulfield, dressed up like Jack Pumpkinhead. Neither existed, so emulating them and expecting results is Dumb, dumb, dumb. And, even worse, makes for emo music.\r\n\r\nAnd to what sociologists are you referring in your attempt to refute my statements about Nazism? Imaginary ones that live in the sky and speak to you from carbonizing shrubs? Have you read Mein Kampf? Have you studied the life of Stalin? Do you read the literature of framing, mass psych and propaganda? Try it.","link_id":"t3_vwfa","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167026082,"score":1,"ups":1,"author":"thehighercritic","author_flair_text":null,"id":"cvyss","edited":false,"parent_id":"t1_cvyo3","gilded":0,"retrieved_on":1473809344,"distinguished":null,"timestamp_epoch":1566236777,"message_id":"49485-5a3b5c0a-953a-424c-8575-f828d80735ca-1566236777"}