{"body":"Don't worry, you didn't strike a nerve.\r\n\r\nI agree people don't like being condescended to. But that doesn't mean helping people is condescending. Especially when someone asks me questions because I'm a \"computer guy.\" I try to help as best I can, and if they seem overly frustrated with what they have I might mention an alternative (like Firefox, Thunderbird, or Mac OS X) that they might like. I'm not going door-to-door here. (Well, I make some house calls.) And like I said in my above post, you choose Windows and that's great. I'm glad you like it. I know a lot of people who don't. I have almost no anecdotal evidence of people I know have a free and clear experience with Windows. What's your secret?\r\n\r\nI don't preach to anyone. If someone is interested I don't mind talking about it. If you're frequently running into people coming at you like it's a war, maybe you should put down your weapons. \r\n\r\nMac users are often evangelical. People really get into the things they love, that's just how it is. I'm not saying the Mac OS is perfect. I'm saying that I think it would make a lot of unhappy people happy. And if Reddit is about what it's user's think is interesting, you're bound to see posts from a very vocal Mac minority. I'm sorry if that hurts your soul. Maybe you shouldn't click the links that make you unhappy (or maybe see a doctor)? I do welcome your responses though. \r\n\r\nI think Windows guys assume Mac guys no nothing about Windows (and that may be true for a lucky few) but the reality of the situation is that we live in a Windows world. I've had experience with most flavors of Windows.\r\n\r\nI didn't mention the morality of Microsoft or Bill G. (great humanitarian), so I'm not sure what you mean by \"have the same consideration.\"\r\n\r\n\r\nedit: Windows users seem to think Mac users are on a crusade to convert them personally. Maybe some people do need that validation from complete strangers. I'm more interested in making people happy. I have less of an I-told-you-so and more of a here-hope-this-helps attitude. I think if you're talking with friendly, considerate people who use Macs they will be friendly and considerate. If you talk to someone with a need to shoot other people down to make him/herself feel good, then I think you won't enjoy talking to that inflammatory person. Same goes for PC guys/gals.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_vx6u","subreddit":"reddit.com","score":-1,"ups":-1,"created_utc":1167029946,"author_flair_css_class":null,"author":"zekel","author_flair_text":null,"id":"cvyvr","edited":false,"parent_id":"t1_cvyj6","gilded":0,"distinguished":null,"retrieved_on":1473809347,"timestamp_epoch":1566236777,"message_id":"49532-d1371490-e9f4-4773-a7be-c6f3e4fdf805-1566236777"}