{"subreddit":"reddit.com","score":9,"ups":9,"author_flair_css_class":null,"created_utc":1167075865,"body":"&gt;Vast conspiracies are impossible because the more people are involved then the more likely it is that someone will want to expose the conspiracy and or the more likely it is that someone will make a mistake and let the secret slip out into the light.\r\n\r\nSecurity in these conspiracies is handled using the following techniques:\r\n\r\n1) information is heavily compartmentalized so that only a very few core people know the whole plan. Operations carried out by the smallest possible teams (preferably individuals), and each team is only given enough information to carry out the mission.\r\n\r\n2) Anyone in a position to begin to put the pieces together is has enough blackmail material held against them that if they leave or reveal anything their lives would be destroyed. This is why these organizations prefer to have members with some kind of perversion that society abhors and is easy to gather blackmail material - psychopathy, pedophilia, massive drug habits, etc.\r\n\r\n3) If a member somehow manages to gain enough leverage to actually leave (by gathering extensive blackmail material on individuals higher up, and ensure that it will be distributed if they are killed), is forced to discredit themselves in so taht anything they say will be looked on very sceptically. Examples of this include being brought up on fraud charges, issuing crazy statements about UFOs, etc.\r\n\r\n4) Most people have a built-in resistance to accounts and evidence of events that are radically different from their understanding of reality. There is really a vast amount of evidence for all kinds of government subterfuge, agents of the state doing things that we associate with drug lords and psychopaths - it's just that people prefer not to think about or look for it.\r\n\r\nThey have no problem seeing stuff like small time government corruption and then feeling that they're keeping an eye on things, keeping government clean. But the CIA shoveling tons of crack into the inner city neighborhoods to finance off the books wars in Central American and Central Asia? No way!\r\n\r\nThis is just my personal observations having known and interviewed a few ex CIA assets in Central America.\r\n\r\nThey've got a pretty good system, built up over decades (got a lot of good techniques from the Nazis and Operation Paperclip), and in the end, if something slips through the cracks, most people aren't that interested anyway.","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_vyxb","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473809367,"author":"NoFixedAbode","author_flair_text":null,"edited":false,"parent_id":"t1_cvzee","id":"cvzz4","timestamp_epoch":1566236778,"message_id":"50001-f5cb6ef7-67e0-4f91-9e2b-6388deceda61-1566236778"}