{"author_flair_css_class":null,"created_utc":1167103773,"score":9,"ups":9,"subreddit":"reddit.com","link_id":"t3_vzak","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"It is very difficult to explain the quality of mainstream energy policy reporting.  A sober analysis of our dependency on hydrocarbons and the realistic availability of alternatives inescapably indicates massive changes to the American way of life (for the worse, like going back in time), and quite likely famine and major strife throughout the world.  Yet the best a major newspaper can do is some fluff piece on hydrogen or ethanol. \"Don't worry, TECHNOLOGY will save the day!  The Jack discovery will save the day!\"\r\n\r\nPossible explanations:\r\n\r\n* Buzzkill facts just don't sell ads.  But this is hard to accept considering how popular sensationalist panic stories are otherwise.  Bird flu was always a joke as a real threat, but it was plenty popular with the press.\r\n\r\n* Reporters are stupid.  Understanding peak oil and its implications requires a basic grasp of physics, the history of technology over the last 150 years, and some basic math.\r\n\r\n* The American population is delusional.  Huge swathes of car dependent dedevelopment and large industrial sectors are simply non-viable in a world of more expensive energy.  We are talking about hundreds of thousands of people being reduced to paupers.  People just can't handle the truth?\r\n\r\n* There's a vast conspiracy of the elite to conceal the emerging crisis because the status quo serves them for now.\r\n\r\nI honestly have no idea what's going on.  Energy will be the defining issue of the next 20 years and you have to dig to find sober analysis and none of it's in the mainstream.  Was the press this pathetic in the preludes to WWI and WWII?","retrieved_on":1473809385,"distinguished":null,"gilded":0,"id":"cw0xf","parent_id":"t1_cw06e","edited":false,"author_flair_text":null,"author":"kkrev","timestamp_epoch":1566236778,"message_id":"50534-a2778b8d-889e-489c-9526-d4ffc089f2bc-1566236778"}