{"link_id":"t3_vzzg","stickied":false,"subreddit_id":"t5_mouw","controversiality":0,"body":"Removing Kanji from Japanese would be impossible without making major changes to the language itself. Why?\r\n\r\n1) Homonyms. A whole sh*tload of them! The above comments don't even scratch the surface of the homonym problem.What if you read this sentence with no kanji: \"Kisha no kisha ha kisha de kisha nasaimasu ka?\" It means: \"Is your reporter going to return to your office by (steam) train?\" 貴社(kisha): Your company; 記者(kisha): Reporter; 汽車(kisha): Steam train; 帰社(kisha): Return to one's office. OK, so no one uses steam trains anymore, but it makes the point: Japanese has tons of kanji that are all pronounced exactly the same. To make matters worse, since all Japanese are intimately familiar with kanji, they'll even fashion new words on the spur of the moment based on this knowledge. How many homonyms are there? There are 120 kanji that are pronounced \"kou\" and 80 that can be pronounced \"kan\". That's a theoretical maximum of 120x80=about 10000 words all pronounced \"koukan\" or \"kankou\". (In practice there are only about 20 words pronounced \"koukan\" in common use, but this is no \"'two-to-too' Oh gosh! Three words all sound the same!\" homonym issue.)\r\n\r\n2) Spoken Japanese and written Japanese are very different. Try using written words in conversation - it doesn't go over too well. Even Japanese people who use high level words in their speech are constantly having to explain which kanji they are using. This is why, as someone mentioned, almost everything in Japanese TV is subtitled. Japanese got kind of f*cked over by the importation of tons of Chinese characters some hundreds of years ago. Japanese has fewer sounds than Chinese and no tones at all. So a bunch of Chinese characters read Kou4, Kou3, Kou1, Kou2, Qiao1, Qiao2, Qiao3, Qia4 etc.  all became \"kou\" in Japanese, forever dooming the language to be inextricably bound to kanji characters.\r\n\r\n3) Japanese kanji are not that complex, and all Japanese people can generally recognize them, although they make a few mistakes just like English speakers do with English. The difficult thing about kanji in the homonym issue, not the complexity of the characters per se. Taking away the kanji and making it all hiragana would make an arleady cumbersome writing system into a sludge of homonym hell from which there could be no salvation.","author_flair_css_class":null,"created_utc":1167116802,"score":10,"ups":10,"subreddit":"science","id":"cw1eg","edited":false,"parent_id":"t3_vzzg","author_flair_text":null,"author":"Linguaphile","retrieved_on":1473809394,"distinguished":null,"gilded":0,"timestamp_epoch":1566236778,"message_id":"50817-d13c83b0-f653-475f-8117-9c9c89a1ae20-1566236778"}