{"stickied":false,"link_id":"t3_vzw8","subreddit_id":"t5_2fwo","controversiality":0,"body":"Language of Choice:\r\n\r\nPreviously, Lisp. Common lisp for \"real work\" and scheme for elegance. I preferred scheme's overall cleanliness and design but availability of libraries that I needed at the time meant most of the code I wrote was in common lisp.\r\n\r\nLately, Haskell. I tried out Haskell because lazy evaluation appealed to me as a default evaluation strategy and I wanted a functional language I could introduce colleagues to which didn't have \"scary parenthesis syntax\". \r\n\r\nI soon found out Haskell had so much more to offer which I'd never seen the appeal of before (see Paul Graham's \"blub paradox\" I guess): monads; monadic I/O; type classes; partial evaluation; and strong, static types with inference being the main ones. Using Haskell I don't even find myself missing Lisp macros much. Haskell has elegance, power and sophistication which I haven't yet seen any other language approach. See cgibbard's entry for a good explanation of how.\r\n\r\nLanguages looked at but not chosen:\r\n\r\nThe C derivative languages feel like fussing with unnecessary details though I see the appeal of dropping into C for a piece of code where speed is crucial.\r\n\r\nJava has all the tedium of C without the speed. Since I have no desire to deploy \"platform independant\" binaries I have no current interest in Java. YMMV\r\n\r\nPerl's ok but its \"weak typing\" features put me off a bit. I don't consider Perl unreadable or unmaintainable when it's written with readability and maintainability in mind; unfortunately that's the case less often than it should be.\r\n\r\nPython's and Ruby's philosophies seem to be a taking of the best features from other languages; that's fine, but after experiencing Lisp and especially Haskell those copied features seem ordinary and like old news. I don't learn Python and Ruby because I don't feel they'll teach me anything new or be more expressive. Otherwise, they seem nice enough.\r\n","created_utc":1167122171,"author_flair_css_class":null,"score":5,"ups":5,"subreddit":"programming","parent_id":"t3_vzw8","edited":false,"id":"cw1jy","author_flair_text":null,"author":"[deleted]","retrieved_on":1473809397,"distinguished":null,"gilded":0,"timestamp_epoch":1566236778,"message_id":"50895-d1c85656-ca4b-45d6-b632-f80e6a9c301d-1566236778"}