{"gilded":0,"distinguished":null,"retrieved_on":1473809399,"author":"dannod","author_flair_text":null,"edited":false,"id":"cw1p0","parent_id":"t3_w0ju","subreddit":"programming","score":12,"ups":12,"created_utc":1167127287,"author_flair_css_class":null,"controversiality":0,"body":"Java &amp; JSP -- Read on before you tell me I'm crazy, however.\r\n\r\nThe reason I like Java is precisely the same reason I hate it -- there's lots of stuff available to use. \r\n\r\nI've found that if you leverage the good stuff (Image/Media/PDF/HSSF/Lucene/etc) and ignore all the bullsh*t layers that get cemented on top of Java and JSP (JSF, most of struts, EJB, blah blah...), you can actually get a lot done pretty fast using just JSP/Java. (Once you finally get Tomcat setup). \r\n\r\nTreat JSP like PHP, leverage a re-usable set of Java classes (maybe even a taglib or two) behind that, and you're set. \r\n\r\nI've build lots of web apps (many more complex than most startup apps these days) in days or weeks, not months. They're straightforward, easily maintained and upgraded. \r\n\r\nMy tips (which will probably throw at least one Java guru into a tizzy): \r\n\r\n1. Don't write or configure a single servlet at all. Put it all in JSPs using a structure that is consistent and easy for you to use. \r\n\r\n2. Mix up your HTML and Java inside your JSP as much as you want to for your presentation layer. If you are working with people who can't decipher what is Java and what is HTML then you should probably be working with different people. If a designer gives me a nicely formatted table, I think I can handle not fucking it up with my code. Sometimes I have to use my imagination inside Dreamweaver, but nothing a little browser refreshing can't fix.\r\n\r\n3. Build a generic data wrapper for your rows of data, and then build a class that takes care of almost every add/update/delete/get scenario you use. It's just as easy to write/remember dataRow.getValue(\"name\") as it is to remember customer.getName(); Then when you do need bonus business logic on top of your objects, by all means write a class to deal with it.\r\n\r\nI did the above, and now I have a ton of Java tools that people on my team can use to do sweet stuff -- and the best part is that most of them probably couldn't get 5% on the Java certification test. \r\n\r\nWhy make it so difficult!?!? Especially with server performance becoming less and less of an issue...","subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_w0ju","timestamp_epoch":1566236778,"message_id":"50941-cf174dcf-d7be-4411-bc1f-6729454d567c-1566236778"}