{"id":"ctgjr","edited":false,"parent_id":"t1_ctgaz","author":"adoofus","author_flair_text":null,"retrieved_on":1473807641,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_tcpy","subreddit_id":"t5_6","body":"&gt; I wouldn't use Dworkin as a symbol for /all/ feminist ideology or an example for feminism.\r\n\r\nYou're right, and I wouldn't, either.  But the parent post called the attack \"gratuitous\".  It's not; there is a link.  The example I point out *informs* the feminist side of this debate in much the same way the religious right informs the conservative wing of political debate in America.  Dworkin, MacKinnon, Daly, and the like really should not be ignored or conveniently marginalized any more than James Dobson or Ted Haggard.  Academic feminism has less overt, populist power than the preachers, but the power of their ideas has truly transformed this country, for better or worse, in the last couple of decades.  They've changed the rules of the debate itself.  University Speech Codes and Political Correctness in general are examples of this.  Yes I know it wasn't all feminism: let's just say necessary but insufficient.  Really, don't underestimate the influence these ideas have and how much that influence trickles down into these very grass roots cases.\r\n\r\n&gt;...people still tend to identify feminism with a radical strain that wants to replace the patriarchy with a matriarchy...\r\n\r\nYou're right.  Feminism is about freedom.  This how it was explained to me in the early 80's when I was a man (one of *very* few) on the inside of radical feminism (no pun intended) in the Southwest US, a la Warren Farrell.  The question in my mind back then and since was and is: **\"Who's freedom\"**?  Ask yourself when feminism (academic or otherwise) last took a sex-neutral stand on something (like the ACLU would) and I think you'll have your answer.\r\n\r\n&gt; ...cut every man's balls...\r\n\r\nNever encountered that one.  Overt violence was never part of the feminist agenda, not even metaphorical violence.  Violence is male, after all, and \"cutting off balls\" is a transformation into male vocabulary or \"dialectic\", if you will.  Can't have that.  The prevailing attitude was more aptly expressed by this then-common phrase: \"If they can send one man to the moon, why can't they send them all?\"\r\n","controversiality":0,"created_utc":1165166121,"author_flair_css_class":null,"score":0,"ups":0,"subreddit":"reddit.com","timestamp_epoch":1566236759,"message_id":"5094-8360b751-8860-45b5-a2ba-79a99222e2c3-1566236759"}