{"parent_id":"t1_cw0l6","edited":false,"id":"cw1xy","author_flair_text":null,"author":"[deleted]","distinguished":null,"retrieved_on":1473809404,"gilded":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_w06q","controversiality":1,"body":"This is definitely propaganda. But not to smear anybody. Its bread and butter for somebody.\r\n\r\nThere has been a lot of such documentaries, with pre-mediated conclusions. Like in the documentary it always says \"VHP Propaganda CD\". If it would be made with neutrality it would have been \"VHP CD\". The producer clearly hates the VHP. And just gathers some things here and there in his support. I guess its not difficult to make a potent film against anybody.\r\n\r\nHaving said that, there is little doubt that VHP is an organization that is doing great harm to Hinduism. And in future it will be the one responsible for the death of hinduism in india. People will call themselves hindus but they will just resemble muslims and christians. No outsider could finish hinduism and now a so called hindu organization will do it.\r\n\r\nOne key question that this video doesnot answer is \"why do hindus at such a large scale hate mislims in gujrat\". No poniters to that. I am also not sure, but seems clear to me that these are people who have not been heard and suppressed for long, only these kind of people would hate so much. also most dont like bjp, or modi but they are just voting or supporting hinduism. i dont think its just becasue of propaganda of bjp. even if its so, why is it so successful in gujrat and not in other states. \r\n\r\n\r\nThis producer is a HIndu. most others who wrote books and made films against the roits in gujrat have been hindus. more than 200,000 hindus have been killed/looted/thrown out of kashmir valley. these people are living in camps for about 17 years. no documentaries, no books, no organizations for their cause. VHP is the only org that goes to them although their support is like- give something for photo shot and then take it back. because there are no people who would pay you for making anything on them. whereas if its christans and muslims there is tons of money. \r\n\r\nLast thing. did you notice that comment on the movie page, \"that this kind of news about india is not part of the main-stream media\". Why do you have to bring it to US people. how can it help the people in gujrat. one of those guys who will sell their moms for a little profit.\r\n\r\n\r\n\r\n\r\n","score":1,"ups":1,"created_utc":1167137269,"author_flair_css_class":null,"subreddit":"reddit.com","timestamp_epoch":1566236778,"message_id":"51042-7d7fa4da-950e-4e16-9706-fa1b554e71d3-1566236778"}