{"gilded":0,"distinguished":null,"retrieved_on":1473809404,"author":"berberine","author_flair_text":null,"id":"cw1yf","parent_id":"t1_cw1n8","edited":false,"subreddit":"reddit.com","score":8,"ups":8,"created_utc":1167138030,"author_flair_css_class":null,"body":"The problem is, no one pays attention to the date on the checks. I always write he rent check out for the first of the month and I commonly have it cashed by the landlord anwhere from the 26th-31st, depending on when it actually got to them.\r\n\r\nMy landlord is a company that is about 65 miles away.  They only take checks or money orders.  They refuse cash and you can't use credit.  So, my check goes through their bank and my bank before the first of the month.  Just always make sure the money is in the account because no one looks at the date anymore.\r\n\r\nI find that we keep checks for two reasons:\r\n1) There have been a lot of breaches in the last couple of years with banks losing their customer data, especially as it pertains to online banking.  People fear this and want to rely on the old paper check standby because it's been very reliable for them.  It doesn't matter if there's a debate as to whether paper vs electronic is safer, almost everyone knows the paper system and understands their protections under the law.  Electronic rights are murky for most people.\r\n\r\n2) The baby boomers here are reaching retirement age.  There are literally millions of them.  Thy are slow to change technologies and, even when they do use them, still fear that something is going to happen.  For example, if I have a problem with a paper check, I go to my bank and get it taken care of ASAP.  If I do electronic banking with my bank in town and have a problem, someone in India answers the line to take care of my problem.  Most boomers hate this and refuse to deal with it.\r\n\r\nThey are a big portion of the population and banks don't want to piss them off.  I do not think we are going to see a change to electronic transfers for a long time.\r\n\r\nMy bank also offers me free checks whereas I have to pay ten cents for every electronic transfer I make.  My bank has been breached twice in the last three years, which only affected their electronic customers.  The only bill I could even pay online is my cable TV bill.  None of my other bills do electronic banking, therefore, it's pretty useless to me.\r\n\r\nNo, I cannot just switch banks.  The only other bank in town sucks even more.\r\n\r\nSo, if you want to get rid of checks in the USA, get better security and educate people more.  People, in general, are afraid of change, especially when it comes to risks to their financial situations.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_w14h","timestamp_epoch":1566236778,"message_id":"51054-bfc34b46-6105-4e4a-8f33-e2627183c6c3-1566236778"}