{"gilded":0,"retrieved_on":1473809422,"distinguished":null,"author_flair_text":null,"author":"nosoupforyou","id":"cw2y6","edited":false,"parent_id":"t1_cw2u3","subreddit":"reddit.com","created_utc":1167161482,"author_flair_css_class":null,"ups":1,"score":1,"body":"I sort of assumed that lobbying by donations or gifts wouldn't be allowed, but I should have made that clear.\r\n\r\nIf someone can't be re-elected, there's no need to \"fund\" his re-election campaign, hence no real way to donate to the guy without it being clearly a bribe.\r\n\r\nThat's a huge part of the problem today.  Elected officials need cash for campaigning.  There's very little in the way to detect whether a campaign donation is to buy a vote or just to help keep your favorite senator in office.\r\n\r\nEliminating independent campaign finances is one method that has been suggested as a way to eliminate bribery, but the problem with that is that means the federal government would have to cover the cost of campaigns.\r\n\r\nEliminating the need to campaign at all would solve this entirely.  Yes, I'm sure there might be ways for lobbying groups to bribe some folks, but not nearly as many.\r\n\r\nLobbying would sharply decrease since there would be a much lower way to do it aboveboard.\r\n\r\nAttempts at bribing someone could succeed, but it would only take one honest official to sqawk and shut down that group.\r\n\r\nBribing someone with the hope that that they vote your way might not succeed.  What's to keep someone from accepting the million bucks and then voting the other way?  It's not like they are going to be in office long anyway.\r\n\r\nYes, there might be corruption but I think the room for corruption is a lot smaller than the existing corruption we have now.  We'd eliminate the old boy network entirely this way too.\r\n\r\nBtw, regarding who would be eligible, it would be any citizen over 18 that hasn't yet served and isn't currently either in prison or on parole.  Convicted felons, as long as they have completed their sentences, would be eligible too.  Obviously someone accused of a crime and awaiting trial wouldn't be eligible either.\r\n\r\nI'm not exactly sure how we'd generate the pool of names though, so it might be necessary to let people register.\r\n\r\nObviously there would be problems with the idea, but I think there would be a lot fewer than with what we have today.","controversiality":0,"stickied":false,"link_id":"t3_vic7","subreddit_id":"t5_6","timestamp_epoch":1566236778,"message_id":"51577-b7a81cba-d8f4-4a12-9b84-58dbeaba03cf-1566236778"}