{"subreddit":"reddit.com","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1167161856,"body":"&gt; The subconscious is not, as far as I am aware, considered to employ ration. \r\n\r\nThat depends on what you mean by \"employ\".  Each of our emotions obviously exists for a good rational reason.  I think every one can see how Fear, or Jealousy, or Love can advantageously influence a person's actions to the point where he/she has a selective advantage thus accounting for how emotions evolved.  Really, if one looks at emotions, from a structural perspective the only difference between them and more rational mental processes is that Emotions respond in predefined ways to predefined classes of stimuli.  Conversely, Reason adaptively builds models based upon unbounded stimuli leading to unbounded reactions. Therefore, as I see it, Emotions merely act upon a fixed model, whereas Reason acts upon a adaptive model.  This means Reason is, or at least can be, far more flexible and applicable to unmapped situations.  Emotions are faster and can operate on very little data if the situation is applicable since their model is already built.  I've never understood the drive to elevate Emotions to the Mystical. \r\n\r\n&gt; Emotion in the conscious mind is not part of ration either, yet I think that most would agree that it can play a role in art. A work of rational content, as I see it, would need to be something along the lines of a justified written argument, which I personally wouldn't place into the definition of \"art\".\r\n\r\nI'm fairly certain I don't understand the above paragraph.  Are you saying that being rational makes something non-art?","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_ufsk","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473809422,"author":"Lucretius","author_flair_text":null,"id":"cw2ym","edited":false,"parent_id":"t1_cvry4","timestamp_epoch":1566236778,"message_id":"51583-fd341772-d9e0-4851-96d7-e6d3403987ac-1566236778"}