{"subreddit":"reddit.com","created_utc":1167163636,"author_flair_css_class":null,"score":1,"ups":1,"body":"He possessed literature on how crimes are investigated?  So what?  That could amount to a crime novel.  As circumstantial evidence goes, that's really lame.\r\n\r\nBeing evasive and non-cooperative?  Isn't that pretty much a judgement on the part of the investigating cop?  Some of these guys claim the person they are investigating is evasive and non-cooperating simply because they ask for a lawyer.  Hell, it's not any kind of evidence, much less even circumstantial evidence, to be \"evasive and non-cooperative\".\r\n\r\n\"They were in a bitter divorce.\"  Again, not even circumstantial evidence.   Who claims it was bitter?  The cops?   This is merely a possible motive and NOT any kind of evidence.\r\n\r\n\"There were recommendations of getting a restraining order against him.\"  But no actual order?  Who recommended it, some cop or her divorce lawyer?  What's the story behind it?  Since there were no facts behind this, such as \"he's accused of beating her, so she was about to get a restraining order\", I suspect this one is just so much bullshit.\r\n\r\nAbout the only \"evidence\" you show is that her last known location was at his house.  Even that isn't really that weird, since they were still married.\r\n\r\nHis missing car seat isn't any kind of evidence either.  One of my car windows is broken and stuck down.  Does that make me a murderer?\r\n\r\nThe blood on his car might be evidence, but I know I've bled on my car.\r\n\r\nHe'd be a pretty stupid murderer to plan to kill his wife and make the mistake of letting her body bleed on his front seat and his car, and leave a book on criminal investigation around his house.  If he did it in anger and hid her body, he sure farked up by making obvious mistakes.  Why would he take the trouble to remove his car seat but NOT run it through a car wash?","controversiality":0,"stickied":false,"link_id":"t3_vr8x","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809424,"distinguished":null,"author_flair_text":null,"author":"nosoupforyou","edited":false,"id":"cw30w","parent_id":"t1_cvune","timestamp_epoch":1566236778,"message_id":"51616-632a0069-0816-4018-aa12-2b05971af307-1566236778"}