{"author_flair_text":null,"author":"[deleted]","id":"cw3bn","parent_id":"t3_w3b8","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809429,"controversiality":0,"body":"Quote from [Iraq 2: Here Comes the Dumb-Ass Sequel](http://www.exile.ru/2002-July-25/war_nerd.html)\r\n\r\ndate: 2002-July-25\r\n\r\n&gt;So we're gonna go back into Iraq now, to clean up the malpractices from our first cool, clean, surgical operation. And of course that's gonna fuck things up about a hundred times worse. This time they have to get rid of Saddam; the Israelis, for one, won't have it any other way (and the Bushes made it pretty obvious: they're with the Israelis, once and for all.)\r\n\r\n&gt;No Saddam means crazy Kurds, crazy Shiites, scared Saudis, angry Wahhabi loonies, desperate Palestinians...it means we go right up close to the ol' hornets' nest and hit it again with a big, big stick.\r\n\r\n&gt;**Boy, it sure is hard to predict what'll happen then, huh?**\r\n\r\n&gt;That's IF the abu Cheney clan of the desert oil wells is dumb enough to really do it, really send in 250,000 troops to take Iraq. Militarily it'll be a joke. You could do it with a battalion of SAS. Those Iraqi soldiers were surrendering to camera crews. That's the easy part.\r\n\r\n&gt;**The hard part is making up a new happy Western Iraq. Won't happen; can't happen. Anybody who ain't thick as two planks knows that. So will they do it? Are they really that dumb?**\r\n\r\n&gt;Well, all I can say is, I used to live in Bakersfield, and I knew a WHOLE lotta Okies whose dads were in the oil business. The \"ah'l bidnezz,\" as they called it. And lemme tell you: those boys were so goddamn dumb, and so goddamn religious, they make the Saudis look like little Bohemian university people.\r\n\r\n&gt;**So yeah. They're dumb enough. They're way, way, WAY dumb enough.**","subreddit_id":"t5_6","stickied":false,"link_id":"t3_w3b8","subreddit":"reddit.com","score":4,"ups":4,"created_utc":1167170205,"author_flair_css_class":null,"timestamp_epoch":1566236778,"message_id":"51759-4ca15b01-6e18-4e7a-836e-5d65b7c5516c-1566236778"}