{"parent_id":"t3_w37e","edited":false,"id":"cw3ng","author_flair_text":null,"author":"redrobot5050","retrieved_on":1473809437,"distinguished":null,"gilded":0,"link_id":"t3_w37e","stickied":false,"subreddit_id":"t5_6","controversiality":1,"body":"While I am a die-hard nintendo fan, the Wii, if its lucky, will be a \"second place\" or \"third place\" machine, again. When Sega and Sony were going to CD based media, Nintendo faulted with the N64 and cartridge based releases. A lack of a hard drive in the Wii is going to bite it in the ass when bigger games than bowling come along -- and the load times increase like crazy to compensate. \r\n\r\nThe PS3 had slow sales. That's to be expected at the PS3's price point. But the point is that the Xbox 360 is finally going to face some competition. Its not over, it's just getting started. More people game in Japan than in the US, and whether they choose the PS3 or the 360/Wii will no doubt determine where a lot of gaming studios decide to develop. Keep in mind, while the Xbox 360 is more affordable, it lacks HD capability. If the japanese decide they DO want a gaming appliance that also plays back HD movies, and if so, then the PS3 is the only game in town. \r\n\r\nThen again, I won't discount that Blu-Ray could end up like another Sony format: Mini-Disc. Popular in Japan, but virtually unknown and unsupported anywhere else.\r\n\r\nThe bottom line is that its too early to call a winner for the next generation. In fact, for most people, who do not own an HDTV, there's really no reason to upgrade to the next generation yet. Other than that Wii, which offers new interactions and an innovative form of gameplay, all current HD games look like they could've been done on the older system. Gears of War could've been done on an Xbox with slightly less eye-candy.","author_flair_css_class":null,"created_utc":1167177810,"score":-4,"ups":-4,"subreddit":"reddit.com","timestamp_epoch":1566236778,"message_id":"51967-aed911f5-7a26-49e8-8590-2e0caf8c59c1-1566236778"}