{"parent_id":"t1_cw16e","id":"cw3pc","edited":false,"author_flair_text":null,"author":"ubernostrum","distinguished":null,"retrieved_on":1473809437,"gilded":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_vzw8","body":"Obligatory response from someone who used to do Perl and now does Python:\r\n\r\nThe CPAN is great. Or, rather, it would be if more than a few dozen of the things in it could actually install successfully from CPAN. I've had one too many packages die on a test suite or an aborted install routine, and seen one too many packages which appeared to have been assembled by blind, physically crippled chimpanzees. Sure, there's some stuff in CPAN which will install and work flawlessly, but in my experience that's a small fraction of the totality and Sturgeon's Law wins in the end.\r\n\r\nPerl certainly isn't any more maintainable than any other language. Well-written Perl which uses a consistent style and consistent conventions is maintainable, but well-written `$ANY_LANGUAGE` which uses a consistent style and consistent conventions will, most of the time, be maintainable.\r\n\r\nAnd there are plenty of warts in the language. Complex data structures are difficult to create and work with. Fundamental language features are controlled by mystical dollar-unicode-symbol global variables. The sheer number of operators and evaluation contexts basically turn learning Perl into a memorization game, and turn reading Perl into a guessing game. So I fled.\r\n\r\nAnd now I use what works for me, which happens to be Python at the moment. If Perl works for you, that's cool. But don't pretend that there's anything objective in that judgment; the best any of us can ever say about any language is \"it works for me right now\", and there's no guarantee that the next time we sit down to hack won't be the final straw with random broken thing X which drives us to switch to something else, and even while things are working for us there will be plenty of others with grudges to bear over the little things that finally drove them batty.","controversiality":0,"score":7,"ups":7,"created_utc":1167179223,"author_flair_css_class":null,"subreddit":"programming","timestamp_epoch":1566236778,"message_id":"52005-9cb5e612-09b6-48e6-9e08-64d5a668351f-1566236778"}