{"subreddit_id":"t5_6","stickied":false,"link_id":"t3_w3zr","controversiality":0,"body":"&gt; The difference between a democracy and a dictatorship is who controls the armed forces. Civilian command of the Army is a cornerstone of our democratic system.\r\n\r\n&gt; My brother told me that he takes his oath to defend the Constitution seriously and that he will fight and die if necessary to honor his commitment. \r\n\r\nAh...ahahahahaaHAHAAHAAHAAAA....\r\n\r\nOh wait, is he serious?  Civilian command of our Army?  Defend the Constitution?  (jesus...)\r\n\r\nAt least, while naive, he understands at least what is important...\r\n\r\n&gt; When I asked him if he would be offended if I participated in activities opposing the war, he replied that it was not only my right but my obligation, and the obligation of all civilians opposing this war, to try to change bad policy. \"Give us good wars to fight,\" he said.\r\n\r\nHow about diplomacy instead of enforcing our will via the end of a gun, restore the military TRULY to civilian (how about public) control and prevent our government from ever being able to disregard the Constitution willy-nilly ever again, and I'll curb my laughter...it's the only thing keeping me sane while the things I thought the US stood for dissolve around me...\r\n\r\n&gt; My brother is betting his life that you are not going to ask this of him.\r\n\r\nNo, I would never ask him to throw his life away so my legacy isn't one of plunging Iraq into a lawless melee of murder and destruction.  But my name isn't King George.  No one controls George and his buddies from the PNAC.  We have no control over him, Congress has no control over him and the supreme court is packed with his bitches.  If he doesn't like a law, he ignores it.\r\n\r\nRemember, we saw this before once...\r\n\r\n&gt;  ... when the president does it that means that it is not illegal - Richard Nixon","score":2,"ups":2,"created_utc":1167187763,"author_flair_css_class":null,"subreddit":"reddit.com","parent_id":"t3_w3zr","edited":false,"id":"cw411","author":"gaso","author_flair_text":null,"distinguished":null,"retrieved_on":1473809442,"gilded":0,"timestamp_epoch":1566236778,"message_id":"52191-7da5407d-2dc8-4673-9c3d-425a41125c7d-1566236778"}