{"gilded":0,"retrieved_on":1473809453,"distinguished":null,"author_flair_text":null,"author":"seb_d","id":"cw4iw","edited":false,"parent_id":"t3_w3n5","subreddit":"reddit.com","created_utc":1167202291,"author_flair_css_class":null,"score":32,"ups":32,"body":"Long time Reddit reader, just registered an account to comment on One World Cafe. I lived in SLC for a few years, and was a regular patron - I'd go in on Saturdays, have a chai tea and oatmeal cookie, smoke cigarettes with it, and then go get a massage next door at UCMT. How's it work? The article doesn't mention a couple things:\r\n\r\n*The biggest factor is it's right next to UCMT - The Utah College of Massage Therapy. On weekends, UCMT offers one-hour massages with in-training masseuses for $25 an hour. Once or twice a month, they offer two for one on that (and you can just grab a stranger there and take the deal). So $12.50 an hour for a not bad-at-all massage. Most people going to One World are about to get a massage or in euphoria zone afterwards.\r\n\r\n*There's no real reason to walk past One World unless you're going to UCMT or know it's there. So the chances of random passerbys taking food without paying are low.\r\n\r\n*Very low overhead: The place is part of a house which has been converted. I think the patrons might even still live upstairs, or perhaps not. But yeah, food isn't wasted, they don't pay salary, they already own the place outright, and everything else is mitigateable. The place is pretty well-lit, I'd hazard a guess they don't even use much power.\r\n\r\n*The place is very appealing to a \"hippy\" sort of crowd who finds the idea so incredibly charming that they overpay. A person embodying the \"corporate stereotype\" wouldn't be caught dead in the place. So the clientele is the kind to pay for things.\r\n\r\n\r\nAnd... the quality is damn good, and the people there are extremely friendly and charismatic. The average person, not knowing what to pay, actually overpays a little. Also, lots of the hassles of restaurants that make the experience less enjoyable - checks, figuring out what to tip if anything, tax, even getting change - are removed. People grab whatever they want, so they don't mill around and think for ages... things move quickly but at a relaxed place, it's not a bad to run by any stretch.\r\n\r\nThey say the first three things you need for a successful business are location, location, location. This could be replicated in a number of places, but a good location would be crucial. The top canidate off the top of my head to make another would be San Francisco - what you'd need is a location with a draw that's appealing to people who enjoy the novelty of the no price structure and of people who are somewhat wealthy - the massage school does this. It's gravy if the location also produces euphoria - like again, the massage school, or perhaps a hookah bar, salon, or spa. Then you'd need low overhead, and you'd be in business.\r\n\r\nTruly, a lovely place, and a fascinating business model. I hope more places open like it - I'd pay whatever I had on me when I went in, underpaying when I was short on cash, and overpaying later to make up. It also creates a nice ambiance and community feel... the experience isn't really for the food, it's for the culture and atmosphere. People taking food and leaving without paying, due to the setup, would feel extremely uncomfortable doing so, and you really need to go out of your way a bit to go to One World. Great place.\r\n","controversiality":0,"stickied":false,"link_id":"t3_w3n5","subreddit_id":"t5_6","timestamp_epoch":1566236778,"message_id":"52489-e0f168e0-beaa-4c7d-8570-348bbfd3064c-1566236778"}