{"author_flair_css_class":null,"created_utc":1167208205,"score":2,"ups":2,"subreddit":"programming","link_id":"t3_vzw8","stickied":false,"subreddit_id":"t5_2fwo","controversiality":0,"body":"I agree that Perl is quite a lot of language to keep in your head(0), but -- over ten years into it, with several very lengthy vacations from it -- I haven't had the 'ESR experience' of forgetting the language and boggling at my own code.  And as you say, the best way to proceed with any programming is *idiomatically*, and one of the best use of a programmer's spare time is discover these idioms(1).  But I disagree about the warts: Perl doesn't call them that &lt;0.5 winks&gt;, and most of them only affect newbies (a great concern to Python, I understand!).  I also disagree about the data structures: [Perl](http://perldoc.perl.org/perlref.html) has [an](http://perldoc.perl.org/perllol.html) easy [time](http://perldoc.perl.org/perldsc.html) of them, especially with autovivication.  And the mystical variables are all under perlvar -- and all easily identifiable, being 'mystical dollar non-unicode symbol variables'; Perl gives $you many @hints as to what you're dealing with.\r\n\r\n0] I observed once that it had *fractal complexity*, after discovering that _ (an underbar), by itself, refers to the most recently-used filehandle.\r\n\r\n2] An IRC acquaintance once lamented this about some coworkers: they were good programmers who used Perl well, but they came across as somehow 'not with the cool kids' -- so they wrote oddly, and unidiomatically, and they often didn't make use of exceptionally good modules in situations that beg for them.\r\n\r\n(Changed two personal-style footnotes to parenthesized bastards due to markdown's completely bizarre misparse.  BTW, Paul Graham, it would've been nicer if you'd pointed everyone towards a site run by people who suck less completely than this lot.)","retrieved_on":1473809456,"distinguished":null,"gilded":0,"edited":false,"id":"cw4p4","parent_id":"t1_cw3pc","author_flair_text":null,"author":"ayrnieu","timestamp_epoch":1566236778,"message_id":"52600-ca71933f-3463-4751-a8bd-2ecd47b84e76-1566236778"}