{"body":"&gt; Either the newly 'privatized' organizations are saddled with so much regulation and/or restrictions that they cannot continue without the assistance of government\r\n\r\nWhat happens is that bare minimum standards are set as a safeguard (e.g. performance or safety targets) and this is quite proper (e.g. a railway can't have all the trains running late or crashing as apart from anything else it would be ruinous to the economy). An efficient organisation should easily be able to exceed these standards but that is not what we see in practise.\r\n\r\n&gt; or they are 'privatized' into the hands of those with good government connections that usually destroy the company by looting it blind\r\n\r\nI wouldn't entirely disagree but it's surely a good argument for the new owners being 'saddled' with these targets.\r\n\r\n&gt; Bureaucracies exist to perpetuate themselves, always consuming more year after year.\r\n\r\nThis simply isn't true. Budgets are often cut or not even kept in line with inflation (in the UK at least).\r\n\r\n&gt; In a bureaucracy, efficiency isn't rewarded, it is punished: for an efficient bureacracy is one that cannot ask for more money the next year.\r\n\r\nThis is a crass tabloid generalisation of how these things work. Haven't you heard of budget negotiations and reviews?\r\n\r\n&gt; Therefore, government bureaucracies usually have way too many people doing way to little, inefficient infrastructure, wasted capital, and other serious problems that must be dealt with when privatized. These issues also add to the difficulties facing any privatization effort.\r\n\r\nThe irony is that when it comes down to it, every privatisation attempt adds huge layers of administration and general bureaucracy. This is usually as a result of trying to measure every aspect of performance minutiae on the entirely ideological and baseless assumption that the organisation is wasteful at every turn (the Victorians used to go in for this kind of thing until they learnt that it didn't give any useful information while degrading performance and demoralising workers). You might want to consider that public sector salaries are much lower than the private sector for a start when looking at value (and also  what this says about the work ethic and motivation of those staff). Everybody has had some bad experience of public services and likes to have a moan - it turns out that most of these organisations have been very lean but overstretched rather than wasteful and complacent.","controversiality":0,"stickied":false,"link_id":"t3_w2wl","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1167223743,"author_flair_css_class":null,"score":1,"ups":1,"author_flair_text":null,"author":"chu","parent_id":"t1_cw3z6","id":"cw54x","edited":false,"gilded":0,"retrieved_on":1473809464,"distinguished":null,"timestamp_epoch":1566236778,"message_id":"52815-624c711a-3186-4144-a305-e802413faa50-1566236778"}