{"stickied":false,"link_id":"t3_w5ls","subreddit_id":"t5_6","controversiality":0,"body":"The whole of the article can be summed up in two quotes from the beginning:\r\n\r\n&gt;The social legitimacy of capitalism thus lies in the fact that capitalists undertake investment. \r\n\r\nThe descriptor: \"social legitimacy of capitalism\" is absurd.  It's like saying the \"military legitimacy of bananas\".  Capitalism WORKS.  Whether it works for \"legitimate\" reasons or not is irrelevant.  The simple truth is that Power Corrupts.  Management, whether it be of a society, an economy, or a political process, requires power and thus causes corruption.  Market forces on the other hand, are unstable.  If a company or industry should accumulate enough power to become corrupt, that corruption invariably leads to a loss of market-share and thus a loss of power.  (The fall of Enron, or the backlash against Wal-Mart come to mind as an typical examples).  This self-correcting mechanism is a source of more \"legitimacy\", if there is such a thing, than reinvestment.  The public sector has elections that try for this sort of self-correction, but elections are a game that can be played far more easily than the market can be played... Witness how election results can be forecast with accuracy by analyzing funding rather than message.  Witness how Incumbents are almost always favored to win: evidence of less feed-back from the voters than from consumers.\r\n\r\n&gt;The view that capitalists may operate enterprises better, even if this were true, will not in itself justify their social existence, if the surplus value produced under such better operation was fully or largely consumed. Their running enterprises better will then have relevance only for their own private consumption, but none for society as a whole.\r\n\r\nWhat a ugly statement!\r\nWhy doesn't the author come out and just say: 'You shouldn't be aloud to have what you want!  Society must protect you from yourself!' \r\nThe author is so concerned with \"society as a whole\" that he seems to have forgotten that it is composed of individuals each of whom cares quite a bit about \"their own private consumption\"! That people have the power to produce a surplus and consume it for their \"own private consumption,\" is an ADVANTAGE of capitalism not a failure!  If the author wants to improve society, he should start by empowering individuals, and leave the \"whole\" of society to tend to itself.  \r\n\r\n\r\nI'm not a complete raving capitalist, the public sector can serve a useful function as a part of a Capitalist society.  The most important of those functions are (listed in order of importance): \r\n\r\nProvide for the common defense.  (The consumer and investor base needs confidence that a nation will continue to exist before they put their money into its industries.)\r\n\r\nEnforce contract law.  (This is the basis for almost everything in business.)\r\n\r\nProvide a free alternative to private education.  (Education leads to sophistication of consumers and thus counters the effectiveness of advertisement.)\r\n\r\nPrevent monopolies and trusts.  (Capitalism = Competition, it's that simple.)\r\n\r\nBuild and maintain infrastructure.  (Things like the Interstate system would have been very difficult for private industry to build.)\r\n","created_utc":1167238098,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","parent_id":"t3_w5ls","edited":false,"id":"cw5ur","author_flair_text":null,"author":"Lucretius","retrieved_on":1473809480,"distinguished":null,"gilded":0,"timestamp_epoch":1566236778,"message_id":"53198-c7776fac-2199-4a4f-97f7-d6aee9b04e77-1566236778"}