{"id":"cw5w3","edited":false,"parent_id":"t1_cw4h8","author_flair_text":null,"author":"tndal","retrieved_on":1473809480,"distinguished":null,"gilded":0,"link_id":"t3_w2ys","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"There's not one statement of truth in hopeseekr's post:\r\n\r\nThere is no nuclear power plant in or near Beaumont! \r\n\r\nPerhaps hopeseekr is talking about one of the nuclear power plants in Texas. We will assume so to show how wrong he is.\r\n\r\nAll nuclear power plants shuts down periodically. There's a power grid in Texas: customers can (and do) get their power from other power plants in Texas easily. \r\n\r\nAny A-bomb can leave fallout. But it would be localized and would not be a problem after about 2 weeks. \r\n\r\nThe prevailing winds in Southeast Texas are toward the South and Southeast. The idea that fallout would reach California is just nuts.\r\n\r\nMost of Texas' port cities are at least 50 miles from any nuclear power plant. All would be unaffected. Shipping trade  in those cities would increase, since aid and rebuilding would be necessary. \r\n\r\nRefineries would be unaffected. They're built very sturdily, can withstand high winds and are sufficiently distant from Texas' nuclear power plants that they would be unaffected. These refineries can run virtually unattended. Even with fallout present production would continue. \r\n\r\nThose at the blast site would die, some nearby would die of radiation poisoning. But most would move out of town for 2-5 weeks and then come back. My estimate of casualties: 100 dead max immediately, 50 dead later (radiation sickness), 1000 sick.\r\n\r\nThe Strategic Oil Reserves are underground. They're hardened and sufficiently distant from any nuclear power plant that they would be unaffected. \r\n\r\n","author_flair_css_class":null,"created_utc":1167238672,"score":3,"ups":3,"subreddit":"reddit.com","timestamp_epoch":1566236778,"message_id":"53217-f443d605-63df-4e7d-a79a-120fa7a0cc34-1566236778"}