{"gilded":0,"retrieved_on":1473809480,"distinguished":null,"author":"Lagged2Death","author_flair_text":null,"id":"cw5wn","parent_id":"t1_cw4tj","edited":false,"subreddit":"reddit.com","created_utc":1167238974,"author_flair_css_class":null,"score":13,"ups":13,"controversiality":0,"body":"&gt;None of you have countered any of my points...\r\n\r\nThe \"points\" that I've seen you make are:\r\n\r\n1) Economically speaking, selfishness is good.\r\n\r\n2) This isn't selfish. Or perhaps it *is* selfish, but it also evades traditional economic quantification by mixing up quantifiable and non-quantifiable costs, and that's sneaky and bad, for some reason that you haven't been able to specify clearly.\r\n\r\n3) Therefore anyone who likes the idea is a smelly longhair pinko tree hugger commie radical hippie Castro-loving scumbag whiner moron junkie loser.\r\n\r\n4) And it's not nice to call people names.\r\n\r\n&gt;You all think you're so clever, but all you're doing is replacing monetary costs with other costs not stipulated in your tree-hugging manifesto.\r\n\r\nSo what? You yourself point out that the flow of money does not adequately model the value of or explain the motivation for all human behavior. Manners, social graces, community, conscience, charity, friendship, and individual and public health are all important; none are really quantifiable in dollars. This style of restaurant recognizes the need to stop *trying* to quantify these things in dollars while simultaneously recognizing the need to keep the organization afloat economically. So they're trying a different way of running the place that serves those goals. One that *maximizes* the owner's *utility*, by the way.\r\n\r\nAnd for some reason, the idea that affluent people might end up underwriting some cheap or free soup for poor people -- at Christmastime, no less -- just makes you *livid*.","stickied":false,"link_id":"t3_w3n5","subreddit_id":"t5_6","timestamp_epoch":1566236778,"message_id":"53231-3bce5fe0-35be-4f14-a9be-5628b276eb5b-1566236778"}