{"author_flair_text":null,"author":"ajiusdc","parent_id":"t1_cw3lp","id":"cw65d","edited":false,"gilded":0,"retrieved_on":1473809484,"distinguished":null,"body":"Actually, the responsible party in making terrorism synonymous with terrorism and black synonymous with crime is the media.\r\n\r\nTerrorism&lt;br&gt;\r\nEver heard of Timothy McVeigh? And that yahoo in the chicago area that killed up a couple of folks a couple of year ago? And the various militia groups not to mention the KKK and the IRA? Terrorism is not exclusively muslim or even mostly muslim. It is simply that as a christian nation (and yes I am Christian, Southern Baptist, in fact) it is easy for us to demonize another religion, but when someone that looks like us or worships like us commits an act of terrorism then he is a lone wack job. When someone named muhammed does it, on the other hand, he is a representative of his race.\r\n\r\nCrime&lt;br&gt;\r\nPLEASE spare me the black people commit more crime bullshit. Black people are more likely to do time, not commit more crime, period. Did you read the article about the kid doing 10 years for basically stealing a dollar and smoking some joints while a prostitute killer/coke head went free? By the same judge? It was right here on reddit. And what about the the Bush daughter/niece from Florida? The cokehead that keeps getting busted and keeps stealing and violating parole and what have you and keeps getting another chance. The simple matter is that a black person, actually, a poor person, or ill-spoken, or unattractive (in the eyes of the judge and jury) person has a lot better chance of going to jail than someone who is well-spoken, or well-off, or even good-looking. \r\n\r\nSo no, it isn't black peoples fault or muslims fault, anymore than it is the Irish's fault that they are viewed as belligerent drunks, or women's fault that they are seen as irrational, or all geeks' fault that they are seen as socially inept or... ok maybe the last one is true...","controversiality":1,"link_id":"t3_w367","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167243326,"score":1,"ups":1,"timestamp_epoch":1566236778,"message_id":"53370-60305977-a3df-4f0d-9571-6da1acacee22-1566236778"}