{"author_flair_text":null,"author":"whoop","id":"cw6dw","edited":false,"parent_id":"t1_cw64v","gilded":0,"distinguished":null,"retrieved_on":1473809490,"controversiality":0,"body":"d3wd, i mean doofus, that 6% figure for Apple is market share based on current sales, not the total installed base.\r\n\r\nlikewise with linux:  they have puny sales figures due to the fact that most linux installations are done by users after PC purchase.  \r\n\r\nMS does NOT have 90%+ market share, it's all FUD to keep people from switching to other OS platforms. plus most of the sales volume in those figures is due to the massive corporate monopoly MS enjoys. now with vista costing more ($399 for ultimate) than the hardware, it'll only drive more people to OSX and Linux.  that $399 premium makes apple hardware price competitive with generic windows vista PCs from major retailers like Dell &amp; HP.  so most people will have to settle for the crippled home version or seriously look elsewhere\r\n\r\nto give an example of how skewed these MS numbers are, consider the mozilla/firefox figures are stated at only 10-15% ... while my website has gotten over 60% for almost two years and has risen to over 70% currently.  the IE numbers i get are below 10% and shrinking... due to the lack of any corporate material on my website.  and only 46% of the moz/FF volume is windows, linux is 44% and OSX, BSD, etc is the rest.  other people i've asked get similar stats.  \r\n\r\nit seems to be only the giant massive youtube sized sites that get big MS numbers due to the number of lamers who just sit around and surf these well-known time-killers of corporate monotony while at work.  most corporate workers are too stupid to have any real interests so they just shop online and play video and mp3 files","subreddit_id":"t5_6","link_id":"t3_w5a6","stickied":false,"subreddit":"reddit.com","score":-8,"ups":-8,"author_flair_css_class":null,"created_utc":1167247071,"timestamp_epoch":1566236778,"message_id":"53491-dbe4c984-ab9c-4185-8484-76023235fd4f-1566236778"}