{"subreddit":"reddit.com","created_utc":1167261692,"author_flair_css_class":null,"score":2,"ups":2,"body":"Hello out there, it's  me the author of the article.\r\nI am delighted that you are reading and caring. I felt the same way when I was researching and interviewing: it's sort of like your brain can barely wrap itself around the concepts, it so contradicts whatever we've all been doing nutritionally and the people we've been trusting and relying upon to guide us. \r\nThe message in all of it is that 70's bumper sticker: \"Question Authority.\"\r\nQuestion me, too. I'm now an expert and an authority. I WANT to be challenged, I want to learn more and hear more and am wide open to accept new facts, whether contradictory or otherwise.\r\nIf you want the most brilliant and damning source for everything I said, go to CatChatRadio.com and look under \"Links\" and then under \"Nutrition.\" It's all sensationally laid out in the article from Harvard Law School.  \r\nBeing mad at me is precisely what I expected. Don't blame, you, you've got to be mad at someone when you hear this and I know the messenger often gets shot. But being snotty and cynical and pointing a finger is a shame, though. I'm not \"plugging\" my radio shows folks, there is absolutely no money in them for me. One is Sirius Radio - Martha Stewart Living Radio pays me what is basically an honorarium for the hour show CAT CHAT every week; my other radio show is on NPR - and no money changes hands at all, because they are actually producing and broadcasting it and waiting for the sponsorship to cover the costs. So NOBODY can take a higher road than I can in this debate. I mentioned the shows so you could come listen, or download from the website of \"Dog Talk\" to get more information or call in. I spend a great deal of time and my own money keeping those websites constantly brought up to date, adding things every day  and including everybody's emails and my answers to them. So call in folks! Cat Chat is tonight and every Wednesday, LIVE at 8 PM (EST) 866-675-6675 - come join a community of people eager to learn and improve their pets' lives. THAT is how i profit and get paid.","controversiality":0,"stickied":false,"link_id":"t3_w64z","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809505,"distinguished":null,"author_flair_text":null,"author":"tracie","edited":false,"parent_id":"t3_w64z","id":"cw76c","timestamp_epoch":1566236779,"message_id":"53952-35473e66-9a76-4911-9be9-0420be75b123-1566236779"}