{"parent_id":"t1_cw3mk","edited":false,"id":"cw7kb","author_flair_text":null,"author":"Random","retrieved_on":1473809512,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_vwol","subreddit_id":"t5_6","controversiality":0,"body":"First of all, the first line of the article says the islands are at the confluence of two rivers. Given that they are water-level islands at the confluence of two rivers with a very well documented delta system, these are pretty much defined to be dynamic islands. The alternative hypothesis is that they are islands that are exactly at sea level but are bedrock (e.g. Indian crust) but that isn't really very likely given that India is dynamic anyway (India-Himalayan collision). \r\n\r\nSecond, the documented amount of sea level rise so far is so close to zero that saying it 'caused' anything like this is hardly credible. See:\r\n\r\nhttp://www.grida.no/climate/vital/19.htm\r\n\r\nwhich shows that the rise is a few cm. Given that, and given what is the dynamic effect of tides, again it is improbable that this is the cause. The only case you can credibly say is 'exactly at sea level before' and 'inundated by a few cm now.' Now I don't know about you, but that then isn't nearly as compelling a story as they make it out to be. \r\n\r\nIndia is dynamic and sea level may change due to the continued dynamic response of the subduction of India under Asia. The feedback between sea level, continental freeboard, and tectonics is very poorly understood by oceanographers in general, who tend to think of continents as big blocks that sit around being washed down. For example, in eastern US and Canada, the freeboard change that occurred (say, in Quebec City area) as the Taconic arc approached on the subduction zone in the Ordivician was over 100 m vertical. No 'global' sea level change necessary. The effect effected the rock record up to 1000km away (as far as where Toronto now is).\r\n\r\nIf you'd like, I'll cite dozens of papers on this, textbooks and so on. I'm not SURE of the situation in Calcutta, but reasoning from general geologic principles and regional knowledge is a lot more rigorous than the half-baked comments of a journalist. [peripherally, to back up what I say, I am a geology prof and teach courses in this, including one co-taught with an oceanographer where we had a debate specifically on 'how would you recognize true sea level rise - where would you go to be sure it wasn't a tectonic or dynamic sedimentological effect.' ]\r\n\r\nAlso, remember not to confuse what the oceanographers do or do not believe with what journalists then report. I've been interviewed and was appalled by how much they changed what I said. That's perhaps a separate rant, but...\r\n","created_utc":1167272603,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","timestamp_epoch":1566236779,"message_id":"54170-3052f59c-56a2-4b52-b292-78dff1701b50-1566236779"}