{"body":"&gt; but I believe I speak for the scientific community when I say that we eagerly await the measurements that prove my height to be exactly 2740833.33 feet\r\n\r\nI think you've kind of missed danweber's point.  Whilst the measurements of everyday objects like the height of a person or the width of the US do not vary much, the measurements of cosmological things do vary by huge amounts.  For example, look at how the [age of the universe](http://www.lhup.edu/~DSIMANEK/cutting/ageuniv.htm) changes as new theories take hold and new observations are made.\r\n\r\nTo put it another way, if you measure the height of a random person, you expect to get a random variable with perhaps a (&amp;mu; &amp;cong; 1.7m,&amp;sigma; &amp;cong; 0.2m) normal distribution.  If you actually get an answer of &gt;2 million feet you know that either you have made a spectacular blunder or a spectacular discovery.\r\n\r\nAt the other extreme, if you were to measure the radioactive halflife of a number of different elements, you would find no such gaussian distribution.  If the halflife of a newly discovered element were to be 1,000 times shorter than the shortest observed already, this would probably not be seen as a spectacular discovery.\r\n\r\nThe age of the earth, as an unknown value which we are trying to estimate, is somewhere between these two extremes.  Saying \"the earth is 6,000 years old\" is not ridiculous because of some analogy with with the height of humans, it is ridiculous because it is contradicted by so many other well understood and experimentally verified theories.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_w8sr","subreddit":"reddit.com","score":14,"ups":14,"created_utc":1167322142,"author_flair_css_class":null,"author":"acrophobia","author_flair_text":null,"id":"cw9dj","edited":false,"parent_id":"t1_cw9af","gilded":0,"distinguished":null,"retrieved_on":1473809545,"timestamp_epoch":1566236779,"message_id":"55034-99f064d9-009e-4520-b396-66cd041d9076-1566236779"}