{"gilded":0,"retrieved_on":1473809547,"distinguished":null,"author_flair_text":null,"author":"happyjuggler0","id":"cw9et","edited":false,"parent_id":"t1_cw959","subreddit":"reddit.com","created_utc":1167322500,"author_flair_css_class":null,"score":0,"ups":0,"controversiality":0,"body":"It all comes down to Purchasing Power Parity (PPP).[PPP](http://en.wikipedia.org/wiki/Purchasing_power_parity#Need_for_PPP_adjustments_to_GDP) basically means that exchange rates are a poor use to use when comparing the standard of living in different countries. Scroll upwards for the exact definition, but the part of the page I linked to gives why PPP is important.\r\n\r\nComparing incomes for example, you want to know what someone's income will buy **locally**, not what it would buy if they could be magically transported into the US for example and exchanged their currency at market rates to buy the same basket of goods in the US. Exchange rates change much more dramatically than the purchasing power of one's currency locally. \r\n\r\nIf the US GDP per capita grows 3% in a given year, and India's also grew by 3% in that year, then the ratio of (mean) average income change that year is the same. But if the rupee increased in value by say 20% relative to the dollar that year, a comparison of incomes would wrongly show that the average Indian income rose dramatically when in reality no such thing happened. Thus using PPP to determine relative incomes internationally is paramount, and using exchange rates to do so betrays shoddy economics and yields horribly wrong conclusions as to what is going on.\r\n\r\nPPP is what matters, and it is what the [CIA factbook](https://www.cia.gov/cia/publications/factbook/rankorder/2001rank.html) wisely uses. PPP is not a perfect measure though, and everyone who compiles various baskets of goods winds up with slightly (+/- 10-20%) different levels of PPP.","stickied":false,"link_id":"t3_w83o","subreddit_id":"t5_6","timestamp_epoch":1566236779,"message_id":"55048-9ccc1b71-7f7e-4bcf-a139-495216c1c9a2-1566236779"}