{"retrieved_on":1473809554,"distinguished":null,"gilded":0,"id":"cw9u4","parent_id":"t3_w9cn","edited":false,"author_flair_text":null,"author":"Phia","created_utc":1167330249,"author_flair_css_class":null,"score":2,"ups":2,"subreddit":"reddit.com","stickied":false,"link_id":"t3_w9cn","subreddit_id":"t5_6","controversiality":0,"body":"I was ready to dismiss this with cries of 'sexist rudeness' until I watched it. Wow. An accurate if exaggerated documentation of PMS mood swings. Granted I don't get this extreme (and there's overlap) but that's more or less how I've observed I act over the course of a regulated cycle.\r\n\r\nI honestly think that heterosexual males should get a version of this lesson as part of sex ed.\r\n\r\nOf course not all women manifest things the same way, but that’s a given. And sometimes a little nurturing of the right kind may counteract the effects of the mood swing. Week three and four need not be complete nagging hell so here’s the best advice, as a woman, I can give for those two weeks.\r\n\r\nWeek 3: ‘Moody’ best characterizes classic PMS. It’s not that she’s angry it’s that when she gets upset it’s amplified. Don’t take snaps personally (but don’t let yourself abused). If she’s not a believer in cycles ‘You must be stressed?’ works to feel out a bad temper that doesn’t seem directly connected to anything.\r\n\r\nOften, gearing up for a period, the body will bloat up with fluid retention. If she’s watching her weight, the fact that there may be an entire size in difference can set her off. Fortunately drinking lots of fluids reduces bloating. Fruit smoothies make good bribes. They’re sweet, have plenty of liquid and reasonably cheap to throw together.\r\n\r\nIf she’s yeast prone (gross I know) this is a popular time for a flare up. Keep Monistat in reserve if so. You’ll seem nurturing and sensible.\r\n\r\n\r\nWeek 4: Cramping. Oh you unlucky pair. However a supply of pain killers, hot water bottles and a bit of massage no-how can make you the best boyfriend on the block.\r\n\r\nIf your girl is cramping the massage technique you want is a lower back massage that focuses just above her hip bones in the general region of her kidneys. Don’t ask me why this works, but I use it on other females. \r\n\r\nFinal point: Be careful to tell the difference between irritability and merely being psycho/bipolar.","timestamp_epoch":1566236779,"message_id":"55254-b6eeef4c-d43a-4959-a547-a0ded7842d42-1566236779"}