{"retrieved_on":1473809572,"distinguished":null,"gilded":0,"edited":false,"id":"cwat9","parent_id":"t1_cwaf0","author_flair_text":null,"author":"teromajusa","author_flair_css_class":null,"created_utc":1167346060,"score":10,"ups":10,"subreddit":"reddit.com","link_id":"t3_w94g","stickied":false,"subreddit_id":"t5_6","body":"&gt; If he was covering another department and stocking extra shelves, he wasn't holding \"total contempt\" for the other workers.\r\n\r\nI guess you missed the part where he thought he had to, and where he stopped when he realized it wasn't his job after all.  You may have also missed this paragraph:\r\n\r\n&gt; First, NO ONE NORMAL works the overnight shift ANYWHERE. This is ESPECIALLY true at Wal-Mart, a gigantic wasteland of career options, where you are working alongside people who restock Liquid Dawn dish soap and Golden Flake snacks eight hours a night for a living. IN GEORGIA.  Surprisingly, this conglomeration of educationally inept rednecks had quite an elaborate social structure built into their little group, one that did NOT readily include people who pronounce the word \"green\" with only one syllable\r\n\r\nThis looks a lot like contempt to me and I imagine if they knew he felt this way, his co-workers would have agreed.  Maybe he was great at keeping this opinion to himself, but judging from their reaction to him, I have my doubts.\r\n\r\n&gt; You seem to be conveniently choosing to assume parts of his story are fake, and that the actions of the other employees are due to his \"total contempt\" for them.\r\n\r\nI happen to think that the revenge stuff sounds a bit made up, but that really doesn't affect my take on the whole thing.  My point was that if it was true that everybody hated him, then I suspect his attitude had something to do with it.  \r\n\r\n&gt; my conclusion is that you are a bitter bitter person that hates college kids.\r\n\r\nlol.  Actually, I worked in a somewhat similar environment when I was in college.  The guys I worked with were dirt poor and totally uneducated.  If I had come off with attitude, they would have made my life hell, but I treated them with respect because although they hadn't been to college, they knew the job better than me and had been around the block a few times.  A lot of them had really interesting stories to tell, some of them were pretty bright guys.  I learned a lot working with them - a lot about people, a lot about hardship.  So when I see this guy starting out with that kind of crap, it doesn't suprise me in the least that they gave him shit.  \r\n","controversiality":0,"timestamp_epoch":1566236779,"message_id":"55743-ed43a81e-f66e-4598-b690-7d5d2fc9ad45-1566236779"}