{"distinguished":null,"retrieved_on":1473809594,"gilded":0,"id":"cwbwj","edited":false,"parent_id":"t1_cw4f2","author":"bluGill","author_flair_text":null,"score":1,"ups":1,"created_utc":1167371023,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_w2wq","body":"You can SOMETIMES save realtor fees.  If get a job out of state you can't because you can't be there to act as a realtor.   That 6 months to sell can be a big problem to in the get a job out of state since you still have to make a housepayment for an empty house, while paying rent.  (Not all jobs offer moving expenses) \r\n\r\nRent and ownership tends to come out even because renters can invest more.   Houses tend to return 8%, while the stock market returns 10%.   (big disclaimers here)  A rent of $800/month may come out to a housepayment of $900/month, and you need to add another $100/month for maintenance (paint, remodeling, and other expenses that renters don't have).    So if the renter invests the difference, that is $200/month to a better investment.   Don't forget that a house is leveraged, or at the start only about $50/month is going to the house, while the rest is interest.   A $100,000 house can often cost $300,000 when you pay it off (after interest - which you can deduct saving $50000).   Of course the house goes up in that time too.  (by about the same amount as what you pay, so your real gain ends up being the tax deduction which is less than the gains a renter would get in the stock market)\r\n\r\nThis assumes a renter is disciplined enough to invest the difference.   However rent always goes up (in the long run, sometimes it goes down for a few years), so after 28 years the renter is paying more than the home owner (and the homeowner can invest the difference in stocks - but there is much less time for this money to grow)   Then after 30 years the homeowner is done with payments (other than taxes) while the renter is still seeing rent increases.\r\n\r\nThere are other considerations too.  I hope I made it clear just how complex an analysis is.","controversiality":0,"timestamp_epoch":1566236779,"message_id":"56312-b23c153f-1c54-41a4-8c06-5cb165c5a1d1-1566236779"}