{"author_flair_text":null,"author":"vintermann","parent_id":"t1_cw9r6","id":"cwc5o","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809598,"body":"This is correct, and important (although I'd say that the existence of anthropogenic global warming probably is more verified as any other thirty-year old claim in science).\r\n\r\nBut the thing with science, is that not everyone has equally many votes. It's like an election where everyone says \"the people I vote for are probably better at deciding than me, I'll let them help decide where to put my votes\". If you know a little about geology, you put your trust in those who it seems know more (from what you know about geology), and leave to them to figure out what you don't understand. They again put their trust in other experts, perhaps even in a complementary field like physics. So there appears a web of trust. \r\n\r\nCreationists and cranks who appear (from the little you know) to be wrong are not trusted, especially not when they are dismissed by the people you do trust.\r\n\r\nThe problem is that it works the other way. Fundamentalist parishioners are used to that the things that are said from the pulpit are worth listening to, usually for very reasonable reasons. Perhaps they had their life changed, got back on track, found new meanings to life. They trust _their_ autorities to answer questions outside their own domain of knowledge, and decide by a similar system of informal voting who their authorities are.\r\n\r\nIt's not all that different from how science works, except that fundamentalists trust people for the wrong reasons and in the wrong fields. The trust function is the same, but with different initial conditions it converges to other points, and different people end up with authority.\r\n\r\nSo Dawkins is wrong, really. _Truth_ is not about voting or authority, but science is. And there's nothing wrong with that. It has to be, because it's a human institution - one of the best and most wonderful ones.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_w8sr","subreddit":"reddit.com","score":2,"ups":2,"created_utc":1167378031,"author_flair_css_class":null,"timestamp_epoch":1566236779,"message_id":"56426-ddc7404f-cc81-4191-b0a8-6da38754b66b-1566236779"}