{"edited":false,"parent_id":"t1_cthqg","id":"cthty","author_flair_text":null,"author":"Redwan","retrieved_on":1473807666,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_tfob","subreddit_id":"t5_6","body":"I didn't write too much in depth and there is a lot of truth to what you say but I am not a naive or fragile tourist and my experiences in Morocco are far more than being hassled by professional touts known as \"faux guides\" for any short amount of time.\r\n\r\nWithout going into things at too great a length I have to say that Morocco is unique in this use of \"jew\" as an insult and it is extremely common. I have traveled extensively, alone, in over a dozen muslim countries and have never come across such behavior from any other countries' touts. None. Not even close.\r\n\r\n It presents a puzzle to me .\r\n\r\nYou are absolutely correct in the way you describe them. There are nasty hustlers in many, many countries. But Morocco is special in this. Why the use of \"jew\" as an insult? Why the constant use of it? In conversations I had with people in their  homes they talked a lot about their dislike for the jews. \r\n\r\nOther places I have visited including Egypt, Yemen, Syria, Jordan, Turkey, Iran  the discussion about \"the jews\" tended to be more political and focused on the plight of the Palestinians . But in Morocco it was full of hate. They would hurl the word like it was a terrible insult that was almost painful to say and they would spit it out with such disgust and venom that it was quite surprising.\r\n\r\nWhy? I don't know. I wish I did.\r\n \r\nThere is also much to what you say with your point about London muggers but I have been to Morocco 6 times,   the last time for 5 months, and this behaviour is not isolated .\r\n\r\n This is not to say that all Moroccans feel this way by any means but in my experience even in polite conversation with people who were definitely not touts I got similar attitudes expressed.\r\n\r\nAnyhow, when zeco wrote\r\n&gt; It has to be said though, that anti-jewish sentiments were never a common occurrence in Morocco, Algiers or Tunisia.\r\n \r\nI couldn't help but think how wrong that sounded.\r\n\r\nIt seems to me that anti-jewish feelings are alive and well in morocco.","controversiality":0,"created_utc":1165192512,"author_flair_css_class":null,"score":4,"ups":4,"subreddit":"reddit.com","timestamp_epoch":1566236759,"message_id":"5652-0d0d8c94-e671-4922-87bf-250807d60181-1566236759"}