{"distinguished":null,"retrieved_on":1473809605,"gilded":0,"id":"cwck0","edited":false,"parent_id":"t1_cw9c8","author":"tayssir","author_flair_text":null,"score":3,"ups":3,"author_flair_css_class":null,"created_utc":1167393625,"subreddit":"reddit.com","subreddit_id":"t5_6","link_id":"t3_w872","stickied":false,"controversiality":0,"body":"Here's an [interview with Harry Shearer](http://www.fadetoblack.com/interviews/harryshearer/page1.htm), who disputes Lorne Michaels' claims. (Shearer's probably best known for his roles on The Simpsons):\r\n\r\n&gt; **Q:** In the introduction of your book \"Man Bites Town\" you state that the original title of the book was \"Lorne Michaels Must Die!\". You spent two seasons on Saturday Night Live, what went wrong? It seems that people walk away from the show either loving the experience or hating it tremendously.\r\n&gt; \r\n&gt; **A:** Even the people who profess in public to have loved it tell a different  story privately. Fish rot from the head, so do TV shows. Nuff said.\r\n&gt; \r\n&gt; **Q:** A few years ago there was a Robert Smigel cartoon on Saturday Night Live entitled \"Conspiracy Theory Rock\" which was actually a very sophisticated satire of the increasing concentration of media ownership in a small number of huge multi-national corporations. It included references to Disney, ABC, CBS and NBC and its parent company, General Electric. When the show went into reruns the cartoon was pulled from the show. Loren Michaels was quoted as saying that the reason the segment was pulled was because \"I didn't think it worked comedicly.\" Having worked on the show for two years and having a good grasp on the media and politics what do you think the truth really is?\r\n&gt; \r\n&gt; **A:** The truth is that Lorne wanted to continue working at 30 Rock.\r\n&gt; \r\n&gt; **Q:** Is this something you have heard from a reliable source or just your opinion? \r\n&gt; \r\n&gt; **A:** Just my opinion.\r\n\r\nPersonally, I thought it was a quality retro comedy piece. Maybe not bust-a-gut laughing funny, but my understanding is that comedy encompasses different kinds of amusement which don't necessarily result in real laughter.\r\n","timestamp_epoch":1566236779,"message_id":"56595-c756ff9c-1942-42f7-8729-5317ee7844aa-1566236779"}