{"link_id":"t3_wbp8","stickied":false,"subreddit_id":"t5_6","controversiality":1,"body":"Some here are willing to jump to conclusions so easily if it fits their agenda.  Here is a quote:\r\n\r\n\"In order to avoid offending religious fundamentalists, our National Park Service is under orders to suspend its belief in geology.\"\r\n\r\nDoes anyone see any substantiation for this quote?  I didn't think so.  Total hyperbole.\r\n\r\nAlso, what about this quote: \r\n\"Ironically, in 2005, two years after the Grand Canyon creationist controversy erupted, NPS approved a new directive on “Interpretation and Education (Director’s Order #6) which reinforces the posture that materials on the “history of the Earth must be based on the best scientific evidence available, as found in scholarly sources that have stood the test of scientific peer review and criticism [and] Interpretive and educational programs must refrain from appearing to endorse religious beliefs explaining natural processes.”  \r\n\r\nSo let's be fair here. The only real issue is that there is a book for sale that is called \"Grand Canyon: A Different View.\"  Big deal - that's not really an issue at all, in my mind.  You don't like it, don't buy it.  Who cares.  Not the end of the world.\r\n\r\nI'm sure there are also some very scientific books on the grand canyon at the bookstore also.  I actually am willing to bet heavy on that.  \r\n\r\nAnd then I read these comments.  Someone says \"AAARRGH.\"  Someone asks if it is a joke.  People, lighten up a bit, and don't bite the bait so quickly.  \r\n\r\nThe article also says \"Records released to PEER show that during 2003, Grand Canyon officials rejected 22 books and other products for bookstore placement while approving only one new sale item — the creationist book.\"  Do we know what those 22 books were about/like? No.  So we can't automatically condemn the rejection of those books, can we?  No, of course not.  \r\n\r\nSo let's stick with the facts.  Reason, restraint.  \r\n\r\nSo I guess my question is, based upon what the article says, what do you see as the problematic issue in this matter?  Thanks.\r\n\r\nBring it on... :)    \r\n","author_flair_css_class":null,"created_utc":1167399584,"score":7,"ups":7,"subreddit":"reddit.com","id":"cwcqm","edited":false,"parent_id":"t3_wbp8","author_flair_text":null,"author":"mrl215","retrieved_on":1473809608,"distinguished":null,"gilded":0,"timestamp_epoch":1566236779,"message_id":"56669-4844531d-a8c0-4dc5-9dd2-d5ce628b3501-1566236779"}