{"gilded":0,"retrieved_on":1473809622,"distinguished":null,"author_flair_text":null,"author":"grauenwolf","edited":false,"id":"cwdfl","parent_id":"t1_cwbaj","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167413169,"score":0,"ups":0,"controversiality":0,"body":"&gt; It is not the appearance of impropriety that is a problem, it is that receiving gifts generates actual biases. Even, in many cases, when the receiver does not think it will.\r\n\r\nMaybe the first couple of times a reviewer gets something they might be biased, but any pro quickly learns that companies have to give them stuff. They know it isn't a gift, it is just a way to get a new product into their hands.\r\n\r\n&gt; Insofar as the one accepts the tenet that journalism should be as unbiased as possible, it is unethical for a journalist to accept gifts from any party that may receive coverage.\r\n\r\nTo that I answer with a quote from Ars Technica\r\n\r\n&gt; This practice is not uncommon. Product developers and manufacturers are often itching to give out freebies to tech influencers because it's smart marketing. Do you really think Walt Mossberg of the Wall Street Journal goes to some secret underground Apple Store to buy his hot new iPod to review a month before it's even announced? Do you think hardware review sites sneak into processor fabs late at night to gain access to hardware samples that won't be on retail shelves for months? Do you really think they're sending all of that stuff back? Some are, some aren't, and to be honest, I have no idea if Mossberg keeps the top-secret stuff he's sent or not. For someone like Mossberg or someone like me, keeping the stuff isn't one-fifth as important as just having access to it in a timely fashion. That whole angle has been largely lost in this discussion, and it's a shame.\r\n\r\n(http://arstechnica.com/news.ars/post/20061228-8514.html)","link_id":"t3_wa4q","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236779,"message_id":"57028-e5c1813b-33fe-425a-aeb0-07e592bd5788-1566236779"}