{"author":"bevets","author_flair_text":null,"edited":false,"id":"cti0q","parent_id":"t1_cthq1","gilded":0,"retrieved_on":1473807669,"distinguished":null,"controversiality":0,"body":"Hence, Huxley saw the need to found his own church, and evolution was the ideal cornerstone. It offered a story of origins, one that (thanks to progress) puts humans at the center and top and that could even provide moral messages. The philosopher Herbert Spencer was a great help here. He was ever ready to urge his fellow Victorians that the way to true virtue lies through progress, which comes from promoting a struggle in society as well as in biology--a laissez-faire socioeconomic philosophy. Thus, evolution had its commandments no less than did Christianity. And so Huxley preached evolution-as-world-view at working men's clubs, from the podia during presidential addresses, and in debates with clerics--notably Samuel Wilberforce, Bishop of Oxford. He even aided the founding of new cathedrals of evolution, stuffed with displays of dinosaurs newly discovered in the American West. Except, of course, these halls of worship were better known as natural history museums.  ~ Michael Ruse \r\n\r\nThese new-style evolutionists--the mathematicians and empiricists--wanted to professionalize evolution because they wanted to study it full time in universities, with students and research grants, and so forth. However, like everyone else, they had been initially attracted to evolution precisely because of its quasi-religious aspects, regardless of whether these formed the basis of an agnostic/atheistic humanism or something to revitalize an old religion that had lost its spirit and vigor. Hence, they wanted to keep a value-impregnated evolutionism that delivered moral messages even as it strived for greater progressive triumphs. ~ Michael Ruse\r\n\r\nThank you, dln, for showing the rare courage of stepping forward.","link_id":"t3_tgvw","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165196787,"score":-16,"ups":-16,"timestamp_epoch":1566236759,"message_id":"5725-4518ab1d-f6ac-4685-86a4-9272effd5839-1566236759"}