{"author_flair_text":null,"author":"Lucretius","edited":false,"id":"cwe0x","parent_id":"t1_cwdmw","gilded":0,"distinguished":null,"retrieved_on":1473809632,"body":"I find your term \"human scale\" simultaneously revealing and amusing.  You seem to conceive of humans as some sort of static creature with capacities and world-views that never change.  The truth is that from generation to generation, our minds become enriched with new knowledge and our capabilities extend accordingly.  To force modern man to live within the box that would have sufficed for his ancestors is in fact unnatural.  We neither can nor should create a false distinction between Man and the various technologies he has devised to extend his various powers.  Likewise, aesthetics, which do indeed matter, need not be locked in some fixed state inherited from long ago.  I see the powerful architecture shown in the link and the message is crystal clear: \"Though it was a dessert, we have built a paradise.\"  The \"disharmony\" with the environment you treat as a failing is in fact clear aesthetic choice, one that I find appealing.\r\n\r\nOn the subject of energy dependence, Comparisons between different lifestyles are meaningless unless one includes both sides of the equation:\r\n \r\n    (Energy-Used)*(Efficiency) = (Achievement)\r\n\r\nEfficiency can not be solved-for unless there is a value for Achievement.\r\n\\tPerhaps an equal number of people could live using less energy, but would they achieve as much?  If we could agree on an objective scale of achievement such a measurement could be made, and then the a comparative cost-benefit analysis of two different life-styles could be done.  In the absence of such an objective measurement I suggest that living in wind-catcher cooled adobe buildings that are open to dust and bugs, going to work in un-motorized cities dominated by the smell of animal dung (If you want low energy dependence then its animal power), or avoiding the use of electricity, in a lifestyle similar to that common in ancient Persia is not remotely as conducive to achievement as the modern lifestyle.  \r\n\r\n*edit fixed typo","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_wcfe","subreddit":"reddit.com","score":7,"ups":7,"created_utc":1167422557,"author_flair_css_class":null,"timestamp_epoch":1566236779,"message_id":"57356-941942e6-d032-4980-9185-752a2e904d96-1566236779"}