{"retrieved_on":1473809632,"distinguished":null,"gilded":0,"edited":false,"id":"cwe10","parent_id":"t1_cwb4t","author_flair_text":null,"author":"Codebender","created_utc":1167422620,"author_flair_css_class":null,"score":1,"ups":1,"subreddit":"reddit.com","stickied":false,"link_id":"t3_w8sr","subreddit_id":"t5_6","controversiality":0,"body":"&gt; Richard is a master debater.\r\n\r\nHe's well-spoken, sure, but not a master debater.  People who are skilled at winning debates do so by being less-than-honest and manipulating their audience.  Dawkins doesn't like formal debates for exactly that reason.\r\n\r\n&gt; opened the door for Professor McIntosh to defend himself\r\n\r\nHe's not attacking McIntosh here, there's nothing to defend himself against.  Read the article again, Dawkins never once claims that McIntosh is wrong.\r\n\r\n&gt; He would never take this risk.\r\n\r\nDawkins has written *entire books* full of such claims.  He's merely saying that they don't need to be repeated here, and they don't.  Anyone interested in refuting them can go find them at their local library.  The point of the article is not to refute his opponent, but to show just how wrong that opponent is claiming that almost every scientist is.\r\n\r\nThe argument that evolution violates the Second Law is a very old creationist argument, and it's always been trivially answerable, but continues to be argued for some reason.  It's really as simple as an incorrect definition of the system, probably the most basic and common error made in freshman physics/ME/Thermo classes.\r\n\r\nAssuming that the prof in question isn't a moron, he's arguing that the evolution taking place on Earth accounts for more negative entropy than the positive entropy of the entirety of the sun's fusion reactions.  That makes the 460,000 magnitude of error seem tiny in comparison.  The Earth receives 2e-9, 0.000000002, of the sun's energy.\r\n\r\nEdit: Found the classic M.C. Hawking lyrics...\r\n\r\n&gt; Creationists always try to use the second law,\r\n\r\n&gt; to disprove evolution, but their theory has a flaw.\r\n\r\n&gt; The second law is quite precise about where it applies,\r\n\r\n&gt; only in a closed system must the entropy count rise.\r\n\r\n&gt; The earth's not a closed system' it's powered by the sun\r\n","timestamp_epoch":1566236779,"message_id":"57358-2b935edd-104d-40c3-b9e3-54fe836e88da-1566236779"}