{"body":"\"But I'm definitely going to spring for a private school when it comes time. Many of these problems go away simply by isolating oneself from the mentally sub-standard pop-culture-addled 75% of the population.\"\r\n\r\nGood luck. \r\n\r\nI went to a private middle school and then spent three years at a private high school, the most elite and expensive in my midwestern state (or so I was told).  I started smoking cigarettes my freshman year.  We had sex, smoked pot, took mushrooms and LSD, some people used meth, a few tried needle drugs.  It was common for kids to get shit-faced drunk, pull some bong hits, and go drive their parents expensive car around at high speeds.  Not to mention that my physics teacher had to leave in the middle of the school year because he got caught fucking a 15 year old female student (which he later ended up getting divorced and spending time in jail for).  This was all in the early 90's.  \r\n\r\nThe main difference I observed between the private school I attended and the local public schools was that the private school made a priority of keeping up appearances.  When a girl at the private school got pregnant, her parents got her a QUIET abortion, rather than her keeping the baby,  and when some kid developed a drug problem (and many did), they were immediately put into rehab (which occasionally helped). \r\n\r\nKids at private schools have the same hormones and the same adolescent brains, and are exposed to the same “mentally sub-standard pop-culture” and temptations as everyone else.   You can’t raise a kid in a bubble.","controversiality":0,"stickied":false,"link_id":"t3_wdrb","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1167429306,"author_flair_css_class":null,"score":61,"ups":61,"author_flair_text":null,"author":"ampegg","edited":false,"id":"cweg6","parent_id":"t1_cwe1q","gilded":0,"retrieved_on":1473809641,"distinguished":null,"timestamp_epoch":1566236780,"message_id":"57621-2d0e7f60-fd9d-466b-9ea4-9ff760ad6212-1566236780"}