{"gilded":0,"retrieved_on":1473809654,"distinguished":null,"author":"derefr","author_flair_text":null,"id":"cwf63","edited":false,"parent_id":"t3_w94g","subreddit":"reddit.com","created_utc":1167446116,"author_flair_css_class":null,"score":2,"ups":2,"controversiality":0,"body":"Why is everyone here judging all Wal-Mart stores' competence by meter of their own local branch? This guy does, in fact, pull real pranks. He's been doing it for years, and has quite a reputation for it. The Wal-Mart he did this at might have had competent employees, or it might not have; it might have had effective security, or it might not have; it might have had management that cared enough to bring this issue to court, or it might not have. Unless you have been to this particular Wal-Mart yourself, neither you nor I can say for sure. We *can* say for sure that an Internet humorist posted a story, and that some people may find it amusing. Like any farce, its effectiveness has nothing to do with its truthfulness, and everything to do with what you took away from it.\r\n\r\nI've been more and more annoyed with Reddit lately for the overwhelmingly negative response it has to any story, or, if the story is sound, the author, or failing that, the philosophy behind the author's other work. Can't we all have a discussion that isn't a pissing match against some perceived enemy? I don't mean to call for any standard of \"politeness\" or \"etiquette,\" just a simple foundation of respect for others' work. If you don't like something, Reddit lets you both downvote the article, and hide it. The only case where you should feel a need to comment is if you think you might add something to the value of the current piece. Taking apart the story for all to see might make you feel better about having read something that doesn't sit well with you, but it adds nothing to the conversation that those here, assumingly of a similar mindset, don't already grasp.\r\n\r\nIf the emperor truly has no clothes, the public already knows. In the case of a real emperor, the public says nothing out of fear. But in the case of a simple pauper, the public will be quick to stone him for such debauchery. Wouldn't it be nicer to walk around without getting stones thrown at you? To treat all others, including oneself, as emperors over all, undeserving of such punishment? I hesitatingly refer to a Christian passage: \"He that is without sin among you, let him cast the first stone....\"\r\n\r\nBah, I'm just rambling. The site's even down, so I didn't get to read the article. Reddit has just seemed rather pissy lately.","stickied":false,"link_id":"t3_w94g","subreddit_id":"t5_6","timestamp_epoch":1566236780,"message_id":"58023-a2d9678b-516b-4c34-878c-1914344145eb-1566236780"}