{"subreddit":"reddit.com","ups":4,"score":4,"author_flair_css_class":null,"created_utc":1167487418,"body":"Depends if you believe in death penalty. Most countries in the world don't. I don't think international courts that have examined war crimes have ever sentenced someone to death. I could be wrong, but anyway, the Iraqi court was neither international or fair.\r\n\r\nIt was orchastrated since the beginning. Would a \"fair\" trial from people who believe in death penalty arrive at the same sentence? Probably, if you count only the crimes alone.\r\n\r\nWhat I mean with this is that you can't see only what you want to see. Saddam was an evil person, and killing him is the right decision if you ignore the surrounding context. Iraq is in civil war, occupation war, whatever, there were people there who live an horrible life but now it's far worse, for those who are alive anyway.\r\n\r\nRemoving the central target, the guy who acted as a glue for different political and religious points of view, note that I am not defending his methods, just saying that the context needs to be examined, things beyond the ruler that needed to be fixed before killing him. There's a lot of trouble in Iraq now, and killing Saddam solves about zero of them.\r\n\r\nHundreds of thousands are suffering a lot for this... Bush's whim. Not much consideration is being given to this, or at least the plans and the execution of these plans are horrible.\r\n\r\nSo... the comment by anarchocap, \"Mission Accomplished II\" is right on spot. Just like when we've seen Bush behind the Mission Accomplished banner, nothing will be accomplished.\r\n\r\nAnd there're far worse people in the world. People who have killed, or ordered to kill, really big numbers, millions even. Some wars in Africa, for example. In the \"evilness\" scale, Saddam isn't on the top. Do I mean we, the world, shouldn't have done anything about him? Of course not, but who initiated this war made it sound like this was the world's top priority. In fact, it was not even the US top priority, the Bush administration had to lie to convince their people that this war had some value.\r\n\r\nThe world needs serious help, in several areas. The richest country spending years, thousands in manpower, and half a trillion dollars, to try and fix what's not even one of the world's biggest problems, it's a serious misdirection of priorities.\r\n\r\nWhat really makes me sad is that other countries followed the US because of commerce, trade and money, but that's a topic for another time maybe...","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_wf9e","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473809679,"author_flair_text":null,"author":"inerte","id":"cwgha","parent_id":"t1_cwfnu","edited":false,"timestamp_epoch":1566236780,"message_id":"58645-5bafa665-d94a-4bbb-ac1f-9db73efbf3a0-1566236780"}