{"subreddit":"reddit.com","created_utc":1167500593,"author_flair_css_class":null,"score":-1,"ups":-1,"body":"Another thing to note is that most high-resolution products today (whether it is games or movies) abuse the notion of high resolution. Higher resolution should equal more stuff on the screen, not just smoother curves and edges. Try playing Warcraft 3 in 2560x1600: all you get is the same window with a tighter rendering of the objects. Sid Meier's Railroads, a recently-released strategy game? Same result. These games are both in genres where the _viewport is everything_ - if you use a greater resolution, it would be much better used if it reduced the necessity of scrolling the window. The same goes for first-person shooters. Widescreen monitors should increase your field of view, and large widescreen monitors with high resolutions should increase your field of view a _lot_. The only game I have seen that actually pulls this off elegantly is Microsoft's Flight Simulator 9 and 10. In this program, you can fly from a \"virtual cockpit\" that puts the camera inside a 3D model of whichever aircraft you are flying. With a high resolution, you can leave the camera zoomed all the way out and still have a good view of the instruments, as well as the side windows.\r\n\r\nI haven't contemplated this case for movies, and I suppose that filming in wider angles has a greater technical difficulty associated with it. But that is no excuse for not trying! The lazy entertainment bastards should receive a good beating for not fixing this and still taking our money. I suggest we should interpret their profits as payment for a proper whooping, and that the next two weeks anyone who wants to can take a bat to any entertainment executive.\r\n\r\n{All right - a quick search reveals that MSFS isn't the only game that has managed to pull off a proper utilization of high-resolution monitors, but the [list is still shorter than it should be](http://www.matrox.com/graphics/en/gxm/products/th2go/gaming/list.php).  And high-profile studios like Blizzard and Firaxis should know better.}","controversiality":1,"stickied":false,"link_id":"t3_wgos","subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809686,"distinguished":null,"author_flair_text":null,"author":"marvin","edited":false,"parent_id":"t3_wgos","id":"cwgwj","timestamp_epoch":1566236780,"message_id":"58812-7df916aa-2df2-45d6-a608-f198fa4788a5-1566236780"}