{"controversiality":1,"body":"I upmodded you preemptively because I'm sure you'll be downvoted into oblivion, even though what you're saying is perfectly reasonable.  The problem I have with these look-at-authority-figures-abuse-their-power stories is that there's always a misleading subtext.  That subtext here is obviously: cops are corrupt and love nothing more than harrassing people so look out, big brother's going to get you!  What I take from it is a far simpler moral: don't be a douche.  What these cops did was wrong, but the implication that they're out looking to antagonize honest citizens is absurd.  Unless you live in Central America, are a black guy and get pulled over by a racist cop, or have a trail of blood dripping from your trunk, it is very, very easy to avoid this kind of treatment.  Just be a reasonable person.  I said something similar in another thread a while back, but the simple fact of the matter is that there are people who get off on provoking authoirty figures by exercising their rights to the most extreme and unreasonable degree.  It's the equivalent of the 'I'm not touching yooooooou' game that kids play; true, I don't have to move my finger from in front of my little sister's face, but why be an asshole?\r\n\r\nIf a cop pulls you over, doesn't have probable cause to search your trunk, and you've got a stash of freaky (but legal) porn in the trunk, would I blame you for not giving permission?  Of course not.  But this kid was just looking to be a dick, so I don't have a lot of sympathy for him.  I seriously doubt his destination was some great secret.  He just didn't want to tell, and delighted in the fact that he didn't have to.  It's almost a kind of narcicissm.  \r\n\r\nAlso, it's rarely 40 year old men, with kids at home and errands to run, who I see in these stories.  It's some 20 year-old (and I say this as a 26 year old) with nothing better to do.  \r\n\r\n*EDIT* I just thought of an illistrative (but amittedly flawed) analogy.  Rights are at times overinclusive or overinclusive in protecting our interests.  Here is an example of when a right is overinclusive and exercising it to the full extent allowed doesn't really further the driver's interests, but only serves to make the police officers' jobs tougher.  Similarly, laws are often overinclusive or underinclusive with respect to protecting the interests of the state (either directly or through prosecuting criminals who violate the rights of other citizens).  We all have an obligation to obey the laws that are promulgated by the legislature and of which we have notice.  So, if there's some technicality in the law that would allow a prosecutor to charge a 19 year old for sleeping with his 17 year old girlfriend, should the prosecutor do it?  I think most of us would say 'no,' that even though the state has the right to do so, it would be unreasonable because the state's interests are not threatened.  We would call that prosecutor misguided or overzealous.  Similarly, this kid deserves the same judgment.","link_id":"t3_wgpl","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167509061,"score":-4,"ups":-4,"author":"mpecsek","author_flair_text":null,"parent_id":"t1_cwh7x","edited":false,"id":"cwhaf","gilded":0,"retrieved_on":1473809693,"distinguished":null,"timestamp_epoch":1566236780,"message_id":"58966-7ccaccd6-3de2-4483-b1ea-48dc89dd5fd0-1566236780"}