{"subreddit_id":"t5_6","link_id":"t3_wgpl","stickied":false,"controversiality":1,"body":"Officers use simple conversation to help determine if someone is under the influence.  Acting argumentative, being combative or verbally evasive are possible signs of intoxication.  Although Bret wasn’t intoxicated there was no way for the officer to know that with any certainty.  All he knows is that he’s got an uncooperative kid behind the wheel.  It would have been irresponsible for him to allow this potentially intoxicated person to remain behind the wheel until he was certain that Bret was unimpaired.  If Bret had been drunk and the officer allowed him to move his own car several things could have happened.  Among them Bret could have hurt himself of someone else.  On top of that Bret was already being uncooperative so there was no way for the officer to know if Bret would have just taken off if he was allowed back in the car.  Bret certainly wasn’t giving the officer any reason to trust him.  On the contrary. \r\n\r\nShining a flashlight in a car is hardly illegal and in no way falls outside the “guidelines” you mention.  The officer didn’t open compartments or lift up consoles.  Checking for potentially dangerous or illegal items that are in plain site is not illegal.\r\n\r\nNow, I concede that the officer should never have reacted by saying he would find a reason to arrest Bret if he didn’t shut his mouth, but Bret is by far the one who is wrong in this situation.  He instigated and goaded the officers until one finally screwed up.  Perhaps this officer shouldn’t be on the force or maybe he made a one time mistake but neither scenario lessens the fact that Bret was a punk and deserved almost all the grief he got that night.  \r\n","score":-7,"ups":-7,"author_flair_css_class":null,"created_utc":1167510510,"subreddit":"reddit.com","edited":false,"id":"cwhcs","parent_id":"t1_cwha3","author_flair_text":null,"author":"exiticon","distinguished":null,"retrieved_on":1473809694,"gilded":0,"timestamp_epoch":1566236780,"message_id":"58996-d449645c-09cd-4b2a-84e0-0d77e58dee6a-1566236780"}