{"id":"cwi23","edited":false,"parent_id":"t1_cwhl9","author_flair_text":null,"author":"rocky_m","retrieved_on":1473809708,"distinguished":null,"gilded":0,"link_id":"t3_whh2","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"\"Can the person that pulled the trigger deny responsibility?\"\r\n\r\nfrom Nuremberg Principles\r\n\r\nhttp://en.wikipedia.org/wiki/Nuremberg_Principles\r\n\r\n&gt; ***Principle IV***\r\n\r\n&gt; The fact that a person acted pursuant to order of his Government or of a superior does not relieve him from responsibility under international law, provided a moral choice was in fact possible to him.\r\n\r\n---------------------\r\n\r\n\r\n\"Did he actually murder anyone or did he just order people to murder Iraqi citizens?...If the latter, is he still a murderer?\"\r\n\r\n(from the same link as above)\r\n\r\n&gt; ***Principle III***\r\n\r\n&gt; The fact that a person who committed an act which constitutes a crime under international law acted as Head of State or responsible government official does not relieve him from responsibility under international law.\r\n\r\n-------------------------\r\n\r\nDoes any of that apply to Bush or other US officials ? \r\n\r\nNo, unless a different country dislodges US as the superpower, the UN is completely impotent to enforce anything on the US gov or administration. As for procecution by US-Supreme Court itself, hidden in the \"Military Commissions Act of 2006\" (ie Legalized Torture act) was the following:\r\n\r\n&gt; Several commentators observe that the MCA effectively absolves the Bush administration and others for possible crimes committed in the War on Terror by negating the principle of command responsibility. Most notably, the US Supreme Court ruled in Hamdan v. Rumsfeld that the Geneva Convention applies to all prisoners. Since the War Crimes Act of 1996 defined any breach of Geneva as a war crime, this opened up the possibility for legal challenges for anyone involved in the abuse of detainees.[29] ***The MCA rewrites the War Crimes Act retroactively to November 26, 1997, making those offenses which were considered War Crimes before the MCA was adopted no longer punishable under US law.[30] Because of this, investigations into possible wrongdoing in the War on Terror seem unlikely within the United States***\r\n\r\n------------------------------\r\n","author_flair_css_class":null,"created_utc":1167524701,"score":19,"ups":19,"subreddit":"reddit.com","timestamp_epoch":1566236780,"message_id":"59336-2aefdeb1-0fb1-4a71-948d-fb6810eaf583-1566236780"}