{"body":"Never make a security policy without examining all the attack vectors, weighing them, and then solving the most significant first.\r\n\r\nThose posts address a common security concern. That is good. Times however, have changed. First, all of my packages/plugins are from gentoo so they have been verified at a cursory level and gpg signed. It's not just random junk from some site on the net, as is the case with most of your links.\r\n\r\nSecond, historical evidence demonstrates that maliciously altering a base package, getting it reviewed and approved in a major distro, and having it in the wild for over a year (about the age of my install) is a highly unlikely attack pattern.\r\n\r\nA person has limited time to put towards security. Is this particular place the best to focus? Definitely not. Your position reminds me of those who put so much effort into \"security\" only to be phished or some other trivial attack.\r\n\r\nA major point- if we were *so* concerned about security then we would not be using linux in the first place. OpenBSD is the demonstrated winner. Ideally though, some sort of chrooted/virtualization approach could be used to allow this separation to be used more consistently for a large number of similar privilege problems.\r\n\r\nBtw, I am going to upvote you out of spite. There is a reason why forums like slashdot prevent a person from voting on the same thread in which he is commenting..\r\n\r\nFinally, my comment was no troll. I've posted the definition of this before, I won't again here. Now, saying that vi is the solution to this problem most definitely **is**. If that was your intention then great, it spurred a lively debate as intended.","controversiality":0,"subreddit_id":"t5_2fwo","link_id":"t3_sw2g","stickied":false,"subreddit":"programming","score":1,"ups":1,"author_flair_css_class":null,"created_utc":1164949658,"author":"[deleted]","author_flair_text":null,"parent_id":"t1_ct6g5","edited":false,"id":"ct6xm","gilded":0,"distinguished":null,"retrieved_on":1473807459,"timestamp_epoch":1566236758,"message_id":"594-fd00fdef-56c5-41ec-b94d-f607b5e25153-1566236758"}