{"retrieved_on":1473809711,"distinguished":null,"gilded":0,"parent_id":"t3_wgv0","id":"cwi7z","edited":false,"author_flair_text":null,"author":"twohundredninety","created_utc":1167528773,"author_flair_css_class":null,"score":-2,"ups":-2,"subreddit":"reddit.com","stickied":false,"link_id":"t3_wgv0","subreddit_id":"t5_6","controversiality":0,"body":"This is absurd. What is the *matter* if a nation's ethnic balance shifts? Why does the author think that this is some kind of disaster that must be averted? How would you avert it, anyway? Actively attempt to discourage Muslim immigrants because \"we don't want their kind?\"\r\n\r\nThis type of thinking causes atrocities against minorities. This type of thinking starts wars. Not only is it intolerant of others' religion, it's blatantly nationalistic -- the author apparently has a concept of Sweden as some kind of abstraction, as an ideal to preserve as if it were intrinsically valuable.\r\n\r\nGet over it, people. Political entities have no inherent value. Societies are valuable -- but they're more valuable when they're open-minded, tolerant and inclusive. When they're not, they're dangerous to their members and the rest of the world.\r\n\r\nStop living in the Middle Ages, people. Stop thinking of yourself as a citizen of a country and start thinking of yourself as an inhabitant of Earth. Stop thinking of yourself as a member of an ethnic group and start thinking of yourself as a member of the human race.\r\n\r\nMuslims exhibit religious intolerance as well, of course. That appears to be what the author of this post is afraid of. But why fight intolerance with intolerance? The idea that Muslims will, by their presence in a country, convert it to a theocracy is absurd, particularly since anyone interested in living in a theocracy would not emigrate out of one.\r\n\r\nImmigration is not a takeover attempt. The author of this post is responding in a hostile manner to a wholly non-hostile action, and is in the process advocating the devaluation of an entire culture.\r\n\r\nXenophobia has never gotten anyone anywhere.","timestamp_epoch":1566236780,"message_id":"59440-1358a945-0243-4ca2-a697-53cef0757dde-1566236780"}