{"author_flair_text":null,"author":"twohundredninety","id":"cwig9","edited":false,"parent_id":"t1_cwiai","gilded":0,"distinguished":null,"retrieved_on":1473809715,"body":"&gt;Your idea that Muslims exhibit religious tolerance is curious.\r\n\r\nI didn't say that. Quoting my comment, with additional emphasis:\r\n\r\n&gt;Muslims exhibit religious *in*tolerance as well, of course. That appears to be what the author of this post is afraid of. But why fight intolerance with intolerance?\r\n\r\nI recognize the fact that religious tolerance is not what Islam is known for. (At least, not lately. Centuries ago, it was fairly progressive on that issue, compared to Catholicism.) Every Muslim I've ever known has been perfectly tolerant of other beliefs, but it would be a mistake to deny that many powerful Islamic leaders are rabidly intolerant.\r\n\r\nYou're correct about my nationality, though -- I'm an American -- and you make a good point: having been raised in a country with no coherent national culture other than the latest insipid manufactured entertainment, it may be difficult for me to see the situation from the point of view of a Swedish native.\r\n\r\nBut I'm not objecting to the preservation of Swedish traditional culture -- the destruction of a culture under outside influence is tragic.. I'm objecting to the ideas that a.) anyone living in a country must assimilate to the national culture and b.) Muslims will refuse to assimilate and should therefore be kept out. It's the fusion of cultural and political identity that I find distressing -- the idea that the government is the guardian of culture and should take measures even unto excluding immigrants in order to preserve it. This bothers me even more when the excluded group is so narrow and so closely tied to a particular ethnic group. It is not racism in the strictist sense, but it disturbs me.\r\n\r\nIt's interesting that you think I must be ignorant of 19th and 20th-century history. The fusion of state and culture -- particularly the idea that the state should be responsible for maintaining the integrity of a nation's cultural identity -- fostered the aggressive nationalism responsible for the outbreak of massive wars across Europe in both the [19th](http://en.wikipedia.org/wiki/Napoleonic_wars) and [20th](http://en.wikipedia.org/wiki/World_War_II) centuries.  It would be *easier* to accept the kind of attitude exhibited by the article if I were ignorant of recent history.\r\n\r\n(But you're right about my age, and I suppose it's telling that you guessed it so closely.)\r\n\r\n*(edit: fixed broken link)*","controversiality":0,"subreddit_id":"t5_6","link_id":"t3_wgv0","stickied":false,"subreddit":"reddit.com","score":-1,"ups":-1,"author_flair_css_class":null,"created_utc":1167535720,"timestamp_epoch":1566236780,"message_id":"59576-cd64cee7-d9f6-46c8-ac6a-d8e091c1c14d-1566236780"}