{"id":"cwion","edited":false,"parent_id":"t3_wi17","author":"skyskraper","author_flair_text":null,"distinguished":null,"retrieved_on":1473809720,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_wi17","stickied":false,"controversiality":0,"body":"say it brutha! every experience i have with a gm product is the same. other issues:\r\n\r\n- cosmetic \"cheap outs\" like making all the trim black or grey to cut costs. they are even doing this on saabs! poor saab, gm basically destroyed what was a decent car company. i STILL see new gms and fords with all the trim (bumpers, handles, etc) black or grey.\r\n\r\n- safety \"cheap outs\" like not putting a passenger side mirror on a car. admittedly this was on a 1995 car, but even back then i wondered, was it really so expensive to put a mirror on both doors?\r\n\r\n- interior \"cheap outs\" like unlit controls where they can get away with it, poor indoor lighting, exposed wiring in the trunks.\r\n\r\nits amazing how gm and ford destroyed the foreign brands they bought in the 90s when their stocks were high (volvo, jaguar, saab, etc)...when the entire purpose of these acquisitions was the opposite - the infuse the domestic operations with some of the success of the acquired firms. \r\n\r\ni also love looking at GM and ford concept cars...then looking at what they deliver. the vehicles are rarely related even in basic shape. amusing how they use concept cars to generate excitement then just deliver a rebadged box.\r\n\r\noh, and GM and ford, kill these frigging dead brands already! who the hell says \"i really see myself as a buick man!\" or, \"its mercury all the way for me\", or \"i only buy plymouth\"??? these brands have a stink on them, just kill them entirely. even saturn has a stink on it. not sure how i could politely tell alan mullaly or rick waggoner that ALL of their brand names instantly translate to SHIT in my head.\r\n\r\nlastly good people, do stay away from volvo in particular. i have learned my lesson, all the recent models are rebranded ford shit, except the volvo dealership has convinced itself that its \"cachet\" extends to $200 tune ups.","ups":17,"score":17,"author_flair_css_class":null,"created_utc":1167541372,"subreddit":"reddit.com","timestamp_epoch":1566236780,"message_id":"59690-4c745fc1-833f-4d0c-8a62-ec8b2b5d14ba-1566236780"}