{"subreddit":"reddit.com","score":14,"ups":14,"created_utc":1167543486,"author_flair_css_class":null,"body":"This man knows his history...do you? Wiki snippets but search it on your own time.  Real knowledge is that which you seek on your own, not that programmed into you.  Why is it that we know about world leaders?  Which ones do we know about? Are there reasons why we are advertised to about these people? Is your truth and knowledge based on a cover story?  Did you know we hit 3000 dead soldiers jsut as Sadaam was \"executed\"?\r\n\r\n - Iranian overthrow http://en.wikipedia.org/wiki/Operation_Ajax (Asychronous coup de tat)\r\n\r\nOperation Ajax (1953) (officially TP-AJAX) was a covert operation by the United Kingdom and the United States to remove the democratically elected nationalist[1] cabinet of Iranian Prime Minister Mohammed Mossadegh from power, to support the Pahlavi dynasty and consolidate the power of Mohammed Reza Pahlavi. The idea of overthrowing Mossadegh was conceived by the British. They originally asked President Truman for assistance, but he refused. When Eisenhower became president in 1953, the British proposed the idea once again, and this time, the Americans agreed to help. Rationale for the intervention included Mossadegh’s socialist political views and his nationalization, without compensation, of the oil industry which was previously operated by the Anglo-Iranian Oil Company (which later changed its name to The British Petroleum Company) under contracts disputed by the nationalists as unfair. A particular point of contention was the refusal of the Anglo-Iranian Oil company to allow an audit of the accounts to determine whether the Iranian government received the royalties it was due. Intransigence on the part of the Anglo-Iranian Oil Company led the nationalist government to escalate its demands, requiring an equal share in the oil revenues. The final crisis was precipitated when the oil company ceased operations in Iran rather than accepting the Iranian government's demands. ... In 1979 Iran's Shah, Mohammad Reza Pahlavi, was overthrown in the Islamic Revolution, thus giving way to an Islamic republic led by Ayatollah Ruhollah Khomeini. The influence of revolutionary Shi'ite Islam grew apace in the region, particularly in countries with large Shi'ite populations, especially Iraq. Saddam feared that radical Islamic ideas — hostile to his secular rule — were rapidly spreading in southern Iraq among the majority Shi'ite population.\r\n\r\n - Iraq overthrow \r\nhttp://en.wikipedia.org/wiki/Saddam_Hussein \r\n\r\nIn 1958, a year after Saddam had joined the Ba'ath party, army officers led by General Abdul Karim Qassim overthrew Faisal II of Iraq. The Ba'athists opposed the new government, and in 1959, Saddam was involved in the attempted United States-backed plot to assassinate Qassim.[7] Saddam was shot in the leg, but escaped to Tikrit with the help of CIA and Egyptian intelligence agents. Saddam then crossed into Syria and was transferred to Beirut for a brief CIA training course. From there he moved to Cairo where he made frequent visits to the American embassy. During this time the CIA placed him in an upper-class apartment observed by CIA and Egyptian operatives. (UPI 'analysis' article) Concerned about Qassim's growing ties to Communists, the CIA gave assistance to the Ba'ath Party and other regime opponents.[9] Army officers with ties to the Ba'ath Party overthrew Qassim in a coup in 1963. Ba'athist leaders were appointed to the cabinet and Abdul Salam Arif became president. Arif dismissed and arrested the Ba'athist leaders later that year. Saddam returned to Iraq, but was imprisoned in 1964. He escaped prison in 1967 and quickly became a leading member of the party. In 1968, Saddam participated in a bloodless coup led by Ahmad Hassan al-Bakr that overthrew Abdul Rahman Arif. al-Bakr was named president and Saddam was named his deputy. Saddam soon became the regime's strongman. According to biographers, Saddam never forgot the tensions within the first Ba'athist government, which informed his measures to promote Ba'ath party unity as well as his ruthless resolve to maintain power and programs to ensure social stability.\r\n\r\n - Osama \r\n\r\n1993: Bin Laden Buys Airplane From US Military to Kill US Soldiers Bin Laden buys a jet from the US military in Arizona. The US military approves the transaction. The aircraft is later used to transport missiles from Pakistan that kill American Special Forces in Somalia. A man named Essam al Ridi will testify in a US trial before 9/11 that he buys a Saber-40 aircraft for $210,000, then flies it from Texas to Khartoum, Sudan. Bin Laden wants the plane to transport Stinger missiles, and apparently it is used in to transport some kind of missile from Pakistan that kill US Special Forces in Somalia in 1993. Essam al Ridi had just taken flying lessons himself (at the Ed Boardman Aviation School in Fort Worth) in an apparently early attempt by bin Laden to get more pilots. [Sunday Herald (Glasgow), 9/16/2001; Washington Post, 5/19/2002] Entity Tags: Osama bin Laden, Essam al Ridi\r\n\r\nhttp://www.cooperativeresearch.net/context.jsp?item=a93arizona#a93arizona\r\n\r\nhttp://www.cooperativeresearch.net/context.jsp?item=a1080octobersurprise#a1080octobersurprise\r\n\r\nhttp://www.washingtonpost.com/ac2/wp-dyn?pagename=article&amp;node=&amp;contentId=A39166-2002May18&amp;notFound=true (last few paragraphs -- always the best in the times and post)\r\n\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_wiic","gilded":0,"distinguished":null,"retrieved_on":1473809721,"author":"drawkbox","author_flair_text":null,"edited":false,"id":"cwiqt","parent_id":"t3_wiic","timestamp_epoch":1566236780,"message_id":"59714-825da9a4-ab3b-4cf7-ab89-92006fcd3bdd-1566236780"}