{"gilded":0,"retrieved_on":1473809734,"distinguished":null,"author_flair_text":null,"author":"berberine","id":"cwjgl","parent_id":"t3_wj0p","edited":false,"subreddit":"reddit.com","created_utc":1167572257,"author_flair_css_class":null,"score":-24,"ups":-24,"body":"&gt;Outspoken atheists like Scott remain a minority, but there are dozens of atheist chapters sprouting up around the country, and even many in Southern states dominated by conservative Christians.\r\n\r\nA chapter eh?  Are they starting their own type of frat or religion?\r\n\r\n&gt;Many who consider themselves atheists said they're afraid to mention their views on religion or that they don't believe in deities.\r\n\r\nFunny that I feel the same about my christian beliefs because I don't feel like being hassled by atheists who tell me I'm childish and believe in fairies.\r\n\r\n&gt;\"Do I think that any of these people are really afraid if someone knows they're an atheist that they're going to get shot down on the street tomorrow? No. But the thought is always there in the back of your mind,\" said Joe Mays, Louisville computer technician who helped organize an atheist group that meets monthly.\r\n\r\nAh, so you do think that religious people are going to come and kill you but you don't want to sound like a paranoid fruitcake so you say you don't.\r\n\r\n&gt;\"Nobody's your friend when you're an atheist,\" one member said.\r\n\r\nOh, boo hoo!  You want some cheese with that whine?  Several of my closest friends are atheists.  I don't have a problem with them and they don't have a problem with me.  \r\n\r\nMaybe, instead of segregating yourself by associating with only atheists you could mingle and talk about other stuff besides religion.  Christianity suffers the same problem.  As soon as they identify themselves as [insert group name] they only want to hang out with others that think like them.  Then, everyone runs around wondering why there's such intolerance in the world.\r\n\r\nAnd, like another poster said, having a note stuck on your car telling you that you're going to hell and are going to burn in NOT a threat.  Someone telling you that you are going to hell and burn, while holding a baseball bat is a threat.  \r\n\r\nThis guy is just causing a stink to stir up trouble.  Get over it and grow up. Learn to pick your battles and, trust me, some jackass who cowardly sticks notes on a car isn't a battle worth fighting.","controversiality":0,"stickied":false,"link_id":"t3_wj0p","subreddit_id":"t5_6","timestamp_epoch":1566236780,"message_id":"60085-4a4977af-0877-4487-812d-59d6d9244497-1566236780"}