{"distinguished":null,"retrieved_on":1473809734,"gilded":0,"id":"cwjh0","edited":false,"parent_id":"t1_cwjf9","author":"carpeliam","author_flair_text":null,"ups":2,"score":2,"created_utc":1167572825,"author_flair_css_class":null,"subreddit":"reddit.com","subreddit_id":"t5_6","stickied":false,"link_id":"t3_whql","controversiality":1,"body":"My point is, they're not trying to prevent the Grand Canyon National Park from giving an official estimate of the geological age. I gave you examples of how the NPS does, in fact, give official estimates of the geological age of the canyon. Rather, they're creationists are fighting to allow this book to be sold in the Grand Canyon bookstore, and PEER is fighting for the book to be removed.\r\n\r\nIf you do a google search for [faith based parks](http://www.google.com/search?q=faith+based+parks), the top two results will be from 2003 and 2004. Here's a quote from one of them:\r\n\r\n&gt; [Vail’s book attracted little notice when it first appeared in the NPS stores in 2003, until a critical review by Wilfred Elders, a respected University of California geologist, brought it to light and took apart its pseudoscientific claims. That led David Shaver, who heads the Geologic Resources Division of the Park Service, to send a memo to headquarters urging that the book be removed from the NPS stores. “It is not based on science,” he wrote, “ but on a specific religious doctrine…and should not have been approved for in NPS affiliated book stores.”](http://www.time.com/time/columnist/jaroff/article/0,9565,783829,00.html)\r\n\r\nAnd another:\r\n\r\n&gt; [Earlier this year [2003], the Bush administration prevented park rangers from publishing a rebuttal to the book for use by interpretive staff and seasonal employees who are often confronted during tours by creationist zealots.](http://www.counterpunch.org/stclair12222003.html)\r\n\r\nThat's not the same thing as preventing the NPS from giving an official estimate of the age. The NPS is allowed (and does, a lot) to state how old the canyon is.\r\n\r\nIf you do a google search for [grand canyon age](http://www.google.com/search?q=grand+canyon+age), the second link after the wikipedia entry for the grand canyon states:\r\n\r\n&gt; [Barna, of the park service, said interpreters who guide visitors through the park are aware there are different viewpoints on the canyon's development. \"They're instructed in the current scientific and geological explanation, which means very, very old, as in hundreds of millions of years,\" he said. \"I'm certain that park interpretative rangers get stopped frequently by people who believe the creationist view or maybe the Native American view. ... Our explanation is that we recognize that there are a variety of opinions.\"](http://www.beliefnet.com/story/138/story_13843_1.html)\r\n\r\n**The NPS isn't allowed to say that the book is wrong, but they're allowed to say that there are many different views.**\r\n\r\nAnd if you look at the NPS's own FAQ for the Grand Canyon, it states that the Grand Canyon was formed \"in the past five or six million years\". That sounds to me like an official estimate of the geological age.\r\n\r\nThe only reason that PEER's article (the one submitted the other day that every other blog on the internet is either directly or indirectly citing) was published recently, though every other article about the book was published 2 or 3 years ago, is because there is a new director for the NPS. The article is misleading readers into thinking that this is a new issue. It's in fact a few years old. The fact that PEER is the only recent source (other than the numerous blogs that cite PEER) for this should be an indication that there's probably more to the story than PEER says, and that PEER is probably not the most objective of news sources.","timestamp_epoch":1566236780,"message_id":"60093-8a755f74-438d-43e1-a024-3ef75f134817-1566236780"}