{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167584576,"ups":0,"score":0,"body":"You mean Jerry Christ?\r\n\r\nQuote from Robin Williams: Live on Broadway\r\n\r\nRobin Williams: Jesus was an only child, and thank God, because who would want to be Jerry, the brother of Christ? \r\n[pauses] \r\nRobin Williams: That's a tough gig. I'd imagine he ends up in a bar at the age of 30 going: \r\n[drunk voice] \r\nRobin Williams: \"Yeah, I'm Jerry Christ, whoop dee doo. Jesus is a carpenter, I'm a plumber; you do the math! Yeah, I healed someone. Come here Spot, heel! Look at that!\" And people tell me Jesus wasn't Jewish... of course he was Jewish! Thirty years old, single, living at home with his parents, come on. Working in his father's business, his mother thought he was God's gift, he's Jewish, *give it up!* It's an old tradition! And he was Jewish, and many of his Disciples were Jewish. But, for the Last Supper, would they not have gone out for Chinese? I think so. \r\nRobin Williams: [Chinese accent] 'Welcome to Yahweh. Hold on one minute; no service, no sandals. Okay, you come in now. Twelve, all I got is two tables of six. Wait a minute, you all sit here by the window, but you all have to face this way. \r\n[Reference to the Last Supper by DaVinci] \r\nRobin Williams: Hold on! You are glowing, so I guess we don't need that lamp, that's very nice! And you've just turned a Szechwan chicken into a live chicken, you very good!' \r\n[Reverent voice] \r\nRobin Williams: And that night, he said, \"One of you shall betray me.\" And Peter said, \"Is it me, Jesus?\" And Jesus turned to him and said, \"No, it is not you Peter.\" And Simon said, \"Is it me, Jesus?\" And Jesus said, \"No, it is not you Simon.\" And Judas asked, \"Is it me, Jesus?\" And Jesus turned to him, and said, \r\nRobin Williams: [Jesus with heavy sarcasm] *\"Is it me, Jesus?\"* And now you see two traditions beginning: Jewish sarcasm and Gentile humor. Together born! At that main moment! \r\n","controversiality":0,"link_id":"t3_wiuu","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809744,"distinguished":null,"author_flair_text":null,"author":"lahuman8","edited":false,"parent_id":"t1_cwjb8","id":"cwjy9","timestamp_epoch":1566236780,"message_id":"60294-45fc3a4b-e535-4b01-81c7-f0645233c4ec-1566236780"}