{"author_flair_text":null,"author":"supermike","parent_id":"t1_cwjhk","id":"cwk3m","edited":false,"gilded":0,"retrieved_on":1473809746,"distinguished":null,"body":"&gt; ipods suck? Really? The iPod has revolutionized how people listen to music. It may not have all the functionality you might want, but that does not mean that it sux.\r\n\r\nI'll grant you that one. If it weren't for the iPod, we probably wouldn't even have portable MP3 players. Maybe.\r\n\r\n&gt; Most consumers could care less weather or not the database is proprietary. Thay just want something simple that works and looks cool.\r\n\r\nGood for them. I have Linux. It's not compatible and the gtkpod software is buggy.\r\n\r\n&gt; iTunes is super easy to use and you can just drag and drop song files into iTunes pretty easily.\r\n\r\nNot if you have Linux.\r\n\r\n&gt; By the time the battery dies in most products people are alreadry ready for a new model anyway.\r\n\r\nNow that's absurd you'd say that. When you wrote that sentence, weren't you thinking that before you got to the period?\r\n\r\n&gt; If the iPod interface in frustrating, then how do you manage to tie your shoes in the morning? I guess you are a loafer kinda guy. I can't see how it could be any more simple to use.\r\n\r\nI have Linux. It's a bit of work to make an iPod work with Linux right now. The gtkpod software is buggy. Sometimes songs go on, sometimes they go on and others get orphaned. Sometimes they don't go on at all.\r\n\r\n&gt; Got any proof that iTunes reports people's activities?\r\n\r\nJust a suspicion. I don't have proof, no.\r\n\r\n&gt; Duh, every single product on the market that has any well known brand attached to it has some cost incurred from that brand. That is why companies advertise. If iPods are so damn expensive and frustrating, then it makes you wonder how they outsell the competition by a mile.\r\n\r\nThis is acceptable to me...to a point. But I can't justify chucking out $250 again for another iPod. That's patently ridiculous. I did it for my daughter because that's what she wanted, unfortunately.\r\n","controversiality":0,"link_id":"t3_wi17","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167587563,"score":2,"ups":2,"timestamp_epoch":1566236780,"message_id":"60384-0d5a6b3a-d74a-47cb-9f08-0d1330ac027b-1566236780"}