{"parent_id":"t1_cwk2e","edited":false,"id":"cwk9j","author_flair_text":null,"author":"supermike","distinguished":null,"retrieved_on":1473809749,"gilded":0,"subreddit_id":"t5_6","link_id":"t3_wjvh","stickied":false,"controversiality":0,"body":"Phil, I was in your boat in 2000. I had been a Microsoft MCSD (I know, gezunteit) for many years and annually forked out big bucks to renew my Universal subscription so that I could stay up to date on the very latest buggy stuff and command the highest salary possible. I had worked for Microsoft Corp. twice as a contractor and then ended up working for Avanade, which was partially owned by them. However, my experience at Avanade was a bad one. They had unbelievable demands, like learning VS.NET while it was still in beta and then switching a large insurance firm's line of business workflow app over to it the day VS.NET went gold. While I was in class, Avanade asked me to sit right next to my client and learn it faster than them, then be an advisor to them, which was preposterous. Then, when I got on site, I got backstabbed by Microsoft Consulting punks who didn't know the product very well and who also said you could use the IDE in VS.NET to do \"web form inheritance\", which isn't true -- it's \"win form inheritance\" in the GUI mode of the IDE, duh. Then, while on many gigs, I was getting pushed out by amateur phonies who couldn't program their way out of a box but lied and got their jobs anyway. It seemed that they would let anyone become an MS developer these days. And the Universal subscription was wearing on me -- especially when I saw how crappy SiteServer and SharePoint were with their bugs and limitations. Anyway, long story short, I got plenty sick of Microsoft and I said ENOUGH!!!\r\n\r\nI did some soul searching and a high school kid down the street amazed me by showing me his computer that was running RedHat 8. He handed me a CD. I started to learn Linux and was amazed. I started to realize that Linux was getting easier and easier, and Windows was getting harder and harder. I noticed the footprint of Linux's OS and other GNU stuff was small, and the equivalent footprint for Windows was massive. I saw all these viruses like Blaster that ripped right through Windows with no barrier, and yet Linux was extremely secure. I saw how VS.NET was something I had to constantly pay for every couple years, along with the Universal MSDN subscription, and I got sick of it. I saw how programming on Microsoft products was getting harder and harder, and doing the same on Linux was easier and easier. I saw how Linux was truly innovating, while Microsoft seemed to be doing copycatting. And I saw how VS.NET actually ran slower than VB6 because it had to \"thunk\" on the OS through the .NET APIs and get converted to COM APIs, and VB6 talked native COM, instead -- it was a secret step backwards and Microsoft was covering this important fact up! (They shared that tidbit with me at Avanade.) It wouldn't be until Windows Vista arrived (arrives?) that .NET APIs would no longer have to thunk down to the COM API layer.\r\n\r\nSo that's when I migrated from RH8, to RH9, to Fedora, to Suse, to Ubuntu. And Ubuntu is where I have remained for a good bit now. I was so pleased that I have switched my wife and kid's computers to it. We no longer run Windows in my house. At my office, I boot up on Linux and only use rdesktop/tsclient to connect to a Windows box to catch my Exchange email. I switched my job to Linux web developer from Windows web developer. (However, I'm now a Linux admin because my web job got outsourced to Brazil.)\r\n\r\nAnd then the whole DRM \"call home\" thing -- that irritated me. I've had it with the whole Orwellian nature of modern proprietary software.\r\n\r\nBTW, I doubt it will take a year to convert all your home computers to Ubuntu. Wish you best of luck in 2007!\r\n","score":43,"ups":43,"author_flair_css_class":null,"created_utc":1167590297,"subreddit":"reddit.com","timestamp_epoch":1566236780,"message_id":"60478-88405003-deeb-478b-b6ed-2689959825c9-1566236780"}