{"retrieved_on":1473809751,"distinguished":null,"gilded":0,"id":"cwkbq","parent_id":"t1_cwk6f","edited":false,"author_flair_text":null,"author":"[deleted]","created_utc":1167591394,"author_flair_css_class":null,"score":7,"ups":7,"subreddit":"reddit.com","stickied":false,"link_id":"t3_wif3","subreddit_id":"t5_6","controversiality":0,"body":"Actually that's a good point. Because it is indeed theological. But what else would expect of a religion.\r\n\r\n However, the point is that these people are actually humans, and some of them are quite decent humans at that. I've read a bit of litterature on the politics that went on inside the jewish community at the creation of Israel back in the middle of the century.\r\n\r\n I will keep it short, but here's a couple of points. There are some that believe in the \"Three Oaths\" that were broken when the state of Israel was formed. There's obviously shit loads of debate on the matter in the jewish community so you can just google for it, but the basic gist is that Jews were exiled from God's land and should not try to return their artificially - before god sends his messiah.\r\n\r\n Now here's my thing: as far as prophecy goes, they can believe in anything they want. That they believe a messianic warrior will convert the entire world to judaism is fine by me, no less than the fact that George Bush thinks the apocalypse is nigh.\r\n\r\n But from what I've read some of these rabbi's are quite human and understand the allegories of religion - or not, who knows - and have been quoted as giving very practical reasons not to create a zionist state: chiefly that it will increase anti-semitism world wide.\r\n\r\n And I think they are dead on the spot regarding that assessment.\r\n\r\n If we're gonna have religious zealots setting policy, I'd rather have rabbis like that that have a real human understanding of the situation, more than crusaders with flaming swords.","timestamp_epoch":1566236780,"message_id":"60507-a8bdb351-c79f-4bc9-8fbe-a9eeba963674-1566236780"}