{"subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1167594728,"ups":1,"score":1,"body":"If you want Detroit to be a better place, buying a car from GM is only one option (and not necessarily a good or effective one). A city that depend on one industry rises and falls with that industry's fortunes, but sadly the city falls a little harder and rises a little less.\r\n\r\nThe best thing would be to stimulate economic diversity, partly by courting other big companies, but mainly by making it easier for small businesses to thrive. Unfortunately, that requires (at least) two things that Detroit just doesn't do well:\r\n\r\n* have safe streets. That requires a robust police force, which requires a lot of manpower, which requires a lot of payroll dollars. Unfortunately, when a city's economy is slumping, few people are willing to view this as an investment in the city's future. All of the tax breaks and economic development zones don't mean a thing in the long run if consumers are afraid to visit and spend their money there.\r\n\r\n* have walkable streets. In addition to safety (again), that requires good public transportation, so that a pedestrian can get from here to there rapidly if need be, but can readily walk the streets and develop a feel for the neighborhood. But Detroit has been notoriously hostile to public transportation, because the more people rely on buses and trains, the less they need cars. That's where the auto industry has had disastrous influence, and unfortunately infrastructure is doubly expensive to fix once it has been put in place.\r\n\r\nI really don't know what one person can do to fix these, but I suspect it's on par with the influence that buying one car has. So don't settle for a lower quality vehicle--a part of your quality of life, after all--just because it might have a slight effect on the economy. (And how much do that poor steering and suspension contribute to accidents yearly?) You're losing more than you're giving back.","controversiality":0,"link_id":"t3_wi17","stickied":false,"subreddit_id":"t5_6","gilded":0,"retrieved_on":1473809754,"distinguished":null,"author_flair_text":null,"author":"madamImadam","id":"cwkgy","parent_id":"t1_cwitn","edited":false,"timestamp_epoch":1566236780,"message_id":"60596-0ae1b17f-a06b-4e9c-9b5d-75282ac3ba62-1566236780"}