{"author":"NoFixedAbode","author_flair_text":null,"parent_id":"t1_cwk8w","id":"cwkpu","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473809758,"body":"In addition to the other arguments here, I'd like to point you to noted Constitutional scholar Eugene Volokh's [testimony before Congress](http://www.law.ucla.edu/volokh/beararms/testimon.htm) that addresses your interpretation:\r\n\r\n&gt;Some argue the justification clause should be read as a condition on the operative clause:  The right to keep and bear arms is protected only when it contributes to a well-regulated militia, or only when the well-regulated militia is necessary to the security of a free State.  Thus, one commentator says, because \"the Framers included a preamble to the Second Amendment . . . [i]t is at least arguable that the only 'gun rights' protected by the Second Amendment are those that in fact support 'the security of a free State´ -- and that might mean none at all.\" \r\n\r\n&gt;Again, this seems inconsistent with the text, which contains no \"only when\" clause.  What's more, the text itself suggests that the operative clause is sometimes broader and sometimes narrower than its justification.  The underinclusiveness of the operative clause is uncontroversial:  The government is entitled to act in ways that are at odds with the Amendment's justification, so long as it doesn't deprive the people of the right to keep and bear arms.  Congress has no obligation, for instance, to properly train the militia, or to demand that it be armed.   Congress may even take steps that might undercut the value of a well-regulated militia to the security of a free state, for instance by creating a standing army.\r\n\r\nThe source contains supporting footnotes and much more material on the topic.\r\n\r\nIn summary: You're inferring that the justification clause (\"...being necessary to the security of a free State...\") is a limiting clause, when it's not.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_wj2d","subreddit":"reddit.com","score":8,"ups":8,"created_utc":1167599656,"author_flair_css_class":null,"timestamp_epoch":1566236780,"message_id":"60743-f7d790d1-fe1a-4139-bac9-76f1f98ac0be-1566236780"}