{"subreddit":"reddit.com","score":6,"ups":6,"created_utc":1167600349,"author_flair_css_class":null,"body":"What we need is a clarification of the concepts of \"search and seizure\" and \"arrest\", such that the various administrative intrusions, acts of spying, and detentions shall be classed under these well-understood categories.\r\n\r\nAny intrusion upon a person's private space or communication (\"persons, houses, papers, and effects\") for the purposes of gathering information needs to be understood as a search. The Fourth Amendment mentions \"papers\", which needs to be construed as meaning \"communications media\", including those media which did not exist in 1792, such as the telephone and Internet as well as the mail. Likewise, \"houses\" and \"effects\" need to be construed to include \"places\" in information systems, such as file servers, email accounts, and the like.\r\n\r\nSeizure needs to be reformed as well. Aside from reiterating the need for warrants issued upon probable cause, it needs to be understood that seized goods shall not be impounded for longer than the course of an investigation and trial, and shall not be damaged, destroyed, or sold. (Perishable goods that go bad during the course of an investigation may be an exception.) The party holding the seized goods needs to be answerable for their disposition: that means, if the cops seize your car and you aren't actually charged with a crime, you have a cause of action against them (you can sue and get your car back).\r\n\r\nThen, there is arrest. Once an arrest is performed, the fact of it must be a matter of public record. This is to prevent \"disappearances\".\r\n\r\nLastly, there is self-defense. It needs to be understood that you don't have to put up with wrongful violence from a cop or other government employee: if the police break into your house wrongfully, you may treat them the same as any other armed gang. \"Respect for the police\" needs to be based on respectable law-abiding and law-enforcing behavior by the police -- not on fear and threats.\r\n","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_wkmf","gilded":0,"distinguished":null,"retrieved_on":1473809758,"author":"fubo","author_flair_text":null,"edited":false,"id":"cwkqh","parent_id":"t3_wkmf","timestamp_epoch":1566236780,"message_id":"60760-1ab775a6-7f4f-44ae-8faa-24fd42adf9ba-1566236780"}