{"link_id":"t3_wjwi","stickied":false,"subreddit_id":"t5_6","controversiality":0,"body":"As a white male with a BA in African American Studies, I think there are a lot of misconceptions about the current state of the black community.\r\n\r\nOf the hundreds of different examples that can be brought up about what systemic factors continue to affect the black population, I like to use these two.\r\n\r\nThe first, explains the micro-oriented side of how racism affects individuals. In the book Why Race Matters by Michael Levin, he brings up an anecdotal situation. (I apologize if I have the wrong book, but I believe it is not Race Matters by Cornel West, another book worth reading). He (black) and his wife (white) are going to a neighborhood party. They are running late. Instead of driving, they decide to walk, but upon noticing how late they are, the wife decides to cross through two neighbors' yards and backyards to get to the next block. The author, who is black and grew up in a time and place where crossing into a white person's property meant jail or worse, he proceeded to walk around the block, showing up 15 minutes later.\r\n\r\nThe second shows the macro-orientation of race. It is generally well known that the wealth and education of a parent is one of, if not the, greatest indicator of the wealth and education of a child. Wealthy college graduates send their kids to good colleges. Those kids get good jobs, cycle continues. The generation of black children attending college now are the first generation to have parents who attended desegregated schools. Desegregation in the 60's meant better educations for parents who were having kids in the late 70's and 80's. Their kids now are attending college. We are not even 1 full generation out of segregation and we are surprised that African American's are still struggling?\r\n\r\nTo comment on the community aspect, it is true that strong communities united blacks and helped them cope with the struggles of overt racism. However, many of these community ties were, at heart, created by the necessity for survival, not some inborn characteristics that bond blacks together. It was the struggle that bonded them together. Now that the major burdens of that struggle have been overcome, the structures built to fight that struggle have been disassembled. Nevertheless, the dissociation within black communities is certainly no greater than the suburban islands commented on in books like Bowling Alone. This appears to be an American trend, not a uniquely black one.\r\n\r\nUnfortunately, because we are only a few decades out of segregation, the burdens are very different and only now are we beginning to develop, understand, and utilize new structures. It is no longer rallying a team to fight another, it is rallying an individual to fight and improve himself (despite the still very real limitations he or she faces). \r\n\r\nJust a few thoughts from a white southern male.","author_flair_css_class":null,"created_utc":1167605807,"score":24,"ups":24,"subreddit":"reddit.com","parent_id":"t3_wjwi","id":"cwkz3","edited":false,"author_flair_text":null,"author":"rjonesx","retrieved_on":1473809762,"distinguished":null,"gilded":0,"timestamp_epoch":1566236780,"message_id":"60924-427189c9-d26d-4df9-b178-1f95f8c823e6-1566236780"}