{"body":"First, read this: http://www.pathname.com/fhs/pub/fhs-2.3.html . Try to understand the rationale for each separation. This conversation will cannot go anywhere useful without an understanding of these concepts.\r\n\r\nI am certain that no one here will bother, so here's my quick rundown:\r\n\r\n* Writable data is separated from frequently modified data. This is major for backups.\r\n\r\n* User data is separated from system data. What if you want to migrate all of your data to a totally new system layout. Windows makes that a nightmare. Also makes a secure encryption system a huge pain.\r\n\r\n* system data is separated from site-wide data, ala /usr/share\r\n\r\n* predictable location of installed files and directories. Many windows apps still install to c:!! and other strange places.\r\n\r\n* certain partitions need to be available at different times. the /boot first, and /root has to be around even if /home dies.\r\n\r\n* Much more. Yes, achieving so many goals is complicated. If you can state that windows' fs layout in one short sentence then you know it's not achieving sh*t!\r\n\r\n&gt; which could be symlinked--I don't know what it's called--into another drive\r\n\r\nIt's called **mountpoints** and in the most incredible show of inferiority, windows doesn't support it!! Really, without this, everything just has gone downhill.\r\n\r\n&gt; And there're always system variables (%TEMP%, %APPDATA, etc.) How is that unpredictable?\r\n\r\nHow about that damn registry???? Just how do you propose that gets backed up. LFS has a better solution.. /etc\r\n\r\nReally, FS layout on windows is perhaps the worst disaster that Redmond ever let out. It's the feature that I despise the most. I should probably leave this thread now, before I break my keyboard in half..\r\n","controversiality":0,"link_id":"t3_t2dc","stickied":false,"subreddit_id":"t5_2fwo","subreddit":"programming","author_flair_css_class":null,"created_utc":1164950754,"score":0,"ups":0,"author_flair_text":null,"author":"[deleted]","id":"ct6za","edited":false,"parent_id":"t1_ct6lx","gilded":0,"retrieved_on":1473807461,"distinguished":null,"timestamp_epoch":1566236758,"message_id":"624-d4d2fbda-6e61-4865-8535-4f2db100a583-1566236758"}