{"subreddit":"reddit.com","score":2,"ups":2,"author_flair_css_class":null,"created_utc":1165227380,"controversiality":0,"body":"I've already found one statement which makes an appeal to \"common sense\" and personal experience without offering any scientific evidence (emphasis mine):\r\n\r\n\"Among women who have become mothers, the possibilities for high-level accomplishment in the arts and sciences shrink because, *for innate reasons*, the distractions of parenthood are greater. To put it in a way that most readers with children will recognize, a father can go to work and forget about his children for the whole day. Hardly any mother can do this, no matter how good her day-care arrangement or full-time nanny may be.\"\r\n\r\nSome handwaving, and we're expected to take on faith that women are \"innately\" more attached to their offspring than men.  Where's the evidence?\r\n\r\nI'm not disputing that mothers are generally more involved in child-rearing than fathers in our modern society, or that this is a large contributing factor to the dearth of female participation in demanding careers which occupy a lot of time and focus.  I'm objecting to the casual assumption that the root cause of this is some *innate* maternal instinct which makes mothers incapable of \"forgetting about their children for the whole day\".\r\n\r\nA few paragraphs later, the article mentions that some men and women who were tested for their opinions about careers \"came of age in the 1970's and early 1980's, when women were actively socialized to resist gender stereotypes\", implying that social factors can safely be assumed to be less important to the results -- as if a quick, intensive application of gender-neutral re-education (which may or may not even have been effective) can wipe out attitudes and traditions thousands of years old and put us all on an equal footing within a couple of decades.\r\n\r\nIt is precisely this kind of unwillingness to attach any kind of importance to social conditioning -- which can be subtle and pervasive, and does not come to a dead stop simply because you've made certain kinds of discrimination illegal or socially unacceptable -- that makes me mistrust these people's findings.  It may be that they're right, and I would like conclusive answers to be found, regardless of what the truth is -- but this article isn't convincing me.","subreddit_id":"t5_6","link_id":"t3_teev","stickied":false,"gilded":0,"distinguished":null,"retrieved_on":1473807693,"author":"confluence","author_flair_text":null,"id":"ctj9w","edited":false,"parent_id":"t3_teev","timestamp_epoch":1566236760,"message_id":"6288-995809c7-89d6-46bc-a602-24bec64cff20-1566236760"}