{"parent_id":"t1_ctjgc","id":"ctjqi","edited":false,"author":"bevets","author_flair_text":null,"retrieved_on":1473807701,"distinguished":null,"gilded":0,"link_id":"t3_tgvw","stickied":false,"subreddit_id":"t5_6","body":"Truth be told, evolution hasn’t yielded many practical or commercial benefits. Yes, bacteria evolve drug resistance, and yes, we must take countermeasures, but beyond that there is not much to say. Evolution cannot help us predict what new vaccines to manufacture because microbes evolve unpredictably. But hasn’t evolution helped guide animal and plant breeding? Not very much. Most improvement in crop plants and animals occurred long before we knew anything about evolution, and came about by people following the genetic principle of ‘like begets like’. Even now, as its practitioners admit, the field of quantitative genetics has been of little value in helping improve varieties. Future advances will almost certainly come from transgenics, which is not based on evolution at all. ~ Jerry Coyne \r\n\r\nWhat is the use of their unceasing mutations, if they do not change? In sum, the mutations of bacteria and viruses are merely hereditary fluctuations around a median position; a swing to the right, a swing to the left, but no final evolutionary effect.  ~ Pierre Grasse\r\n\r\nOn experimental grounds, I have shown that there are no known random mutations that have added any genetic information to the organism. I go through a list of the best examples of mutations offered by evolutionists and show that each of them loses genetic information rather than gains it. One of the examples that where information is lost is the one often trotted out by evolutionists nowadays in an attempt to convince the public of the truth of evolution. That is the evolution of bacterial resistance to antibiotics. ~ Lee Spetner","controversiality":0,"author_flair_css_class":null,"created_utc":1165238282,"score":-16,"ups":-16,"subreddit":"reddit.com","timestamp_epoch":1566236760,"message_id":"6476-fa4f315b-8a84-46d3-981b-092a53ab5824-1566236760"}