{"author_flair_text":null,"author":"bevets","edited":false,"id":"ctjsq","parent_id":"t1_ctikh","gilded":0,"retrieved_on":1473807702,"distinguished":null,"controversiality":0,"body":"This is probably why atheists HATED the [Santorum Amendment](http://en.wikipedia.org/wiki/Santorum_Amendment).\r\n\r\n\r\nConsider the role science now plays in education. Scientific \"facts\" are taught at a very early age and in the very same manner in which religious \"facts\" were taught only a century ago. There is no attempt to waken the critical abilities of the pupil so that he may be able to see things in perspective. At the universities the situation is even worse, for indoctrination is here carried out in a much more systematic manner. Criticism is not entirely absent. Society, for example, and its institutions, are criticized most severely and often most unfairly and this already at the elementary school level. But science is excepted from the criticism. In society at large the judgment of the scientist is received with the same reverence as the judgment of bishops and cardinals was accepted not too long ago. The move towards \"demythologization,\" for example, is largely motivated by the wish to avoid any clash between Christianity and scientific ideas. If such a clash occurs, then science is certainly right and Christianity wrong. Pursue this investigation further and you will see that science has now become as oppressive as the ideologies it had once to fight. Do not be misled by the fact that today hardly anyone gets killed for joining a scientific heresy. This has nothing to do with science. It has something to do with the general quality of our civilization. Heretics in science are still made to suffer from the most severe sanctions this relatively tolerant civilization has to offer.  ~ Paul Feyerabend","link_id":"t3_tgvw","stickied":false,"subreddit_id":"t5_6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165239159,"score":-13,"ups":-13,"timestamp_epoch":1566236760,"message_id":"6495-abd6a3aa-3678-46bf-bf69-2a5b6cb40e14-1566236760"}