{"author":"duketime","author_flair_text":null,"parent_id":"t3_tkeo","id":"ctkpr","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473807719,"controversiality":0,"body":"While he has some decent points (I use Google out of habit but actually sometimes find Yahoo, his big loser, to be preferable--and haven't really worked with Live), he presents his arguments very poorly.  I posted this on his site:\r\n\r\n) You make no justification for the impending \"record loss\" aside from Google being \"overvalued\". I hate to break it to you, but overvalued stocks exist in the market, and you sometimes even make money in them! Aside from some extreme news event (\"Google scraps search for hookah business\"), only severely missing their earnings could ruin a stock so, and the earnings call will be about mid-January. But you did manage to cobble together a sensational, attention-grabbing (albeit 100% unsubstantiated) headline!\r\n\r\n2) You unjustifiably assume that the case for your site is representative of the web as a whole. Google and Yahoo might not \"get\" your site ... or maybe your site doesn't \"get\" Google and Yahoo. Remember that Google and Yahoo and MSN drive traffic TO your site, not the other way around and while it is in their interests to correctly classify your site, it's also in your interests to fit your site to the #1 search engine. It sounds like sour grapes that you don't feel like the most popular search engine understands your site. Change your site.\r\n\r\n3) You also unjustifiably argue that \"best\" (or, more precisely, your definition of \"best\") is equivalent to \"most successful\". There are thousands of examples of the \"best\" product not succeeding and, even if Google actually isn't the best, there's no reason why Google can't succeed in spite of it. They're already far and away the most popular search and you're subjective \"analysis\" that it isn't the \"best\" search doesn't present suitable justification for why that will change.","subreddit_id":"t5_6","link_id":"t3_tkeo","stickied":false,"subreddit":"reddit.com","score":3,"ups":3,"author_flair_css_class":null,"created_utc":1165252535,"timestamp_epoch":1566236760,"message_id":"6917-d2fb8d90-0bcb-4d02-a39c-c9e5d988885a-1566236760"}