{"subreddit":"reddit.com","score":13,"ups":13,"created_utc":1165259180,"author_flair_css_class":null,"body":"&gt; How 14th Century of them.\r\n\r\n***How very \"arrogant-ignorant-american\"-ish of you (and everyone who upmodded your comment)!!!***\r\n\r\n1. Clitoridotomy\r\n\r\n    - involves the removal or splitting of the clitoral hood.\r\n\r\n    - ***From the late 19th century until the 1950s***, clitoridotomy and other more invasive procedures, including excision of the clitoris and infibulation ***were practiced in Western countries to control female sexuality***, and ***were advocated in the United States by groups like the Orificial Surgery Society until 1925.*** Doctors advocating or performing these procedures claimed that girls of all ages ***would otherwise engage in more masturbation and be \"polluted\" by the activity, which was referred to as \"self-abuse\"***.\r\n\r\n    - Through the 1950s, some doctors continued to advocate clitoridotomy for hygienic reasons or to reduce masturbation. For example, C.F. McDonald wrote in a 1958 paper titled Circumcision of the Female[7]\r\n\r\n\r\n2. Clitoridectomy\r\n\r\n    - means the partial or total removal of the external part of the clitoris\r\n\r\n    - ***Blue Cross Blue Shield paid for clitoridectomies in the U.S.A. until May 18, 1977 [13].*** Clitoridectomy is still being practiced in isolated instances.\r\n\r\n3. Infibulation\r\n\r\n    - This is the most severe form (done without anesthesia ) an the only form NOT practiced in \"western world\", rarely practiced in Middle-east and quite often in Africa.\r\n\r\n----------------------------------------------------\r\n\r\n\r\nAlso:-\r\n\r\n- No form of genital modification and mutilation is mentioned in the Qur'an, quite the contrary: \"We have indeed created man[kind] in the best of moulds\" (Al-Tin 95:4). [20]\r\n\r\n- Only one of the four Islamic schools of juriprudence or law, the Shafi'i school, ordered for a \"slight trimming\" of the hood of the clitoris, supposedly in order to enhance sexual pleasure for the woman. Most contemporary scholars reject it completely.\r\n\r\n- In Shia Islam, the practice of female circumcision has never been to remove the clitoris, and this form is outlawed by all leading Marjas that intepret Sharia traditions. The main form of surgery is to remove a small piece of the hood over the clitoris in order to increase sexual pleasure. This act is considered Mustahab and not Wajib or compulsory.\r\n\r\nAnd\r\n\r\n- ***Amnesty International asserts that \"FGC predates Islam and is not practised by the majority of Muslims, but has acquired a religious dimension.\"***\r\n\r\n--------------------------------------\r\n\r\nSo, if the war-torn, dirt poor, largely-illiterate parts of Africa are about 20-30 years behind the \"Land of the Free, Home of Brave\".. I don't think it's something we should gloat about.. \r\n\r\n***Sorry to reduce your all-american GOD-Complex by a little bit.. ***\r\n\r\nAnd all this ***SHOUTING***\r\n\r\n------\r\n\r\n[All info from ONE PAGE in Wikipedia (link)..(It was not really difficult to search for or obscure..But, maybe, passing judgment on Muslims with little or no knowledge or info about the subject is a lot more easier..)](http://en.wikipedia.org/wiki/Female_genital_cutting)\r\n","controversiality":1,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tk48","gilded":0,"distinguished":null,"retrieved_on":1473807728,"author_flair_text":null,"author":"rocky_m","edited":false,"id":"ctl83","parent_id":"t1_ctkc0","timestamp_epoch":1566236760,"message_id":"7159-d964312d-dc04-4d0a-9acd-a72e5f38890d-1566236760"}