{"gilded":0,"distinguished":null,"retrieved_on":1473807734,"author":"duketime","author_flair_text":null,"id":"ctlj2","parent_id":"t1_ctl00","edited":false,"subreddit":"reddit.com","score":16,"ups":16,"created_utc":1165262737,"author_flair_css_class":null,"controversiality":0,"body":"Yes.\r\n\r\nBut, more specifically, currency devaluation and recessions are devastating especially in that they cause more damage at the bottom than the top.\r\n\r\nObviously, the wealthy lose \"more\" in the strictest sense but only because they have more wealth.  But a closer analysis illustrates how these sorts of things further widen the class gap:\r\n\r\nThe dollar weakens:  lower classes are disproportionately levered to the dollar:  their jobs pay in dollars, they buy their goods in dollars, and they keep their wealth as dollars.  The weakening dollar devastates these people.  The key difference (aside from the minor point that the rich more likely have the flexibility to get paid and buy their goods in foreign currencies by moving) is that the wealthy have a much greater ability to keep their wealth in non-dollar investments.  Yeah, the poor can buy actual gold, and the market will take their money all the same, but it is more difficult (and relative to their respective wealths much more difficult) to do so, because of economies of scale, transaction costs, etc.\r\n\r\nIt goes all the way up to the top:  as you get wealthier you can more easily buy foreign stocks, have foreign bank accounts, buy foreign real estate, etc.\r\n\r\nNot to mention that in slowdowns, the poor are often the first to lose their job (and the ones most hurt by job loss).\r\n\r\nIn this way, recessions are like Hurricane Katrina:  the poor were hit first and hit hardest while the wealthy are still affected but are likely pretty well insured against such events.","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tkm9","timestamp_epoch":1566236760,"message_id":"7322-ca233f00-9c46-40d6-bfd7-374b609823dd-1566236760"}