{"controversiality":0,"body":"&gt; Doesn't seem that you understand the concept of manners.\r\n\r\nIncorrect, but you seem unable to understand you're not above others. Laws are not extensions of manners. That is absurd, and amusingly ignorant.\r\n\r\n&gt; Rights and laws are an extension of manners.\r\n\r\nNo they are not. Manners are strictly authority by tradition. Laws, however, are more complex, being set of communal agreements, but also have a natural flexibility since authority is not strictly based on immediate history. \r\n\r\nWhereas they can each be based or influenced by the other, they are not mutually exclusive as you suggest.\r\n\r\nWhile it's good manners not to steal, it's also law. But it's not illegal to kiss in public, even if it's considered bad manners to some.\r\n\r\n&gt; Impose? No I am saying that you should be responsible for your actions. Maybe this is something the liberals have been getting away from.\r\n\r\nStop assuming I'm a liberal. Knowing the difference between law and custom has nothing to do with politics. It's understanding moral and social boundaries. You seem to have trouble with that.\r\n\r\n&gt; A request to cease offensive actions should be honored even if I do not belive it is offensive. Kind of like wearing a KKK hood to a church on Sunday. Making fun of a disability to a disabled person. Calling people rude names.\r\n\r\nOne of the three is bordering on hate crime. Can you tell me which, and explain why? Do you even know the difference?\r\n\r\nThere is a reason why cops don't shoot a kid who makes fun of a disabled person. But according to your own argument, there is no difference.\r\n\r\nYou clearly display little understanding of causality in society, and every argument you make is based on simplistic direct causality (this causes this). It's simply not how the world works.\r\n\r\nBeing responsible for your own actions is not the same as societal enforcement. Manners are not law or rights. Free speech does not mean \"freedom unless someone else says otherwise\". Public display of affection is not covered by laws in any developed countries - for a reason.\r\n\r\nI believe in full responsibility for ones own actions. I also believe it is equally important to understand what this actually means. You clearly don't. You stop at, somewhat simplified for brevity, \"if i don't  like it, it's not right\". That's ignorance, bigotry, or simply intellectual and moral laziness.\r\n\r\n&gt; Impose? No I am saying that you should be responsible for your actions. Maybe this is something the liberals have been getting away from.\r\n\r\nThis demonstrates my point above. The US government the past six years seem to demonstrate that the opposite is in fact true. Or haven't you noticed?","stickied":false,"link_id":"t3_t6wc","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165264197,"author_flair_css_class":null,"score":1,"ups":1,"author_flair_text":null,"author":"dln","parent_id":"t1_ctk5m","id":"ctln4","edited":false,"gilded":0,"retrieved_on":1473807736,"distinguished":null,"timestamp_epoch":1566236760,"message_id":"7393-0bd04afa-3d1c-43ab-929a-f09998cfe554-1566236760"}