{"controversiality":0,"body":"It was obvious that both the general theory of evolution and its extension to man in particular must meet from the first with the most determined resistance on the part of the Churches. Both were in flagrant contradiction to the Mosaic story of creation, and other Biblical dogmas that were involved in it, and are still taught in our elementary schools. It is creditable to the shrewdness of the theologians and their associates, the metaphysicians, that they at once rejected Darwinism, and made a particularly energetic resistance in their writings to its chief consequence, the descent of man from ape. ~  Ernst Haeckel  \r\n\r\nThe evolutionary hypothesis, carried to its logical conclusion, disputes every vital truth of the Bible. Its tendency natural, if not inevitable, is to lead those who really accept it, first to agnosticism and then to atheism. Evolutionists attack the truth of the Bible, not openly at first, but by using weasel-words like \"poetical,\" \"symbolical,\" and \"allegorical\" to suck the meaning out of the inspired record or man's creation.  ~ William Jennings Bryan\r\n\r\nA widespread theological view now exists saying that God started off the world, props it up and works through laws of nature, very subtly, so subtly that its action is undetectable. But that kind of God is effectively no different to my mind than atheism. To anyone who adopts this view I say, ‘Great, we’re in the same camp; now where do we get our morals if the universe just goes grinding on as it does?’ This kind of God does nothing outside of the laws of nature, gives us no immortality, no foundation for morals, or any of the things that we want from a God and from religion.  ~ William Provine","subreddit_id":"t5_6","stickied":false,"link_id":"t3_tgvw","subreddit":"reddit.com","score":-9,"ups":-9,"created_utc":1165267628,"author_flair_css_class":null,"author":"bevets","author_flair_text":null,"parent_id":"t1_ctltb","id":"ctlww","edited":false,"gilded":0,"distinguished":null,"retrieved_on":1473807741,"timestamp_epoch":1566236760,"message_id":"7539-bc99f8f0-2a81-4dc9-b697-5c6bf7b22e0d-1566236760"}