{"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_tksn","body":"Perhaps it's not clear from this one post, but if you read the following posts, you can see that he is comparing Lisp to the languages today's operating systems are written in (that would be C).\r\n\r\nUnlike other languages like Ruby, Perl, Python, OCaml, Haskell, C, C++, and D, Lisp does not fit well in a unix-like environment. In this regard, Lisp is similar to Java (and Smalltalk). It's not well suited for small programs intended to be run from the commandline. Lisp and Java don't have functions that map directly to POSIX API functions of the OS (e.g. file system related stuff. There is no clean way to check if something is a symbolic link in Java, and there is no such thing as a current process working directory, etc.). In other languages, the build is done by an \"external\" tool chain, e.g. you invoke \"make\", which in turn invokes the compiler, producing object files, then the linker creates an executable program which you can start from the command line or some menu or GUI. With Lisp, you startup an image. This image contains the compiler, build tool, documentation system, etc. Instead of running many different programs from the shell, you invoke functions from the Lisp repl. To deploy an end-user application you can create a standalone executable or write a start script (that's how the Java guy's do it).\r\n\r\nI think this difference in philosophy and basic development style is the biggest entry barrier to Common Lisp. Newbies often ask how to create standalone executables or how to run CL code like other scripts with a #! line. The first thing a CL newbie should realize is that the Lisp image is the OS.\r\n\r\nFor people who don't want to subscribe to this philosophy but want to learn something Lisp-like, I recommend to use Scheme. Scheme implementations produce small executables, or can be used like typical (say Perl, Ruby) script interpreters.","controversiality":0,"score":9,"ups":9,"created_utc":1165267940,"author_flair_css_class":null,"subreddit":"programming","edited":false,"parent_id":"t1_ctlfr","id":"ctlxh","author":"shit","author_flair_text":null,"distinguished":null,"retrieved_on":1473807742,"gilded":0,"timestamp_epoch":1566236760,"message_id":"7554-8b22b587-5a9c-446c-a7e1-599a9512ba52-1566236760"}