{"gilded":0,"distinguished":null,"retrieved_on":1473807755,"author_flair_text":null,"author":"panic","parent_id":"t3_tksn","edited":false,"id":"ctmmw","subreddit":"programming","score":3,"ups":3,"created_utc":1165276373,"author_flair_css_class":null,"body":"Java has a specific world view which makes it less compatible with the\r\ncurrent outside world.\r\n\r\nLet me list a few.\r\n\r\n* Java usually needs garbage collection. There are almost no standards\r\nfor garbage collection systems.\r\n\r\n* Java programs often have a high object allocation rate. Thus Java usually needs\r\na very efficient garbage collector to be competitive.\r\n\r\n* Java has the idea of high dynamisn in the runtime. You can redefine\r\na function and user code will immediately use the new one. You\r\ncan change a class and existing objects will be changed. You\r\ncan change an object from one class to another. All this\r\ninduces additional redirections.\r\n\r\n* Java in its standard data types does not care that much about data layout.\r\nThis can be inefficient.\r\n\r\n* Java has typed objects with identity. Objects carry around their\r\ntypes (often using low-level tags). This again makes Java objects\r\nin their data layout incompatible with most other systems.\r\n\r\n* Java prefers heap consistency. Usual operations should not\r\ncorrupt the heap in the presence of dynamic typing.\r\nThis makes it necessary to check operations\r\nbefore they are applied to objects. Untagged objects are\r\ncannot be checked without knowing their types from somewhere else.\r\n\r\n* In the presence of large virtual memory systems, you immediately\r\nneed special infrastructure to reduce paging when you deal\r\nwith a pointer chasing language like Java applied to a\r\napplication domain with GBs of memory.\r\n\r\n* Support for Object-oriented\r\nProgramming is still unusual in the operating systems we use.\r\nStandards are rare (CORBA, .net, ...) and limited.\r\n\r\n* No current OS uses Java's infrastructure as a model\r\nof organizing memory and/or data. There is no support from\r\nother communities for the Java infrastructure.\r\n\r\nThere is more to mention, but this should be sufficient to list.\r\n\r\nThe consequences are:\r\n\r\n* most OS-level development tools cannot easily or usefully applied\r\nto Java code.","controversiality":1,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_tksn","timestamp_epoch":1566236760,"message_id":"7869-7834a117-2be1-4f5c-9e22-fd129d2f6e14-1566236760"}