{"gilded":0,"retrieved_on":1473807762,"distinguished":null,"author_flair_text":null,"author":"The_Bears","edited":false,"parent_id":"t3_tn1p","id":"ctn1q","subreddit":"reddit.com","created_utc":1165285200,"author_flair_css_class":null,"ups":1,"score":1,"controversiality":0,"body":"In reaction to [Yahoo TV getting AJAXed to death](http://reddit.com/info/ths1/comments), I've been looking for a new TV listings site. I thought I'd share my findings. I found all the sites except MSN TV through the [comments](http://yodel.yahoo.com/2006/11/28/anything-good-on-tonight/#comments) on the Yahoo TV blog entry announcing the changes.\r\n\r\nHere's what I'm looking for:\r\n * Clean and readable\r\n * No login required\r\n * Allows bookmarking of current listings (no dependence on cookies, POST data, etc)\r\n * Fast and doesn't bring my browser to its knees.\r\n\r\n\r\n[AOL TV](http://tvlistings.aol.com/)  \r\nPros: Looks good. Current listings are bookmarkable. Shows all channels at once  \r\nCons: Does not work in Opera. Sometimes loads slowly. No way to bookmark listings for a specific date and time.\r\n\r\n[Excite TV](http://tv.excite.com)  \r\nPros: Looks ok. No logins. Displays all channels at once.  \r\nCons: Not bookmarkable. \r\n\r\n[Meevee](http://meevee.com/myguide.aspx)  \r\nPros: Looks ok. No logins.  \r\nCons: Almost as slow as the new Yahoo TV. Not really bookmarkable, although it tries to guess your provider if you haven't set one which mitigates it a bit. The grid scrolls within a fixed-height area.\r\n\r\n[MSN TV](http://tv.msn.com/)  \r\nPros: Looks ok. No logins. Displays all channels on  one page.  \r\nCons: Not bookmarkable.\r\n\r\n[Myway TV](http://tv.myway.com/)  \r\nPros: Unknown. Did not test.  \r\nCons: Requires login.\r\n\r\n[Titan TV](http://www.titantv.com/)  \r\nPros: Looks ok. No logins.  \r\nCons: Not bookmarkable.\r\n\r\n[Zap2it](http://tvlistings.zap2it.com/)  \r\nPros: Looks good. No logins. Allows bookmarking of current listings.  \r\nCons: Doesn't display all channels on one page. There is a link to do so, but it's not bookmarkable.\r\n\r\nFor my needs, AOL TV and Zap2it are the only ones that come close. AOL TV would be the clear winner if it worked in my browser. Both of those sites are pretty good, and one problem away from being exactly what I'm looking for.\r\n\r\n&lt;rant&gt;\r\nThat all but two of the sites failed the bookmarking/linking test came as a rude surprise. **This is the fucking web, people.** You're supposed to be able to link to things. You remember links, right? The most basic building block of the web? The thing that makes hypertext different from regular text? That's right, links! Not pseudo-links whose destination is ambiguous without session state, and not things that look like links but are really little form-posting Javascripts. There is a place and a time for all those \"make the user go in the front door first\" techniques, and **this is not it**.\r\n\r\nIf you can't handle that, get the fuck out of my line of work and make room for those of us who know what we're doing.\r\n&lt;/rant&gt;\r\n\r\nWhee. That feels better.","stickied":false,"link_id":"t3_tn1p","subreddit_id":"t5_6","timestamp_epoch":1566236760,"message_id":"8076-b114d55b-8678-4b1e-a83e-3e1c2438fe84-1566236760"}