{"subreddit":"reddit.com","ups":2,"score":2,"created_utc":1165287942,"author_flair_css_class":null,"body":"&gt;Bullshit. The vast majority of jews are caucasian in race.\r\n\r\nFirst you propose the existence of race, now you conflate skin color with race.  The vast majority of Ashkenazim appear as Europeans do when in a habitat with as much sunlight as Europe.  When in sunny places like Israel (where the Semites, the cultural group, evolved), most of them turn an individualized shade of brown.\r\n\r\nWait a minute.  People can change their skin color depending on the level of sunlight in their environment?  Either race is bullshit or we've got mutant race-changers on the loose!\r\n\r\n&gt;I don't think so. There are jewish only roads in israel are there not? There are jewish only neighborhoods are there not?\r\n\r\nAgain you foolishly imply that Jews are a race.  They are not.\r\n\r\nAlso, you imply that the antequated concept of \"racial purity\" has anything to do with ethnic discrimination.  It only does so when the discrimination in question concerns *breeding*.  Jewish-only neighborhoods or roads would have no bearing on \"racial purity\", if any of those three things actually exist.  I grant you the Jewish-only neighborhoods, but nothing more.\r\n\r\nBut back to the non-existent racial-purity.  Are there people who will only marry Jews?  Yes, we mostly call them Jews.  For thousands of years such ethnocentric marriage has been the norm for all peoples everywhere, and if you propose to change it for some ideal of genetic mixing you will, of course, be robbing people of their human right to marry whom they choose.\r\n\r\nPut simply, we have no evidence to conclude that Israeli Jews or anyone else have revived the thoroughly discredited notion of \"racial purity\", ie: the containment in a \"race's\" collective gene pool of genes proceeding only from invididuals of that \"race\", or perhaps only genes yielding \"racially\" desirable traits.\r\n\r\nIn fact, I think we've managed to completely refute the notion of race over again.","controversiality":0,"subreddit_id":"t5_6","stickied":false,"link_id":"t3_tfob","gilded":0,"distinguished":null,"retrieved_on":1473807765,"author":"EliGottlieb","author_flair_text":null,"id":"ctn7s","edited":false,"parent_id":"t1_ctmov","timestamp_epoch":1566236760,"message_id":"8157-4e8453d9-e43f-4b5a-906e-97ef7d3444e9-1566236760"}