{"author_flair_text":null,"author":"duketime","parent_id":"t1_ctmzn","id":"ctnlx","edited":false,"gilded":0,"retrieved_on":1473807773,"distinguished":null,"controversiality":0,"body":"I don't completely disagree.  I've been able to open online broker accounts with relatively little capital and $7/trade, which allows me foreign exposure (or even the ability to short American, which is profiting from recession of course).  But it's all after a point.  To be effective, you need internet access (and most likely your own connection to research, if you hope to invest intelligently) and you'll be pretty much on your own.\r\n\r\nPerhaps it's somewhat unfair to extend my point this far, but it's about education also.  You and I both (likely) went to college (or at least had access to good education) so we know ETF, Spiders, ADRs, Bonds, Commodities, etc. are available (and we have internet to find out *how* to access them).\r\n\r\nI just think a lot of people (especially those on the internet) aren't rich-rich (which is why we're wasting time on the net rather than on some yacht or about brokering megadeals on our Blackberry) but we're not poor (to the point where we needn't worry about food and are more than capable of covering costs like cable--typically the #1 optional expense, I've read--, internet, cell phone).\r\n\r\nMy point is that as great as ETFs or even (shudder, personally) Mutual Funds can be.  They're not an option for anybody up until a certain financial flashpoint (I use $20,000 in another post).  Up until that point, every American essentially receives their money in dollars and spends their money in dollars and there's nothing we can do about it.  For people who make more than $20,000, that's great -- *that's* money they can use to hedge and save and whatever if they choose (or if American, neglect to choose) to do so.  It's those people who don't have income past $20K that are deeply screwed.\r\n\r\nBut, I agree wholeheartedly for the (vast segments of population) that are at least rich enough to get by (the issue there is access, education).","stickied":false,"link_id":"t3_tkm9","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165296769,"author_flair_css_class":null,"score":2,"ups":2,"timestamp_epoch":1566236760,"message_id":"8373-5e6c79dc-7d33-4df7-ab4e-172baf62e5b4-1566236760"}