{"edited":false,"id":"ct7e7","parent_id":"t1_ct6yk","author_flair_text":null,"author":"[deleted]","retrieved_on":1473807469,"distinguished":null,"gilded":0,"stickied":false,"link_id":"t3_t4oa","subreddit_id":"t5_6","controversiality":0,"body":"Major reason why developing countries are not able to produce new drugs:\r\n1.No (singnificant) public funding for research. Universities do zero research. \r\n2. Trained researchers migrate to developed world.\r\n3. No public infrastructure for conducting research.\r\n\r\nIn west, a lot of public money is spent on research that indirectly contributes to the drug development. Health research is probably the most inefficient sector, huge money spent on people / projects with no planned results. 800 Million figure seems highly inflated. Anyway lets say the Anti-aids medicine was sold at $2 per day to people here, profit margin to the company would easily be about $400 per patient per year. Divide 800 million by 400 and you get 2 million. That means you need 2 million patients to recover the cost of new drug development in just one year. Lets spread the recovery to about 3 years (10 years is standard in most infrastructure projects). You need less than 700 thousand patients to be able to recover the cost in 3 years. I think its clear pharma sector is quite greedy simply becasue they are so indispensible. And because Japanese and Koreans have not ventured in this sector. But every sector needs some japanese to revolutionise it. Like Japanese did to Auto, Koreans and Tiwanese to Electonics, Chinese to the Dolloar-store products. Indians have to the potential to do that to the Pharma sector.\r\n\r\nBut there is no doubt that India has to implement the Patent rules to be at par with the world. But at the same time provide level playing field to companies like Cipla. Its probably not very easy. But then nothing else is.","created_utc":1164962457,"author_flair_css_class":null,"score":2,"ups":2,"subreddit":"reddit.com","timestamp_epoch":1566236758,"message_id":"849-8cd70777-3105-4092-8a60-348fb45353a7-1566236758"}