{"gilded":0,"retrieved_on":1473807783,"distinguished":null,"author_flair_text":null,"author":"ryant71","id":"cto61","edited":false,"parent_id":"t1_cqsum","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165310620,"score":2,"ups":2,"controversiality":0,"body":"\"I suggest you also outlaw sunglasses and hats.\" \r\n\r\nOut of politeness (even if I end up squinting into the sun) I will remove my sunglasses when talking to someone I respect. \r\n\r\n    \"Aren't you disregarding their feelings when you are \r\n    forcing them to not wear a veil? Aren't you saying to \r\n    them that their wishes don't matter and the only \r\n    important thing is your culture, your values, your \r\n    perceptions and what you want.\"\r\n\r\nWould the feelings of my wife be disregarded if she were to travel to Iran and prefer to dress like a westerner? Yes! (Actually, if she were to travel to Iran, she'd get quite a kick out of experiencing Iranian culture; including dressing like an Iranian.) When in Rome do Romans. I mean. Do as the Romans do. \r\n\r\nI think that this whole issue has been blown out of proportion by people holding both views. Westerners should try harder to accept immigrants. And immigrants should try harder to integrate themselves into their adopted culture.\r\n\r\nAgain, an original (minor) problem seems to have exploded because of a rabid fixation on \"rights\". Everyone is on about their rights. We should all rather focus on our responsibilities. To ourselves and to each other. The westerner has the responsibility of welcoming the immigrant into their culture and lives, the immigrant has the responsibility of opening up their own culture and lives for their adopted countrymen. \r\n\r\nAll I am saying is that wearing a veil is not a very responsible way of integrating one's self into an adopted comminity. \r\n\r\nThere was also some devil's advocate stuff there. As a lover of curries and other treats from the East I am all for sharing.","link_id":"t3_qpu3","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236760,"message_id":"8587-b7963f61-d26a-476c-b37b-80ecf9aa8c6c-1566236760"}