{"gilded":0,"retrieved_on":1473807792,"distinguished":null,"author_flair_text":null,"author":"ryant71","edited":false,"id":"ctomi","parent_id":"t1_ctog6","subreddit":"reddit.com","author_flair_css_class":null,"created_utc":1165321742,"score":1,"ups":1,"controversiality":0,"body":"I stand corrected w.r.t. the voting rights of women in the middle east. The various prime ministers being woman surprised me to be honest. \r\n\r\nDon't know so much about Afghanistan being secular in the recent past. The taliban regime was and still is (where they retain control) despicable in their treatment of women... and ancient Buddhist statues. There was some justification in removing the Taliban's control over the whole of Afghanistan.\r\n\r\nThe failure in Afghanistan is due to the western forces (mainly the US) spreading its strength into Iraq -- which it should never have gotten involved in. \r\n\r\nPerhaps my perceptions (of Islam's oppression of women) are skewed because of the reports that come out of places like Iran and Pakistan describing how young girls are raped and then convicted of adultery because their weren't four male witnesses to the rape to testify that the girl defended herself valiantly and wasn't showing too much ankle. \r\n\r\nGranted, in the cold war NATO and Warsaw Pact countries did some despicable things to further the aims of their ideologies. One just needs to look at how the US/UK got South Africa involved in Angola in 1975 -- just in time to save UNITA from certain destruction at the hands of the communist backed MPLA. In doing so, they extended the Angolan civil war by 25 years and caused a country blessed with an abundance of natural resources to wallow in a quagmire of violence until UNITA finally capitulated when Jonas Savimbi was killed a few year's ago.\r\n\r\nI also read recently how the Reagan administration approved the development of depleted uranium in projectile ammunition. That ammunition was used in both Gulf Wars and continues to cause birth defects, etc.\r\n\r\nI agree with you totally w.r.t. the inherant evils of fundamentalism. Apart from all that you mentioned, fundamentalism also sometimes breeds in \"normal\" people (like me most days of the week except mondays) a kind of equally fundamentalist response. I have to remind myself constantly not think *like* a fundamentalist when I think *about* fundamentalists. \r\n\r\nAnyway, good talking to you. I must return to the grindstone that is my life right now ;-) \r\n\r\nKeep well.","link_id":"t3_qpu3","stickied":false,"subreddit_id":"t5_6","timestamp_epoch":1566236760,"message_id":"8758-23e5f0d4-0fa0-401c-8bcb-a1ce6f679cad-1566236760"}