{"author_flair_text":null,"author":"toastspork","parent_id":"t3_tn3v","id":"ctp8d","edited":false,"gilded":0,"retrieved_on":1473807803,"distinguished":null,"controversiality":0,"body":"It's this underlying structural similarity in most popular music forms that makes [mashups](http://en.wikipedia.org/wiki/Bastard_pop) possible.\r\n\r\n&amp;nbsp;\r\n\r\nThe key to (Western, at least) music is the balance between the familiar and the novel.  For most people to enjoy a song, it has to have enough things in it that are familiar that our brains can correctly anticipate what comes next.  We find the pattern in the chord progressions, rhythm, melody, tempo, timbre, etc., and we uncousciously *predict* where the song is going.  \r\n\r\nThe novelty comes when the composer selectively *violates* those expectations and takes the song in a different direction.  It challenges our minds to find the new pattern, to fit the unexpected change into a more comprehensive pattern.  It can be as simple as changing the pace, bringing in an new instrument, modulating the key, emphasizing a harmony over the melody, creating a false ending, getting softer/louder, rephrasing an earlier chord progression, playing with the timing, etc., or often combinations of these things.\r\n\r\nThe difficulty is in not challenging the listener **too much** by including too many violations of expectations.  Unfamiliar structures and too much perceived novelty is why many people don't \"get\" more free-form musical styles like jazz and [Musique concrète](http://en.wikipedia.org/wiki/Music_concrete), or even just music from foreign cultures.  These musical styles *do* have rules and conventions, but if they are unfamiliar, your brain has to work too hard to find a pattern to relate it to what you know, and you end up turned off by it.  Difficult Listening.\r\n\r\n[This Is Your Brain on Music](http://www.amazon.com/This-Your-Brain-Music-Obsession/dp/0525949690/sr=1-1/qid=1165330265?ie=UTF8&amp;s=books&amp;tag2=insouciantser-20), by [Dan Levitin](http://www.yourbrainonmusic.com/) is a fairly comprehensive look at how we perceive music, both physically and psychologically, and how our tastes form.  And it's got references to lots of great examples that let you *hear* what he's describing.  For example, he talks about Sinatra's talent for playing with the timing of the vocals, and says that [Songs for Swingin' Lovers!](http://www.amazon.com/Songs-Swingin-Lovers-Frank-Sinatra/dp/B00000AEVA/sr=8-1/qid=1165330840?ie=UTF8&amp;s=music&amp;tag2=insouciantser-20) is where he's at the top of his form, and that in the later albums, particularly the [duets](http://www.amazon.com/Duets-II-90th-Birthday-Collection/dp/B000BRD7CU/sr=8-3/qid=1165331784?ie=UTF8&amp;s=music&amp;tag2=insouciantser-20), he sings \"with the smug self-satisfaction of a mob boss who just had someone killed\".","stickied":false,"link_id":"t3_tn3v","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165331507,"author_flair_css_class":null,"ups":13,"score":13,"timestamp_epoch":1566236760,"message_id":"8993-3d304622-adf2-4113-b914-64c3276036cc-1566236760"}