{"gilded":0,"distinguished":null,"retrieved_on":1473807808,"author":"coldwarrior","author_flair_text":null,"edited":false,"id":"ctpia","parent_id":"t1_ctp06","subreddit":"reddit.com","score":4,"ups":4,"author_flair_css_class":null,"created_utc":1165334905,"controversiality":0,"body":"You are absolutely right.  The main difference I see is that coaches (buses) are not as efficient as trains since a train runs on a dedicated and controlled \"road\" so it can solve the problem of accessing the city center easily.\r\n\r\nI should also think that, because of metal-on-metal rolling resistance is lower than that of a tire that you can transport more people with less fuel on a train.\r\n\r\nWhat I always find interesting is that you will get people like George Monbiot who say they have found the answer to a particular problem, write an article or book about it saying how someone else should implement it, and then go away complaining about how no one will fix the system.\r\n\r\nMany times they also complain about the inequities of capitalism and how the workers are exploited.\r\n\r\nTo those people I say: take one of your ideas and implement it.  While you are at it, provide excellent compensation and benefits for your workers.  Don't just complain about how the world isn't run properly, go out and fix it yourself.  (Writing an article or a book isn't fixing, it's complaining.)\r\n\r\nInvestor money should not be a problem if the idea is truly brilliant as the business sense will be obvious and the plan will sell itself.  This should be especially true if the investors are of the Hollywood type who seem to have plenty of money and things to complain about (but who usually show up only for the photo-op).\r\n\r\nSince I am also just writing instead of doing, I will add my pie-in-the-sky idea: drive-on / drive-off rail service like a ferry.\r\n\r\nThe cars are parked on special carriers which have pivoting components so you can drive on and off like pull through parking (i.e., you never have to reverse).\r\n\r\nOnce your car is on the carrier, you go to the club car and enjoy yourself until you reach your destination.\r\n\r\nThis solves the city-to-city traffic problem while not depriving people of their ability to have personal transportation once they reach their destination.\r\n\r\nSince inter-city driving would be less of a concern, more urban cars would be in demand thereby improving the efficiency of the roads in the cities.","subreddit_id":"t5_6","link_id":"t3_tocm","stickied":false,"timestamp_epoch":1566236761,"message_id":"9126-0e56dd07-962b-405a-accb-04dad03d4ce5-1566236761"}