{"author":"plinkplonk","author_flair_text":null,"edited":false,"id":"ctpjq","parent_id":"t1_ctnb2","gilded":0,"distinguished":null,"retrieved_on":1473807809,"body":"hmmm \r\nok so is Rainer saying  \"Lisp is unlike C, C++, perl, python, ruby, tcl, ocaml, haskell etc  and like Java\"? \r\n\r\n The first group of languages all play well with the operating system and don't need to live in their own worlds. There are no universal python centric ides , for e.g. Most python developers just fire up whatever editor and build tools they use on a daily basis.\r\n\r\nThus the argument shrinks to \"Lisp and Java have some things in common, particularly the need for custom ides and build tools\". \r\n\r\nWell duh! A significant point to be considered here is that these ides and build tools were developed well after java became wide spread. I (for one) started developing in Java in 1994 in emacs. \r\n\r\nSubstantial systems were written in java well before ides like eclipse and net beans and toolkits like ant (which is what you refer to as \"java specific build tools\" I imagine) junit, hibernate, etc were available. \r\n\r\nYes java from the beginning had a \"batteries included\" orientation but this has nothing to do with any \"huge investment by Sun and others which allows it to overcome these obstacles through brute force\". See Python for a counter example where a language developed by one man as an open source effort (and plays well with the environment btw) went on to become a huge success . \r\n\r\n Besides, the ides and dev tools were developed AFTER java became widely accepted (a point which lisp never reached) and not before. So I guess the similairity between java and lisp is that they are both neither \"scripting\" languages (like ruby or python or  tcl) or os building languages (like c). Hmm that makes Lisp \"different\" but perhaps not in the sense Rainer intended.","controversiality":0,"subreddit_id":"t5_2fwo","stickied":false,"link_id":"t3_tksn","subreddit":"programming","score":3,"ups":3,"created_utc":1165335339,"author_flair_css_class":null,"timestamp_epoch":1566236761,"message_id":"9143-3d6c3c76-e5b0-4be7-9be9-cfbbcdc10bd3-1566236761"}