{"author_flair_text":null,"author":"NitsujTPU","parent_id":"t1_ctplz","edited":false,"id":"ctppq","gilded":0,"retrieved_on":1473807812,"distinguished":null,"controversiality":0,"body":"I'm not so sure about that.\r\n\r\n\r\nReddit *is* pretty mainstream.  There isn't that much here that you need a PhD to decipher, not that there ever was on Slashdot either, but, unlike Slashdot, I can't remember a time when it was predominantly technology oriented.  There is a lot of political material and the like on here.  The only thing that makes it not mainstream is the number of crazy conspiracy theories, and the strong political polarization.  I'm not sure that mellowing that out will decrease the site's popularity.\r\n\r\n\r\nSlashdot, on the other hand, suffers greatly from this.  You had a board that is mostly technically-oriented people, during the dot-com boom, mind you, when the bar was lower for entry and the community was larger and more ubiquitous, and comprised of different sorts of people.  Of course, more people wanted to be perceived as tech savvy, managerial sorts and others, and so the board picked up a broader readership.  This diluted the content, which was primarily the comments.  On reddit, I primarily read the links.\r\n\r\n\r\nI don't really agree with the author's premise at all, to be honest.  While reddit is enjoyable, I don't think that it's terribly influential, not in the way that Slashdot was. (Not to be rude about it.  It's obviously good enough to make you dot-com millionaires.  I'm not sure that that corresponds to influence.)  I also don't think that it is terribly outside of the mainstream in a way that would cause it to fail as more people catch onto the site.  It's not predominantly about tech, it's really a hodgepodge.  It used to be predominantly about politics, and there's still a strong vein of that.  The non-mainstream stuff is junk science and stuff off of conspiracy theory websites like prisonplanet.  Why would a more mainstream readership break this?  I admit, it might push the conspiracy theorists to the next site.  At that point, you only have to worry about it being a passing fad.  Honestly, I don't think that that will be the case either.  There is a lasting interest in sites of this nature.\r\n\r\n\r\nIn short, reddit is probably safe for a while yet.","stickied":false,"link_id":"t3_toy8","subreddit_id":"t5_6","subreddit":"reddit.com","created_utc":1165337519,"author_flair_css_class":null,"score":16,"ups":16,"timestamp_epoch":1566236761,"message_id":"9238-57c28400-7b9d-4613-b212-7320c27d6ddc-1566236761"}