{"author_flair_css_class":null,"created_utc":1165349897,"score":2,"ups":2,"subreddit":"reddit.com","link_id":"t3_tivn","stickied":false,"subreddit_id":"t5_6","body":"Eh.  The Updike thing boils down to a bad footnote in a popularizing book that he wrote in his 80s, and the other points are a bit funny, but don't matter in proper scale and context.  I actually don't agree with him on many points (esp. on evolution), but he is still an important intellectual in the world of Comp. Religion.  He is the author of the textbook used in most comp. religion courses taught in the U.S., is a respected scholar in that field, and when writing on that topic is strong and well respected in the academic community.  If he gets a bit softer on science here and there it's forgivable, especially since his points are by and large philosophical, and he has a lot of insight and a good understanding in the questions and interrelationship of of theology, metaphysics, ontology, and epistemology. \r\n\r\nThings really go both ways on the problem of experts leaving their topic of expertise.  Dawkins is generally fine when he speaks science, but in his last book, the God Delusion, as soon as he turns to religion his poverty of understanding of philosophy and theology shines through, as many reviewers have pointed out.  A quick Google of Dawkins reveals a number of reviews not at all flattering to his works on atheism.  He really is more in the caliber of a Madalyn Murray O'Hair than a Bertrand Russell.  I cringe every time I see Dawkins and Russell compared uncritically.  There are proponents of atheism like Dennett out there that are actually trained philosophers who are not nearly as weak, I have speculated in the past and still believe that Dawkins is more popular since he is a shallower writer and offers easy answers to hard questions.\r\n\r\nThat's why I would like to see him have a debate with someone who was an expert on religion, as he would not be able to get away with the sophistic games, blurring of distinctions, and weak characterizations that color his writing and speaking on religion.  Even a properly trained Jesuit would do.  While I don't know it, I do get the sense that he knows full well just how weak he is in the area as he doesn't ever appear with anyone with a sophisticated academic background since he knows just how poorly he understands some topics, but he still finds time to slum it with Liberty U. students and Ted Haggard.","controversiality":0,"retrieved_on":1473807831,"distinguished":null,"gilded":0,"edited":false,"parent_id":"t1_ctpma","id":"ctqov","author_flair_text":null,"author":"[deleted]","timestamp_epoch":1566236761,"message_id":"9743-791467dc-9650-44fa-bf7c-3dca132bc81d-1566236761"}